{"0":{"speaker_id":0,"date":{"seconds":1534482000,"nanoseconds":0},"video":"https://www.youtube.com/embed/574upkq0wDE","title":"DNA Topology","keywords":["DNA","topoisomerase","site-specific recombination","knots","links","tangle model","supercoiling","viral capsids"],"abstract":"<p align=\"justify\"><br>\tCellular DNA is a long, thread-like molecule with remarkably complex topology. Enzymes that manipulate the geometry \t\t\t\t\t\t\t\t\tand topology of cellular DNA perform many vital cellular processes (including segregation of daughter chromosomes, gene \t\t\t\t\t\t\t\t\tregulation, DNA repair, and generation of antibody diversity). Some enzymes pass DNA through itself via enzyme-bridged \t\t\t\t\t\t\t\t\ttransient breaks in the DNA; other enzymes break the DNA apart and reconnect it to different ends. In the topological \t\t\t\t\t\t\t\t\tapproach to enzymology, circular DNA is incubated with an enzyme, producing an enzyme signature in the form of DNA knots \t\t\t\t\t\t\t\t\tand links. By observing the changes in DNA geometry (supercoiling) and topology (knotting and linking) due to enzyme action, \t\t\t\t\t\t\t\t\tthe enzyme binding and mechanism can often be characterized. This talk will discuss topological models for DNA strand passage \t\t\t\t\t\t\t\t\tand exchange, including the analysis of site-specific recombination experiments on circular DNA and the analysis of packing \t\t\t\t\t\t\t\t\tgeometry of DNA in viral capsids. </p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"1":{"speaker_id":1,"date":{"seconds":1536296400,"nanoseconds":0},"video":"https://www.youtube.com/embed/Yd83jnhnCS4","title":"A brief introduction to Discrete Exterior Calculus","keywords":["differential forms","Hodge star operator","simplicial complex","boundary operator","discrete exterior calculus"],"abstract":"<p align=\"justify\"><br>Discrete Exterior Calculus (DEC) is a relatively new method for solving partial differential equations \t\t\t\t\t\t\t\t\tnumerically. The central idea of the method is to develop a discrete version of Exterior Differential \t\t\t\t\t\t\t\t\tCalculus. In this talk, we will briefly review the various operators of Exterior Differential Calculus \t\t\t\t\t\t\t\t\tand their discrete versions. We will then focus our attention in 2D DEC, presenting a geometric \t\t\t\t\t\t\t\t\tinterpretation of DEC as well as numerical comparisons with the Finite Element Method in order to show \t\t\t\t\t\t\t\t\tDEC’s competitive performance. </p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"2":{"speaker_id":2,"date":{"seconds":1537506000,"nanoseconds":0},"video":"https://www.youtube.com/embed/uPDxjaNSMcw","title":"Knotted DNA: conformational, dynamical and pore-translocation properties","keywords":["pore translocation","DNA knots","DNA supercoiling","DNA"],"abstract":"<p align=\"justify\"><br>Knots and supercoiling are both introduced in bacterial plasmids by catalytic processes involving \t\t\t\t\t\t\t\t\tDNA strand passages. I will report on a recent study where we used molecular dynamics simulations and a mesoscopic \t\t\t\t\t\t\t\t\tDNA model, to study the simultaneous presence of knots and supercoiling in DNA rings and the kinetic and metric \t\t\t\t\t\t\t\t\timplications which may be relevant for the simplyfing action of topoisomerases. Finally, I will discuss how the same \t\t\t\t\t\t\t\t\tmodelling and simulation approach can be used shed light on the complex experimental phenomenology of knotted DNA \t\t\t\t\t\t\t\t\ttranslocating through solid state nanopores.</p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"3":{"speaker_id":3,"date":{"seconds":1539925200,"nanoseconds":0},"video":"https://www.youtube.com/embed/QD4-qm2-vTA","title":"Discrete Morse Theory","keywords":["discrete Morse theory","persistent homology","cellular sheaf theory","flow category"],"abstract":"<p align=\"justify\"><br>Large-scale homology computations are rendered tractable in practice by \t\t\t\t\t\t\t\t\ta combinatorial version of Morse theory. Assuming that my internet connection survives, in \t\t\t\t\t\t\t\t\tthis talk I will introduce discrete Morse theory, describe how it helps with computing \t\t\t\t\t\t\t\t\tvarious types of homology, and outline a powerful new higher-categorical extension. The \t\t\t\t\t\t\t\t\taudience will not require prior knowledge of any of the technical terms mentioned above.</p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"4":{"speaker_id":4,"date":{"seconds":1541743200,"nanoseconds":0},"video":"https://www.youtube.com/embed/JZUe54BwRGI","title":"Simplicial complexity: piecewise linear motion planning in robotics.","keywords":["topological complexity","simplicial topology","simplicial aproximation","contiguity of maps"],"abstract":"<p align=\"justify\"><br> Using the notion of contiguity of simplicial maps, and its relation (via iterated \t\t\t\t\t\t\t\t\tsubdivisions) to the notion of homotopy between continuous maps, we adapt Farber's topological complexity \t\t\t\t\t\t\t\t\tto the realm of simplicial complexes. We show that, for a finite simplicial complex K, our discretized \t\t\t\t\t\t\t\t\tconcept recovers the topological complexity of the realization of K.</p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"5":{"speaker_id":5,"date":{"seconds":1542952800,"nanoseconds":0},"video":"https://www.youtube.com/embed/IYmEPzD4YQg","title":"Geometric devils in topological dynamics.","keywords":["inflexion","singularity","self-linking","twist","knots","braids","topological change","Möbius band","2-sided disk"],"abstract":"<p align=\"justify\">Geometric and topological features play an important role in many physical \t\t\t\t\t\t\t\t\tsystems, especially in fluid dynamics where forces drive continuous \t\t\t\t\t\t\t\t\tdeformation. The benign influence of geometry, which is the muscular actor in \t\t\t\t\t\t\t\t\ttopological dynamics, has sometimes a more devilish nature. Here we show \t\t\t\t\t\t\t\t\thow two different types of singularities that may emerge during the evolution \t\t\t\t\t\t\t\t\tof magnetic fields and soap films are responsible for the spontaneous reorganization \t\t\t\t\t\t\t\t\tand energy change of these systems.</p> \t\t\t\t\t\t\t\t<p align=\"justify\">A first example is given by the inflexional instability of magnetic knots that \t\t\t\t\t\t\t\t\tunder conservation of self-linking number brings inflexional magnetic knots to \t\t\t\t\t\t\t\t\tinflexion-free braids through an integrable singularity of torsion. A second \t\t\t\t\t\t\t\t\texample is given by the continuous deformation of a soap film Möbius band to \t\t\t\t\t\t\t\t\ta 2-sided disk by a drastic change of the soap film topology through a twisted \t\t\t\t\t\t\t\t\tfold catastrophe. These are examples of generic behaviors that trigger energy \t\t\t\t\t\t\t\t\trelaxation in a wide variety of different physical contexts. </p> \t\t\t\t\t\t\t\t<p align=\"justify\">[1] Moffatt, H.K. & Ricca, R.L. (1992) Helicity and the Călugăreanu invariant. <i>Proc. R. Soc. A</i> <b>439</b>, 411-429. <br> \t\t\t\t\t\t\t\t\t[2] Ricca, R.L. (2005) Inflexional disequilibrium of magnetic flux tubes. <i>Fluid\tDyn. Res.</i> <b>36</b>, 319-332. <br> \t\t\t\t\t\t\t\t\t[3] Goldstein, R.E., Moffatt, H.K., Pesci, A.I. & Ricca, R.L. (2010) A soap\tfilm Möbius strip changes topology with a twist \t\t\t\t\t\t\t\t\tsingularity. <i>Proc.\tNatnl. Acad. Sci. USA</i> <b>107</b>, 21979-21984.</p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"6":{"speaker_id":6,"date":{"seconds":1543557600,"nanoseconds":0},"video":"https://www.youtube.com/embed/rHjsntnze9U","title":"A very elementary introduction to the combinatorial topology approach to distributed computing.","keywords":["distributed computing","combinatorial topology"],"abstract":"<p align=\"justify\">An introductory lecture following the approach of the book by Herlihy, Kozlov, Rajsbaum \t\t\t\t\t\t\t\t\"Distributed Computing through Combinatorial Topology\", Elsevier-Morgan Kaufmann, \t\t\t\t\t\t\t\tbased on the notions of indistinguishability and perspectives. \t\t\t\t\t\t\t\tIllustrating the use of simplicial complexes via simple examples. No preliminary \t\t\t\t\t\t\t\tknowledge either about topology or about distributed computing. </p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"7":{"speaker_id":7,"date":{"seconds":1538888400,"nanoseconds":0},"video":"https://www.youtube.com/embed/wHyGoKGy_7A","title":"Polarization geometry of crystals and the blue sky.","keywords":["polarization","optical axis","multiple scattering","birefringence"],"abstract":"<p align=\"justify\">The world would look very different to us if, like many insects and other animals, \t\t\t\t\t\t\t\t\tour eyes could see the polarization of light. In particular, we would see a distinctive “fingerprint” \t\t\t\t\t\t\t\t\tpattern in the blue sky overhead, as well as many crystalline materials that surround us. \t\t\t\t\t\t\t\t\tIn this talk I will describe the geometry of optical polarization patterns from Maxwell’s equations, \t\t\t\t\t\t\t\t\tand in doing so reveal the deep and surprising relationship between the polarization pattern of \t\t\t\t\t\t\t\t\tbirefringent crystals and the blue sky, based on a geometric and topological understanding of the \t\t\t\t\t\t\t\t\ttensors involved in the propagation and scattering of light. </p>","season":"FALL 2018","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"8":{"speaker_id":8,"date":{"seconds":1548396000,"nanoseconds":0},"video":"https://www.youtube.com/embed/zY6mTpkG9FQ","title":"Unitary Braiding and Topological Quantum Computing.","keywords":["quantum computation","Hilbert space","complex space","state vector","unitary transformation","measurement","quantum Hall effect","Fibonacci model","Majorana Fermion","Artin braid group","unitary braiding","Clifford algebra"],"slides":"https://www.dropbox.com/sh/fhonhrtm62f1ge5/AAAVfhjvxnUinMlRekrAghTwa?dl=0","abstract":"<p align=\"justify\">Quantum computation can be regarded as a methodical study of the \t\t\t\t\t\t\t\t\tstructure preparation, evolution, and measurement of \t\t\t\t\t\t\t\t\tquantum systems in a computational framework. In a quantum system, a physical state corresponds to \t\t\t\t\t\t\t\t\ta unit length vector in a complex space (Hilbert space or finite dimensional complex space depending on the problem). \t\t\t\t\t\t\t\t\tA physical process corresponds to the application of a unitary transformation to a state. \t\t\t\t\t\t\t\t\tA measurement of a state projects that state to one of a number of orthogonal possibilities represented by an orthonormal \t\t\t\t\t\t\t\t\tbasis for the complex space. The probability of a measurement is the absolute square of its coefficient in the state vector. \t\t\t\t\t\t\t\t\tA quantum computer consists in a unitary transformation and the capability to prepare states, apply the unitary transformation and measure the results. \t\t\t\t\t\t\t\t\tThe statistics of repeated measurement gives the information for the computation. Thus the key to quantum computing is the design of unitary transformations \t\t\t\t\t\t\t\t\tthat can accomplish a particular task. There are a number of designs that are very interesting such as Shor’s method of factoring integers on a quantum \t\t\t\t\t\t\t\t\tcomputer. The design of actual quantum computers is very difficult because it is hard to control measurement and keep the system from decohering in its \t\t\t\t\t\t\t\t\tinteraction with the environment. It is thought that topological physical situations, such as the behaviour of anyons in the quantum Hall effect or the behaviour of \t\t\t\t\t\t\t\t\tMajorana Fermions in nano wires, may hold the key to the desired fault tolerant computation. In both of these instances one can formulate the unitary transformations \t\t\t\t\t\t\t\t\tin terms of representations of the Artin Braid group that are related to the physics of the situation. It is thought that such topological phases of physical systems will \t\t\t\t\t\t\t\t\tbe resistant to perturbation and will make scalable quantum computing possible. It is the purpose of this talk to describe braiding related to both the quantum Hall effect \t\t\t\t\t\t\t\t\t(the Fibonacci model) and unitary braiding related to Majorana Fermions (braiding from Clifford algebras). The talk will be self-contained and as pictorial as possible. </p>","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"9":{"speaker_id":9,"date":{"seconds":1549605600,"nanoseconds":0},"video":"https://www.youtube.com/embed/twSF7f5sDck","title":"Learning Algebraic Varieties from Samples.","keywords":["persistent homology","dimension estimates","learning varieties","varieties"],"abstract":"<p align=\"justify\">\"I will discuss how to determine vanishing polynomials on a fixed finite sample of points and what to do with that information. For example, from the equations defining a variety one can learn \t\t\t\t\t\t\t\t\tthe degree and the dimension of the variety. One can also construct ellipsoid complexes which, based on the experiments, strengthen the topological signal for persistent homology. All the algorithms needed are \t\t\t\t\t\t\t\t\tmade available in a Julia package.\" </p>","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"10":{"speaker_id":10,"date":{"seconds":1550815200,"nanoseconds":0},"video":"https://www.youtube.com/embed/Z9hEu2H5aUY","title":"Discrete Morse theory in action.","keywords":["discrete Morse theory","feature tracking","topological complexity","robot motion planners"],"abstract":"<p align=\"justify\"> In this talk, the basics of discrete Morse theory will first be \t\t\t\t\t\t\t\t\tshortly summarized. We will then describe two generalizations which both have \t\t\t\t\t\t\t\t\tapplications to mathematical models associated with motion. Parametric discrete \t\t\t\t\t\t\t\t\tMorse theory can be applied to tracking the motion of features in a sequence of \t\t\t\t\t\t\t\t\timages or scenes, and fiberwise discrete Morse theory to robot motion planning. </p>","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"11":{"speaker_id":11,"date":{"seconds":1552024800,"nanoseconds":0},"video":"https://www.youtube.com/embed/jdI4PZ_McY0","title":"Why are there knots in proteins?","keywords":["protein structure","protein stability","knotted proteins","methyltransferase","ubiquitin c-terminal hydrolase","knot-promoting loops","UCH-L1","YibK","YbeA","knots"],"abstract":"<p align=\"justify\"> There are now more than 1700 protein chains that are known to contain \t\t\t\t\t\t\t\t\t\tsome type of topological knot in their polypeptide chains in the protein structure \t\t\t\t\t\t\t\t\t\tdatabank. Although this number is small relative to the total number of protein structures \t\t\t\t\t\t\t\t\t\tsolved, it is remarkably high given the fact that for decades it was thought impossible \t\t\t\t\t\t\t\t\t\tfor a protein chain to fold and thread in such a way as to create a knotted structure. \t\t\t\t\t\t\t\t\t\tThere are four different types of knotted protein structures that contain 31, 41, 52 and \t\t\t\t\t\t\t\t\t\t61 knots and over the past 15 years there has been an increasing number of experimental and \t\t\t\t\t\t\t\t\t\tcomputational studies on these systems. The folding pathways of knotted proteins have been \t\t\t\t\t\t\t\t\t\tstudied in some detail, however, the focus of this talk is to address the fundamental question \t\t\t\t\t\t\t\t\t\t“Why are there knots in proteins?” It is known that once formed, knotted protein structures \t\t\t\t\t\t\t\t\t\ttend to be conserved by nature. This, in addition to the fact that, at least for some deeply \t\t\t\t\t\t\t\t\t\tknotted proteins, their folding rates are slow compared with many unknotted proteins, has led \t\t\t\t\t\t\t\t\t\tto the hypothesis that there are some properties of knotted proteins that are different from \t\t\t\t\t\t\t\t\t\tunknotted ones, and that this had resulted in some evolutionary advantage over faster folding \t\t\t\t\t\t\t\t\t\tunknotted structures. In this talk, I will review the evidence for and against this theory. \t\t\t\t\t\t\t\t\t\tIn particular, how a knot within a protein chain may affect the thermodynamic, kinetic, \t\t\t\t\t\t\t\t\t\tmechanical and cellular (resistance to degradation) stability of the protein will be discussed. </p>","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"12":{"speaker_id":12,"date":{"seconds":1553839200,"nanoseconds":0},"video":"https://www.youtube.com/embed/zs8zmeWzC4M","title":"Local solutions for global problems in wireless networks","keywords":["routing","algorithms","network","nodes","wireless networks"],"abstract":"<p align=\"justify\"> In this paper we study on-line local routing algorithms for plane geometric \t\t\t\t\t\t\t\t\tnetworks. Our algorithms take advantage of the geometric properties of planar to route \t\t\t\t\t\t\t\t\tmessages using only local information available at the nodes of a network. We pay special \t\t\t\t\t\t\t\t\tattention to on-line local routing algorithms which guarantee that \t\t\t\t\t\t\t\t\ta message reaches its destination. A message consists of data that have to be \t\t\t\t\t\t\t\t\tsent to a destination node, i.e. the message itself plus a finite amount of space \t\t\t\t\t\t\t\t\tthat keeps only a constant amount of data to aid a message to reach its destination, e.g. the address of \t\t\t\t\t\t\t\t\tthe starting and destination nodes, a constant number of \t\t\t\t\t\t\t\t\tnodes visited, etc. Local means that at each site we have at our disposal only local \t\t\t\t\t\t\t\t\tinformation regarding a node and its neighbors, i.e. no global knowledge of the \t\t\t\t\t\t\t\t\tnetwork is available at any time, other that the network is planar and connected. \t\t\t\t\t\t\t\t\tWe then develop location aided local routing algorithms for wireless communication \t\t\t\t\t\t\t\t\tnetworks, in particularly cellular telephone networks. </p>","warning":"Sound is not very clear.","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"13":{"speaker_id":13,"date":{"seconds":1555045200,"nanoseconds":0},"video":"https://www.youtube.com/embed/Etijnx5B3_U","title":"Mysteries of entanglement – proteins, life and physics. Biological role of knotting.","keywords":["proteins","knots","lassos","links","theta curves","entanglement","biology"],"abstract":"<p align=\"justify\"> Knotted proteins are believed to be functionally advantageous and to provide extra \t\t\t\t\t\t\t\t\tstability to protein chains [1]. Twenty years of their investigation suggests that they fold via a \t\t\t\t\t\t\t\t\tslipknot conformation, across the native twisted loop. During the talk I will show that diversity of \t\t\t\t\t\t\t\t\tidentified folds of knotted proteins and their locations in cells is still growing and surprising us. \t\t\t\t\t\t\t\t\t<br> \t\t\t\t\t\t\t\t\tMoreover recently we went one step further and found that proteins can be even more entangled than \t\t\t\t\t\t\t\t\tknots – they also form lassos and links, which consist of several components. Based on the search \t\t\t\t\t\t\t\t\tthrough the entire Protein Data Bank we identified several sequentially nonhomologous chains that \t\t\t\t\t\t\t\t\tform a Hopf link, a Solomon link [2], and various types of lassos. I will show that topological \t\t\t\t\t\t\t\t\tproperties of these proteins are related to their function and stability. Finally I will explain how \t\t\t\t\t\t\t\t\tthe presence of links affects folding pathways of proteins and present new reaction coordinate to \t\t\t\t\t\t\t\t\tstudy entangled proteins. \t\t\t\t\t\t\t\t\t<br> \t\t\t\t\t\t\t\t\tDuring my talk I will also present knotted TrmD which is the leading antimicrobial drug target \t\t\t\t\t\t\t\t\towing to its essen­tiality for bacterial growth, its broad conservation across bacterial species, \t\t\t\t\t\t\t\t\tand its substantial differences from the human and archaeal counterpart Trm5. I will also present \t\t\t\t\t\t\t\t\tour achievements in designing selective inhibitor for TrmD, based on combining theoretical and \t\t\t\t\t\t\t\t\texperimental methods [3]. \t\t\t\t\t\t\t\t\t<br> \t\t\t\t\t\t\t\t\tAll entangled proteins – 7% of proteins deposited in the PDB – are collected in databases: KnotProt, \t\t\t\t\t\t\t\t\tLassoProt and LinkProt. </p> \t\t\t\t\t\t\t\t\t<p align=\"justify\"> \t\t\t\t\t\t\t\t\t[1] JI Sulkowska, E Rawdon, KC Millett, J Onuchic, A Stasiak, PNAS (2012) 109: E1715-23 \t\t\t\t\t\t\t\t\t<br> \t\t\t\t\t\t\t\t\t[2] P Dabrowski-Tumanski, JI Sulkowska, PNAS (2017) 114, 3415–3420 \t\t\t\t\t\t\t\t\t<br> \t\t\t\t\t\t\t\t\t[3] T Christian, et al., Nature S&MB (2016) 23, 941-948 </p>","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"14":{"speaker_id":14,"date":{"seconds":1557464400,"nanoseconds":0},"video":"https://www.youtube.com/embed/fdwtH7b6euI","title":"Directed topological complexity.","keywords":["directed algebraic topology","topological complexity","directed invariants","homotopy theory","differential inclusions","control theory"],"abstract":"<p align=\"justify\"> I will introduce in this talk a variant of topological complexity, that can be applied to help classify directed spaces, and has applications to the study of dynamical \t\t\t\t\t\t\t\t\tsystems in the large, such as differential inclusions. Directed topological complexity looks for specific partitions {F1,…,Fn,…} of the set of reachable states of some directed space X, \t\t\t\t\t\t\t\t\tsuch that there is a continuous section from each of the Fi to the space of directed paths which is right inverse to the end points map. As in the classical case, this sheds an interesting \t\t\t\t\t\t\t\t\tlight on a number of directed invariants, and we discuss in particular dicontractibility. We will also show some examples of calculations on directed graphs, non-positively curved cubical \t\t\t\t\t\t\t\t\tcomplexes, and directed spheres.</p> \t\t\t\t\t\t\t\t\t<p> \t\t\t\t\t\t\t\t\tThis ongoing work with Aurélien Sagnier and Michael Farber. </p>","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"15":{"speaker_id":15,"date":{"seconds":1558674000,"nanoseconds":0},"video":"https://www.youtube.com/embed/NKNkequdrVs","title":"Geometric Topology of Liquid Crystal Textures.","keywords":["crystal","textures","cholesteric","chirality","distortions","nematic"],"abstract":"<p align=\"justify\"> The textures and phases of liquid crystals are replete with geometric motifs, and the geometric approach \t\t\t\t\t\t\t\t\tto elasticity underpins a large portion of nonlinear theories. Despite this, the basic characterisation of topology comes \t\t\t\t\t\t\t\t\tfrom the homotopy theory without particular attention to geometric features. I will describe our recent work developing \t\t\t\t\t\t\t\t\tgeometric approaches to liquid crystal topology, describing cholesteric point defects and topological chirality, and the \t\t\t\t\t\t\t\t\tgeometric features of bend distortions, illustrated by applications to the twist-bend nematic phase.</p>","season":"SPRING 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"16":{"speaker_id":16,"date":{"seconds":1566536400,"nanoseconds":0},"video":"https://www.youtube.com/embed/1QpL_26cL7I","title":"Some New Geometric Methods to Distinguish Shapes and Applications in Biology","keywords":["shape","metric","space","genus-zero","surfaces","biology"],"abstract":"<p align=\"justify\"> Almost everything we encounter in our 3-dimensional world is a surface - the outside of a solid object. Comparing \t\t\t\t\t\t\t\t\tthe shapes of surfaces is, not surprisingly, a fundamental problem in both theoretical and applied mathematics. Deep mathematical \t\t\t\t\t\t\t\t\tresults are now being used to study objects such as bones, brain cortices, proteins and biomolecules. This talk will discuss \t\t\t\t\t\t\t\t\tjoint work with Patrice Koehl that introduces a new metric on the space of genus-zero surfaces and applies it in this context.</p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"17":{"speaker_id":17,"date":{"seconds":1567746000,"nanoseconds":0},"video":"https://www.youtube.com/embed/aJTR5l1EIwE","title":"Topological Dimensionality Reduction.","keywords":["Dimensionality reduction","topological data analysis (TDA)","persistent homology","Eilenberg-MacLane coordinates"],"abstract":"<p align=\"justify\"> When dealing with complex high-dimensional data sets, several machine learning tasks rely on having appropriate low-dimensional representations. These reductions are often \t\t\t\t\t\t\t\t\tphrased in terms of preserving statistical or metric information and may fail to recover important topological features. We will describe in this talk several schemes to take advantage of \t\t\t\t\t\t\t\t\tthe underlying topology of a data set, in order to produce informative low-dimensional coordinates. </p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"18":{"speaker_id":"18","date":{"seconds":1570165200,"nanoseconds":0},"video":"https://www.youtube.com/embed/Npyw75dWY2Y","title":"Random entanglements: Winding of planar Brownian motions","keywords":["planar Brownian motion","entanglement","winding number"],"abstract":"<p align=\"justify\"> There exists a wide class of winding problems, where one or more \t\t\t\t\t\t\t\t\tplanar Brownian motions get entangled around each other and obstacles \t\t\t\t\t\t\t\t\tin the plane. These can be seen as models of entanglement of long \t\t\t\t\t\t\t\t\tmolecules, or as a general framework for understanding dynamical \t\t\t\t\t\t\t\t\ttopological complexity. I will review some classical results, such as \t\t\t\t\t\t\t\t\tSpitzer's law, which gives the angular distribution for a planar \t\t\t\t\t\t\t\t\tBrownian motion around the origin. I will discuss a recent variation \t\t\t\t\t\t\t\t\t(with Huanyu Wen) where we add a drift that promotes entanglement. \t\t\t\t\t\t\t\t\tFinally, I will present ongoing work (with Gage Bonner and Benedek \t\t\t\t\t\t\t\t\tValko) on the much more challenging problem of winding around several \t\t\t\t\t\t\t\t\tobstacles. In some limits, this can be reduced to computing the \t\t\t\t\t\t\t\t\tescape rate for a random walk on a so-called regular languages. </p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"19":{"speaker_id":19,"date":{"seconds":1571374800,"nanoseconds":0},"video":"https://www.youtube.com/embed/OfTTZpaOq8M","title":"Topological modeling of DNA recombination","keywords":["DNA knots","reconnection","link nomenclature","DNA topology","DNA"],"abstract":"<p align=\"justify\"> DNA replication in bacteria yields two interlinked circular chromosomes. Returning the chromosomes to an unlinked monomeric state is \t\t\t\t\t\t\t\t\tessential to cell survival. Simplification of DNA topology is mediated by enzymes, such as recombinases and topoisomerases. We here focus on \t\t\t\t\t\t\t\t\tsite-specific recombinases that recognize two short segments of DNA (the recombination sites), introduce two double stranded breaks and recombine \t\t\t\t\t\t\t\t\tthe ends. The local action of site-specific recombinases is a reconnection event which is modeled mathematically as a band surgery. The banding is \t\t\t\t\t\t\t\t\tcoherent or non-coherent, depending on the relative orientation of the recombination sites. We use tools from low dimensional topology to investigate \t\t\t\t\t\t\t\t\tthe mechanism of action of these enzymes, and we complement the analytical work with computer simulations. The numerical work provides a quantitative \t\t\t\t\t\t\t\t\tmeasure to distinguish among pathways of topology simplification by recombination, and also informs the search for bandings between specific pairs of \t\t\t\t\t\t\t\t\tlink types. </p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"20":{"speaker_id":20,"date":{"seconds":1573192800,"nanoseconds":0},"video":"https://www.youtube.com/embed/_kDIFc2Y94U","title":"Modeling topological polymers with Gaussian random graph embeddings.","keywords":["topological polymers","network polymers","random polygons","random graph embeddings","Kirchhoff index","biopolymers"],"abstract":"<p align=\"justify\"> Very recently, chemists have succeeding in synthesizing purified samples of polymers which are more topologically \t\t\t\t\t\t\t\t\tcomplicated than the linear or ring polymers which have previously been created. The new polymers have different graph types, including \t\t\t\t\t\t\t\t\ttheta-curves, multithetas, K_{3,3}, and K_4, with new types arriving at a rapid rate. In this talk, we develop a theory of Gaussian \t\t\t\t\t\t\t\t\trandom graph embeddings in order to model the shapes of these polymers in solution. The theory allows us to connect the expected radius \t\t\t\t\t\t\t\t\tof gyration of the polymers with the Kirchhoff index of the graph. We will prove a theorem that describes the asymptotic behavior of the \t\t\t\t\t\t\t\t\texpected radius of gyration for large graphs of fixed topology in terms of the degree-Kirchhoff index of the graph. Last, we show that \t\t\t\t\t\t\t\t\tour theory provides a good fit to data from the Tezuka lab's experimental measurements of the relative sizes of topological polymers with \t\t\t\t\t\t\t\t\tdifferent graph types. </p> \t\t\t\t\t\t\t\t\t<p> \t\t\t\t\t\t\t\t\tThis talk is joint work with Tetsuo Deguchi and Erica Uehara (Ochanomizu University) and Clayton Shokwiler (Colorado State University), \t\t\t\t\t\t\t\t\twith support from the Simons Foundation (#354225 and #52412) and \t\t\t\t\t\t\t\t\tthe Japan Science and Technology Agency (CREST Grant Number JPMJCR19T4, Deguchi Lab) and JSPS KAKENHI Grant Number JP17H06463. </p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"21":{"speaker_id":21,"date":{"seconds":1573797600,"nanoseconds":0},"video":"https://www.youtube.com/embed/StoaNWadOwE","title":"Aspects of High Dimensional Expansion.","keywords":["High dimensional expansion","simplicial cohomology","random complexes"],"abstract":"<p align=\"justify\"> The Cheeger constant is a measure of the edge expansion of a graph, and as such plays a key role in diverse mathematical \t\t\t\t\t\t\t\t\tareas, in particular in combinatorics and theoretical computer science. In recent years there is an interest in higher dimensional notions \t\t\t\t\t\t\t\t\tof expansion that likewise provide a quantitative measure of cohomological acyclicity of a complex in dimension <em>k</em>. In this talk we will \t\t\t\t\t\t\t\t\tfocus on a <em>k</em>-dimensional version of the graphical Cheeger constant called <em>coboundary expansion</em>, and on a related parameter called \t\t\t\t\t\t\t\t\t<em>cosystolic expansion</em>. After introducing these notions and outlining their relevance to random complexes and to topological overlap \t\t\t\t\t\t\t\t\ttheorems, we will discuss two results. The first concerns an application of cosystolic expansion to a stability version of the \t\t\t\t\t\t\t\t\tcohomological classification of <em>G</em>-covering spaces (joint work with Irit Dinur). The second is a lower bound on coboundary expansion under \t\t\t\t\t\t\t\t\tcertain symmetry assumptions (joint work with Dmitry Kozlov). </p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"22":{"speaker_id":22,"date":{"seconds":1574402400,"nanoseconds":0},"video":"https://www.youtube.com/embed/n-vVAeLBbJg","title":"Non-topological persistence.","keywords":["topological persistence","concrete category","weighted graph","coherent sampling","ranging feature","steady feature"],"slides":"https://drive.google.com/file/d/0B_dw9G-4cPi3MTNGUFdmcXlUWlFQZzdGa0NPQmJpXzB1QjlN/view","abstract":"<p align=\"justify\"> After recalling \"classical\" topological persistence, I introduce the generalization of the persistent Betti \t\t\t\t\t\t\t\t\tnumber functions to what we call persistence functions. These are defined axiomatically on a wide class of concrete categories. \t\t\t\t\t\t\t\t\tThen, three types of processes generating persistence functions are shown: coherent samplings and ranging or steady features. \t\t\t\t\t\t\t\t\tExamples of all of them are given on weighted graphs coming from real situations. This is based on a joint work with Mattia G. \t\t\t\t\t\t\t\t\tBergomi, Pietro Vertechi and Lorenzo Zuffi. </p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"23":{"speaker_id":23,"date":{"seconds":1575612000,"nanoseconds":0},"video":"https://www.youtube.com/embed/CzhG0SzcgXY","title":"Topological exploration of neuronal network dynamics.","keywords":["network dynamics","persistent homology"],"abstract":"<p align=\"justify\"> One of the paramount challenges in neuroscience is to understand the dynamics of networks of interconnected \t\t\t\t\t\t\t\t\tneurons. In this talk I will describe a novel approach to classifying network dynamics that employs tools from topological data \t\t\t\t\t\t\t\t\tanalysis. The efficacy of our method was established by studying simulated activity in three small artificial neural networks in \t\t\t\t\t\t\t\t\twhich we varied certain “biological” parameters, giving rise to dynamics that could be classified into four regimes, and showing \t\t\t\t\t\t\t\t\tthat a machine learning classifier trained on features extracted from persistent homology could accurately predict the regime of \t\t\t\t\t\t\t\t\tthe network it was trained on and also generalize to other networks not presented during training. I will also discuss the \t\t\t\t\t\t\t\t\tapplication of these methods to networks of actual neurons in mice. This is joint work with Jean-Baptiste Bardin and Gard \t\t\t\t\t\t\t\t\tSpreemann.</p>","season":"FALL 2019","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"24":{"speaker_id":24,"date":{"seconds":1579845600,"nanoseconds":0},"video":"https://www.youtube.com/embed/EGOvOcaQvqw","title":"Delaunay triangulation of manifolds.","keywords":["computational geometry","computational topology","Delaunay triangulation","manifold"],"abstract":"<p align=\"justify\"> The Delaunay complex is a natural structure to consider when seeking \t\t\t\t\t\t\t\t\t\tto triangulate a space equipped with a metric. It plays a central role \t\t\t\t\t\t\t\t\t\tin the development of algorithms for meshing Euclidean domains. In \t\t\t\t\t\t\t\t\t\tapplications where an anisotropic mesh is desired, a standard approach \t\t\t\t\t\t\t\t\t\tis to consider a Riemannian metric defined over the domain and to \t\t\t\t\t\t\t\t\t\tconstruct an approximate Delaunay triangulation with respect to this \t\t\t\t\t\t\t\t\t\tmetric.</p> \t\t\t\t\t\t\t\t\t\t<p>In the case of surfaces, it has been shown that a Delaunay \t\t\t\t\t\t\t\t\t\ttriangulation exists if the set of sample points is sufficiently dense \t\t\t\t\t\t\t\t\t\tbut this is no longer true in higher dimensional manifolds: sample \t\t\t\t\t\t\t\t\t\tdensity alone is not sufficient to ensure that the Delaunay complex is \t\t\t\t\t\t\t\t\t\ta triangulation. To walk around this difficulty, we first introduce \t\t\t\t\t\t\t\t\t\tperturbation algorithms in Euclidean space that make the Delaunay \t\t\t\t\t\t\t\t\t\ttriangulation of well-distributed point sets quantifiably stable with \t\t\t\t\t\t\t\t\t\trespect to perturbations of the metric or of the point positions. We \t\t\t\t\t\t\t\t\t\tthen adapt this Euclidean perturbation algorithm to the context of \t\t\t\t\t\t\t\t\t\tcompact manifolds equipped with a metric that can be locally \t\t\t\t\t\t\t\t\t\tapproximated by a Euclidean metric. In particular, this includes \t\t\t\t\t\t\t\t\t\tRiemannian metrics, as well as the extrinsic metric on submanifolds \t\t\t\t\t\t\t\t\t\tvariations of which have been exploited in algorithms for \t\t\t\t\t\t\t\t\t\treconstructing submanifolds of Euclidean space from a finite set of \t\t\t\t\t\t\t\t\t\tsample points. The simplicial complex produced by our algorithm is \t\t\t\t\t\t\t\t\t\tnaturally equipped with a piecewise flat metric that is a quantifiably \t\t\t\t\t\t\t\t\t\tgood approximation to the metric on the original manifold. </p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"25":{"speaker_id":25,"date":{"seconds":1581055200,"nanoseconds":0},"video":"https://www.youtube.com/embed/IbTGmxAvAlM","title":"Algebraic Systems Biology","keywords":["algebraic systems","biology","models","topological data analysis (TDA)"],"abstract":"<p align=\"justify\"> Signalling pathways can be modelled as a biochemical reaction network. When the kinetics follow \t\t\t\t\t\t\t\t\tmass-action kinetics, the resulting mathematical model is a polynomial dynamical system. I will overview approaches \t\t\t\t\t\t\t\t\tto analyse these models with steady-state data using computational algebraic geometry and statistics. Then I will \t\t\t\t\t\t\t\t\tpresent how to analyse such models with time-course data using differential algebra and geometry for model \t\t\t\t\t\t\t\t\tidentifiability. Finally, I will present how topological data analysis can provide additional information to \t\t\t\t\t\t\t\t\tdistinguish these models and experimental data from wild-type and mutant molecules. These case studies showcase how \t\t\t\t\t\t\t\t\tcomputational geometry, topology and dynamics can provide new insights in the biological systems, specifically how \t\t\t\t\t\t\t\t\tchanges at the molecular scale (e.g. MEK WT and mutants) result in phenotypic changes (e.g. fruit fly mutations). </p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"26":{"speaker_id":26,"date":{"seconds":1582264800,"nanoseconds":0},"video":"https://www.youtube.com/embed/5aeWC1PwUNE","title":"On the Geometric Hypothesis of Banach.","keywords":["geometric hypothesis","Banach","Hilbert space","conjecture"],"abstract":"<p align=\"justify\"> The following is known as the geometric hypothesis of Banach: let <em>V</em> be an \t\t\t\t\t\t\t\t\t\t<em>m</em>-dimensional Banach space and suppose all <em>n</em>-dimensional subspaces of <em>V</em> \t\t\t\t\t\t\t\t\t\tare isometric, <em>n > 1</em>. In 1932, Banach conjectured that under this \t\t\t\t\t\t\t\t\t\thypothesis <em>V</em> is a Hilbert space. Gromov proved in 1967 that the \t\t\t\t\t\t\t\t\t\tconjecture is true for <em>n=</em>even and Dvoretzky derived the same conclusion \t\t\t\t\t\t\t\t\t\tunder the hypothesis <em>m=infinity</em> and <em>V</em> a real Banach space, V. Millman \t\t\t\t\t\t\t\t\t\tproved the analogous when <em>V</em> is a complex Banach space . We prove this \t\t\t\t\t\t\t\t\t\tconjecture for <em>V</em> a real Banach space of dimension <em>n=4k+1</em>, with the \t\t\t\t\t\t\t\t\t\tpossible exemption of 133.</p> \t\t\t\t\t\t\t\t\t\t<p>The ingredients of the proof are classical homotopy theory, irreducible \t\t\t\t\t\t\t\t\t\trepresentations of the orthogonal group and convex geometry (ellipsoids). At the end of the lecture, \t\t\t\t\t\t\t\t\t\twill discuss the case in which <em>V</em> is a \t\t\t\t\t\t\t\t\t\tcomplex Banach space of dimension <em>n=4k+1</em>. </p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"27":{"speaker_id":27,"date":{"seconds":1583474400,"nanoseconds":0},"video":"https://www.youtube.com/embed/E4bhPpZxtIg","title":"On the interplay between DNA topology, elasticity, and its biological role.","keywords":["Elastic rod theory","Immersed boundary method","DNA supercoiling","gene regulation","DNA","biology"],"abstract":"<p align=\"justify\">Topological properties of DNA molecules play important role in biology. The ability of cells to control DNA topology is essential for their survival, and topology also controls the geometrical properties of the molecule which influence its function. Advances \t\t\t\t\t\t\t\t\tin the theory of DNA elasticity clarified our understanding of this role and other phenomena associated with biological function and storage \t\t\t\t\t\t\t\t\tof DNA. Classical elastic rod models have been applied to DNA supercoiling, knotting, and cyclization, while base-pair level models of DNA \t\t\t\t\t\t\t\t\tmade it possible to incorporate the effects of nucleotide sequence and the negative charge of DNA in new mesoscale models of complex \t\t\t\t\t\t\t\t\tDNA-protein assemblies, which yielded insights into the role of DNA deformability in gene regulation. More recently, simulations of the \t\t\t\t\t\t\t\t\tdynamics of elastic rods submerged in a viscous incompressible fluid has been conducted in order to gain understanding of the behavior of \t\t\t\t\t\t\t\t\ttopologically constrained DNA molecules. This lecture will give an overview of recent research on the above topics. \t\t\t\t\t\t\t\t</p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"28":{"speaker_id":28,"date":{"seconds":1584684000,"nanoseconds":0},"video":"https://www.youtube.com/embed/Qw8O8BdNADo","title":"Some Topological Aspects of Fluid Dynamics.","keywords":["vortex dynamics","singularities","Lagrangian chaos","dynamo mechanisms","magnetic relaxation","knotted vortices","stability","finite-time singularity problem"],"slides":"https://drive.google.com/file/d/1EY3QIy2W37j-7PxEQEr9QQbJm279n1Ex/view","abstract":"<p align=\"justify\">In this this lecture, I will provide an informal introduction to a \t\t\t\t\t\t\t\t\t\trange of topics in fluid dynamics that have a topological character. \t\t\t\t\t\t\t\t\t\tThese topics include flows with boundary singularities, \t\t\t\t\t\t\t\t\t\tLagrangian chaos, frozen-in fields, magnetohydrodynamic \t\t\t\t\t\t\t\t\t\tanalogies, fast and slow dynamo mechanisms, magnetic \t\t\t\t\t\t\t\t\t\trelaxation, minimum energy states, knotted flux tubes, vortex \t\t\t\t\t\t\t\t\t\treconnection and the finite-time singularity problem. I will \t\t\t\t\t\t\t\t\t\tconclude with a number of open questions concerning these topics. </p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"29":{"speaker_id":29,"date":{"seconds":1585893600,"nanoseconds":0},"video":"https://www.youtube.com/embed/yll-4kUoboI","title":"Hamiltonian time crystals - why do they exist and how do they move","keywords":["Hamiltonian dynamics","molecular dynamics","knotted molecules","crystals"],"abstract":"<p align=\"justify\">I explain what is an energy conserving, Hamiltonian time crystal. \t\t\t\t\t\t\t\t\tI show how it arises and how it moves, in terms concrete examples. But according to no-go theorems Hamiltonian time crystals are \t\t\t\t\t\t\t\t\tnot supposed to exist, thus I start and show a way around these no-go theorems: I explain why a timecrystalline dynamics needs \t\t\t\t\t\t\t\t\tto take place on a pre-symplectic rather than a symplectic phase space. For this the Hamiltonian needs to support conserved \t\t\t\t\t\t\t\t\tcharges, and the occurrence of a time crystal becomes relates to the wider concept of spontaneously broken symmetries. Except \t\t\t\t\t\t\t\t\tthat in the case of a time crystal, the symmetry breaking takes place in a dynamical context. I then analyze in detail a general \t\t\t\t\t\t\t\t\tfamily of time crystalline Hamiltonians It describes the dynamics of string-like objects, such as a molecular chain. I show how \t\t\t\t\t\t\t\t\tthe topology of the chain, its knottiness, has a strong effect to its timecrystalline character. \t\t\t\t\t\t\t\t</p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"30":{"speaker_id":30,"date":{"seconds":1587704400,"nanoseconds":0},"video":"https://www.youtube.com/embed/JSVE-ukefPg","title":"Entanglement of Polymers","keywords":["polymer","gel","entanglement","Gauss linking integral","periodic boundary systems","excluded volume","reptation","linking matrix","entanglement length","viscoelasticity","oscillatory shear"],"abstract":"<p align=\"justify\"> Entanglement in polymeric systems has been central theme since, at least, the work of Sir Sam Edwards, Pierre-Gilles \t\t\t\t\t\t\t\t\tde Gennes, and Jacques des Cloizeaux in the 60’s. Beginning with a somewhat historical discussion tracing these early developments, I \t\t\t\t\t\t\t\t\twill sketch some key elements that have catalyzed my own polymer physics research before focusing polymer gels and the seminal theory \t\t\t\t\t\t\t\t\tof Eleni Panagiotou on polymer entanglement in periodic boundary system models of polymer gels. I will then trace how her dissertation \t\t\t\t\t\t\t\t\tlead to a fruitful collaboration with me and others some whose results will be described next. These concern, time permitting, ideal \t\t\t\t\t\t\t\t\tsystems, polyethylene gels, one-dimensional systems, the determination of entanglement length, linking matrices associated to gels, and \t\t\t\t\t\t\t\t\tthe relationship between entanglement and viscoelasticity. \t\t\t\t\t\t\t\t</p>","warning":"Unexpectedly, the chirping of birds is heard during the final questions.","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"31":{"speaker_id":31,"date":{"seconds":1589864400,"nanoseconds":0},"video":"https://www.youtube.com/embed/91e2kQA5GW4","title":"Computational homology in statistical genetics: applications to cancer genomic data.","keywords":["breast cancer genomics","statistical genetics","topological data analysis (TDA)","copy number changes","computational homology"],"abstract":"<p align=\"justify\">Genomic technologies have revolutionized the field of genetics. In particular, the identification of genetic elements has greatly \t\t\t\t\t\t\t\t\tbenefited from statistical genetics tools that, through association studies, test thousands of genetic elements for a given phenotype. \t\t\t\t\t\t\t\t</p> \t\t\t\t\t\t\t\t<p align=\"justify\"> \t\t\t\t\t\t\t\t\tIn this talk I will present a methodology that combines topological data analysis with statistical genetics to identify genetic signatures \t\t\t\t\t\t\t\t\t(in the form of copy number aberrations) in breast cancer. The proposed topological encoding of these chromosome aberrations allows to: (1) \t\t\t\t\t\t\t\t\tmap chromosome aberrations across the cancer genome using the zero homology group (2) build predictive models using machine learning techniques \t\t\t\t\t\t\t\t\t(3) identify some co-amplifications of the genome using the first homology group (4) identify cancer driving genes when incorporating a fiber \t\t\t\t\t\t\t\t\tbundle-like structure to the data. \t\t\t\t\t\t\t\t</p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"32":{"speaker_id":32,"date":{"seconds":1593061200,"nanoseconds":0},"video":"https://www.youtube.com/embed/WWwMf8Nd494","title":"Backbone Free Energy Estimator, a New Geometric Tool in Structural Biology.","keywords":["proteins","free energy","geometry","viral glycoproteins","capsids","biology"],"abstract":"p align=\"justify\">Hydrogen bonds stabilize the crystal structures of most proteins. In the aqueous environment, they lie at the edge of \t\t\t\t\t\t\t\t\tstability and hence are easily formed and broken, especially those with high free energy. </p> \t\t\t\t\t\t\t\t<p align=\"justify\"> Using a Boltzmann-like formalism, empirical sampling of their geometry leads to free energy estimates, thus allowing a priori predictions \t\t\t\t\t\t\t\t\tof protein regions primed for structural rearrangement. One among diverse applications involves viral glycoproteins and capsids, namely \t\t\t\t\t\t\t\t\tthose proteins employed by viruses to fuse with or penetrate the host cell. Here the methods are used to identify sites of interest \t\t\t\t\t\t\t\t\tfor vaccine/drug/testing development, in particular for the SARS CoV-2 virus that causes COVID-19. \t\t\t\t\t\t\t\t</p>","season":"SPRING 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"33":{"speaker_id":33,"date":{"seconds":1597986000,"nanoseconds":0},"video":"https://www.youtube.com/embed/UBts4ZuU2yU","title":"A CW-complex of Monotone Polyhedral Paths: Geometric/topological meditations about the performance of the Simplex Method.","keywords":["polyhedral graphs","convex geometry","convex polytopes","CW- complexes","Simplex Method","monotone paths on polytopes","directed graphs","analysis of algorithms"],"abstract":"<p align=\"justify\">George Dantzig’s Simplex method is a work horse of modern computational mathematics. Because linear programs (LPs) appear in all areas of application the \t\t\t\t\t\t\t\t\tSimplex methods was elected as one of the top 10 algorithms in the 20th century. Surprisingly, despite its popularity and almost 80 years of research we still do not \t\t\t\t\t\t\t\t\tfully understand its complexity and behavior. </p> \t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t<p align=\"justify\">To bound the number of iterations of the Simplex method we take a geometric point of view and investigate the possible \t\t\t\t\t\t\t\t\tlengths of monotone paths inside the oriented graphs of polyhedra (oriented by the objective function). We are interested in both the shortest and the longest monotone \t\t\t\t\t\t\t\t\tpaths possible and estimate the (monotone) diameter and the height of some famous combinatorial polyhedra (such as TSP, fractional matching polytopes, and others). But \t\t\t\t\t\t\t\t\thow far apart are two monotone paths of an LP? E.g., if I use two pivot rules the Simplex method traces two paths, is there a notion of distance between them?. As we \t\t\t\t\t\t\t\t\tlook at all monotone paths together we see a metric space structure which can be used to count how many are there or to generate them randomly. This comes from a very \t\t\t\t\t\t\t\t\tnatural graph (the flip-path graph) and CW complex structures (cellular-strings complex) on the set of monotone paths These objects are important in topological \t\t\t\t\t\t\t\t\tcombinatorics (Baues complexes and polyhedral subdivisions studied by Billera, Sturmfels, Gelfand, Kapranov, Zelevinsky and others in the early 1990’s) and in discrete \t\t\t\t\t\t\t\t\toptimization (In particular the complexity of the simplex method with work going back to Klee). In my talk I will discuss some natural counting problems associated with \t\t\t\t\t\t\t\t\tthe discrete geometric situation. Our main enumerative results include bounds on the number of monotone paths, and on the the diameter of the space of monotone paths \t\t\t\t\t\t\t\t\t(how far are two monotone paths from each other?). The picture is fairly complete in dimension three, but plenty of open problems remain for high dimensional polytopes. \t\t\t\t\t\t\t\t</p> \t\t\t\t\t\t\t\t<p align=\"justify\">The new theorems presented in my talk come from three recent papers (in Arxiv), the first joint work with Moise Blanchard (MIT) and Quentin Louveaux (U. Liege) \t\t\t\t\t\t\t\t\tthe second joint work with Christos Athanasiadis (U. Athens) and Zhenyang Zhang (UC Davis), the third with Sean Kafer (U. Waterloo) and Laura Sanita (Eidhoven U).</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"34":{"speaker_id":34,"date":{"seconds":1599195600,"nanoseconds":0},"video":"https://www.youtube.com/embed/o4CK1MZ8984","title":"Homological Percolation and Persistence.","keywords":["percolation","persistent homology","stability","topological data analysis (TDA)"],"abstract":"<p align=\"justify\">One of the key goals in topological data analysis is find or infer the global structure of a sampled space by correctly determining the homology groups. Given a sample (data) embedded in Euclidean space (or some \t\t\t\t\t\t\t\t\tmore general space), the general pipeline is to build a distance based filtration and compute the corresponding persistence diagram. The standard way of proving results about the result is via the bottleneck stability of \t\t\t\t\t\t\t\t\tpersistence diagrams. However, it turns out that in many cases this provides a highly pessimistic approximation result. In this talk, I will present recent results which show that the structure of an underlying space appears \t\t\t\t\t\t\t\t\tmuch earlier than expected and is remarkably stable. I will describe how these results fit into our understanding of the stability of persistence and show how the persistent approach can be useful in new ways. The talk will \t\t\t\t\t\t\t\t\tassume some passing familiarity with persistent homology and TDA but will not assume any previous knowledge about percolation. \t\t\t\t\t\t\t\t</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"35":{"speaker_id":35,"date":{"seconds":1600405200,"nanoseconds":0},"video":"https://www.youtube.com/embed/nyO4KQTmwzU","title":"The Truncated Interleaving Distance for Reeb Graphs","keywords":["reeb graph","interleaving"],"abstract":"<p align=\"justify\">Reeb graphs and main other related graphical signatures have extensive use in applications, but only recently has there been intense interest in finding metrics for these objects. In this talk, we introduce \t\t\t\t\t\t\t\t\tan extension of smoothing on Reeb graphs, which we call truncated smoothing; this in turn allows us to define a new family of metrics which generalize the interleaving distance for Reeb graphs. Intuitively, we \t\t\t\t\t\t\t\t\t``chop off'' parts near local minima and maxima during the course of smoothing. After formalizing truncation as a functor, we show that when applied after the smoothing functor, this prevents extensive expansion of the \t\t\t\t\t\t\t\t\trange of the function, and yields particularly nice properties (such as maintaining connectivity) when combined with smoothing. Further, for certain choices of the truncation parameter, we have additional structure which \t\t\t\t\t\t\t\t\twe can take advantage of to construct a categorical flow for any choice of slope <i>m</i> in <i>[0,1]</i>. Using the infrastructure built for a category with a flow, this then gives an interleaving distance for every <i>m</i> in <i>[0,1]</i>, \t\t\t\t\t\t\t\t\twhich is a generalization of the original interleaving distance, which is the case <i>m=0</i>. While the resulting metrics are not stable, we show that any pair of these for <i>m,m'</i> in <i>[0,1)</i> are strongly equivalent metrics, \t\t\t\t\t\t\t\t\twhich in turn gives stability of each metric up to a multiplicative constant. This talk is on joint work with Erin Chambers and Tim Ophelders. \t\t\t\t\t\t\t\t</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"36":{"speaker_id":36,"date":{"seconds":1601614800,"nanoseconds":0},"video":"https://www.youtube.com/embed/fZkMwgKswEg","title":"Magnetic helicity: decompositions and methods of localization.","keywords":["helicity","wavelets","poloidal-toroidal decomposition"],"abstract":"<p align=\"justify\"> Magnetic helicity is an ideal MHD invariant; it measures geometric and topological properties of a magnetic field. The talk will begin by \t\t\t\t\t\t\t\treviewing helicity and its mathematical properties. It can be decomposed in several ways (for example, self and mutual helicity, Fourier spectra, field \t\t\t\t\t\t\t\tline helicity, linking, twist, and writhe). The talk will also review methods of measuring helicity flux, as well as applications in solar and stellar \t\t\t\t\t\t\t\tastrophysics. \t\t\t\t\t\t\t\t</p> \t\t\t\t\t\t\t\t<p align=\"justify\">The poloidal-toroidal decomposition of a vector field will be discussed, with a generalization to arbitrary simply connected compact surfaces. \t\t\t\t\t\t\t\t\tI will then discuss some new developments in measuring localized concentrations of helicity in a well-defined, gauge invariant manner, using wavelets. \t\t\t\t\t\t\t\t</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"37":{"speaker_id":37,"date":{"seconds":1602824400,"nanoseconds":0},"video":"https://www.youtube.com/embed/mLUozD6-Db4","title":"COVID-19, Viruses, Recombination and Topology","keywords":["COVID-19","viruses","recombination","topological data analysis (TDA)"],"abstract":"<p align=\"justify\"> COVID-19 is a disease caused by a coronavirus named SARS-CoV-2. As the virus has been spreading around the world, hundred of thousands of viral genomes have been sequenced. Genomes provide an accurate record of variation and \t\t\t\t\t\t\t\t\tevolution and can inform how these viruses emerge and evolve. In this talk I will discuss how mutations and recombinations shape SARS-CoV-2 evolution, and how topological data analysis techniques can help to understand the role of these \t\t\t\t\t\t\t\t\tprocesses in the emergence of this and other potential future viruses. \t\t\t\t\t\t\t\t</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"38":{"speaker_id":38,"date":{"seconds":1604642400,"nanoseconds":0},"video":"https://www.youtube.com/embed/qaU4P5AJkH0","title":"Detecting geodesic circles with selective Rips complexes.","keywords":["persistent homology","selective Rips complex","geodesic space","closed geodesic"],"abstract":"<p align=\"justify\"> Persistent homology is a well known invariant encoding geometric properties of an underlying metric space. While the nature of this \t\t\t\t\t\t\t\t\tencoding and precise geometric information it contains are not well understood, it is known that geodesic circles (a special class of closed \t\t\t\t\t\t\t\t\tgeodesics in a geodesic space) can sometimes be detected with one- or higher-dimensional persistent homology. </p> \t\t\t\t\t\t\t\t<p align=\"justify\">In this talk we will consider a converse task: we want to use persistent homology to detect as many geodesic circles in a space as possible. \t\t\t\t\t\t\t\t\tTo that end we introduce a new construction of complexes called selective Rips complexes. They can be thought of as custom made complexes designed to \t\t\t\t\t\t\t\t\tdetect geodesic circles. It turns out that employing selective Rips complexes we can detect and locate a fairly large class of geodesic circles using \t\t\t\t\t\t\t\t\tone- and two-dimensional persistent homology.</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"39":{"speaker_id":39,"date":{"seconds":1605852000,"nanoseconds":0},"video":"https://www.youtube.com/embed/lpgcG4ZdmNc","title":"A landscape of knots: TDA and dimension reduction techniques in theoretical mathematics.","keywords":["knot theory","knot invariants","manifold learning","dimension reduction","topological data analysis (TDA)"],"abstract":"<p align=\"justify\"> A multitude of knot invariants, including quantum invariants and their categorifications, have been introduced to aid with \t\t\t\t\t\t\t\t\tcharacterizing and classifying knots and their topological properties. Relations between knot invariants and their relative strengths at \t\t\t\t\t\t\t\t\tdistinguishing knots are still mostly elusive. In addition to Ball Mapper, and machine learning techniques, we develop a new approach using \t\t\t\t\t\t\t\t\tfiltrations to analyze infinite data sets where representative sampling is impossible or impractical, an essential requirement for working \t\t\t\t\t\t\t\t\twith knots and the data from knot invariants. Although of different origins, these methods confirm and illuminate similar substructures in \t\t\t\t\t\t\t\t\tknot data created for 10 million knots up to 17 crossings.</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"40":{"speaker_id":40,"date":{"seconds":1607061600,"nanoseconds":0},"video":"https://www.youtube.com/embed/7cGPeMBWEwc","title":"Characterizing rare events in persistent homology.","keywords":["persistent homology","random topology","large deviation","representation theory"],"abstract":"<p align=\"justify\"> Indecomposables obtained through decompositions of persistent homology are regarded as topological summary of \t\t\t\t\t\t\t\t\treal data. However, as is well known, there exist pathologically complicated indecomposables in multi-parameter persistent \t\t\t\t\t\t\t\t\thomology in purely algebraic setting, and this fact makes it difficult to build mathematical theory on that setting. Our \t\t\t\t\t\t\t\t\tfundamental question is, how much should we care about such complicated indecomposables in the real data, and what is a suitable \t\t\t\t\t\t\t\t\tframework to study this question? To this aim, we will show several ongoing results, especially, (1) large deviation principle \t\t\t\t\t\t\t\t\ton 1 parameter persistent homology, and (2) law of large numbers on multi-parameter persistent homology. Then we will discuss how \t\t\t\t\t\t\t\t\tthese two results (partially) answer to the original question.</p>","season":"FALL 2020","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"41":{"speaker_id":41,"date":{"seconds":1611295200,"nanoseconds":0},"video":"https://www.youtube.com/embed/E7J9IWqhwN4","title":"Low-dimensional topology and non-Euclidean geometry in nature.","keywords":["statistical topology","low-dimensional topology","unknotted long polymer chain","DNA folding","non-Euclidean geometry"],"slides":"https://drive.google.com/file/d/1hBawfHTZBp8uuP1GIFn9naj7MowuFKzV/view","abstract":"<p>In the talk I demonstrate on specific examples the emergence of a new actively developing field, the \"statistical topology\", which unifies topology, noncommutative geometry, probability theory and random walks. In particular, I plan to discuss the following interlinked questions: (i) statistics of random walks on hyperbolic manifolds and graphs in connection with the topology and fractal structure of unknotted long polymer chain confined in a bounding box and hierarchical DNA folding, and (ii) optimal embedding in the three-dimensional space of exponentially growing tissues, like, for example, the salad leaf, and how the hierarchical ultrametric geometry emerges in that case.</p>","season":"SPRING 2021","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"42":{"speaker_id":42,"date":{"seconds":1612504800,"nanoseconds":0},"video":"https://www.youtube.com/embed/ntwjBdEC_B4","title":"Predicting emergent sequences of neural networks via directional graphs","keywords":["Neuroscience","topological data analysis (TDA)","graph signal processing"],"abstract":"<p>Sequences of neural activity arise in many brain areas, including cortex, hippocampus,and central pattern generator circuits that underlie rhythmic behaviors like locomotion. A fundamental question is to understand how the network’s connectivity shapes neuronal activity. Surprisingly, there is a correspondence between unstable fixed points and dynamic attractors. In this talk we will look into different network architectures and the fixed points they produce by decomposing the networks into “directional” components. This is joint work with C.Curto, F.Burtscher , S. Ebli, D.Egas, K.Morrison, N.Sanderson and Y.Zhou.</p>","warning":"Some noises in the video.","season":"SPRING 2021","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"43":{"speaker_id":43,"date":{"seconds":1613714400,"nanoseconds":0},"video":"https://www.youtube.com/embed/mlQRgR7V898","title":"The magnitude of point-cloud data","keywords":["magnitude","point-cloud data","stability","persistent homology"],"abstract":"<p>Magnitude is an isometric invariant of metric spaces that was introduced by Tom Leinster in 2010, and is currently the object of intense research, since it has been shown to encode many invariants of a metric space such as volume, dimension, and capacity.</p> <p>Magnitude homology is a homology theory for metric spaces that has been introduced by Hepworth-Willerton and Leinster-Shulman, and categorifies magnitude in a similar way as the singular homology of a topological space categorifies its Euler characteristic. </p> <p>In this talk I will first introduce magnitude and magnitude homology. I will then give an overview of existing results and current research in this area, explain how magnitude homology is related to persistent homology, and finally discuss new stability results for magnitude and how it can be used to study point-cloud data. </p> <p>This talk is based on joint work in progress with Miguel O'Malley and Sara Kalisnik, as well as the <a href = https://arxiv.org/abs/1807.01540>preprint</a>.</p>","season":"SPRING 2021","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"44":{"speaker_id":44,"date":{"seconds":1614924000,"nanoseconds":0},"video":"https://www.youtube.com/embed/rDNUX9QGTyc","title":"Topologically Active Polymers and DNA","keywords":["DNA topology","Microrheology","Soft Matter","Living Polymers"],"abstract":"<p>Polymer physics principles heavily rely on the assumption that polymers do not change topology (or architecture) in time. This is not the case for DNA, which is constantly topologically re-arranged within the cell nucleus. Inspired by this, I propose to study entangled systems of polymers which can selectively alter their topology and architecture in time and may expend energy to do so. I argue that solutions of these 'topologically active (living) polymers' can display unconventional viscoelastic behaviours and can be conveniently realised using solutions of DNA functionalised by certain families of proteins. </p> <p>In this talk I will present my first excursion into this field and present some recent results on the microrheology of entangled Lambda DNA undergoing digestion by restriction enzymes. Finally, I will discuss some wild conjectures and speculations about possible future directions.</p>","season":"SPRING 2021","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0},"45":{"speaker_id":45,"date":{"seconds":1616133600,"nanoseconds":0},"video":"https://www.youtube.com/embed/RpQ2uW98tjo","title":"Pseudo-Seifert surfaces and vortex reconnections in quantum fluids","keywords":["quantum vortices","nodal lines","Schrödinger equation","Gross-Pitaievskii equation","approximation theorems"],"abstract":"<p>The quantum vortices of a superfluid are described as nodal lines of a solution to the time-dependent Gross-Pitaevskii equation. Experiments in Lab and extensive numerical computations show that quantum vortices cross, each of them breaking into two parts and exchanging part of itself for part of the other. This phenomenon, known as quantum vortex reconnection, occurs even though the superfluid does not lose its smoothness. This usually leads to a change of topology of the quantum vortices. In this talk I will show that, given any initial and final congurations of quantum vortices (i.e. closed curves, possibly knotted and linked), and any way of transforming one into the other through a generic pseudo-Seifert surface embedded in spacetime, there is an initial condition whose associatedsolution realizes this specific vortex reconnection scenario. This allows us to track the vortex reconnection process at all times, both locally and globally. Key to prove this result is a new Runge-type approximation theorem for the linear Schrodinger equation.</p> <p>This is based on joint work with Alberto Enciso.</p>","warning":"In some moments of the talk, the sound is not clear.","season":"SPRING 2021","numberViewsYoutube":0,"numberLikesYoutube":0,"numberDislikesYoutube":0}}