{
    "145": {
        "speaker_id": 127,
        "date": "February 16, 2024",
        "date2": "20240216",
        "title": "From Descriptive to Operational Topological Data Analysis",
        "keywords": [
            "Operational Topological Data Analysis",
            "optimization",
            "algorithms"
        ],
        "abstract": "Topological data analysis evolved over the past two decades into a primarily descriptive field. Almost all applications aim to quantify the topology of data and use the resulting descriptors to build a model for classification or regression. Recently, a new line of applications emerged, one that uses topology to guide optimization and thus modify the data or the model directly. After reviewing the descriptive view of TDA, we will discuss the structure of the optimization problem and demonstrate how understanding it leads to better optimization algorithms.",
        "season": "SPRING 2024",
        "video": null
    },
    "144": {
        "speaker_id": 126,
        "date": "February 9, 2024",
        "date2": "20240209",
        "title": "Tropical Geometry of Phylogenetic Tree Space",
        "keywords": [
            "BHV Tree space",
            "Generalized Hilbert projective metric",
            "Phylogenetic trees",
            "Tropical geometry",
            "Tropical Grassmannian"
        ],
        "abstract": "BHV space is a well-studied moduli space of phylogenetic trees that appears in many scientific disciplines, including computational biology, computer vision, combinatorics, and category theory. Speyer and Sturmfels identify a homeomorphism between BHV space and a version of the Grassmannian using tropical geometry, endowing the space of phylogenetic trees with a tropical structure, which turns out to be advantageous for computational studies. In this talk, I will present the coincidence between BHV space and the tropical Grassmannian. I will then give an overview of some recent work I have done that studies the tropical Grassmannian as a metric space and the practical implications of these results on probabilistic and statistical studies on sets of phylogenetic trees.",
        "season": "SPRING 2024",
        "video": null
    },
    "143": {
        "speaker_id": 125,
        "date": "December 15, 2023",
        "date2": "20231215",
        "title": "The geometry and mechanics of chirality: from Maxwell's perversion to Feynman's obsession",
        "keywords": [
            "symmetry",
            "chirality",
            "curves and knots",
            "mechanics"
        ],
        "abstract": "Many natural structures such as proteins, climbing vines, and seashells exhibit a well defined chirality, some are left-handed, some are right-handed, some are both. The ultimate origin of chirality is one of Nature's great mystery. However, geometry and mechanics play a fundamental role in assigning chirality and carrying this information from microscopic to macroscopic scales. In this talk, I will discuss the general problem of chirality, chirality measure, and chirality transfer, trace its history, and use examples from chemistry and biology to obtain general principles with some surprising twists.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/mnSEwew1UvA?si=TsE2LmTaDNu-BWnW"
    },
    "142": {
        "speaker_id": 124,
        "date": "December 1, 2023",
        "date2": "20231201",
        "title": "Data, geometry, and homology",
        "keywords": [
            "topological data analysis",
            "geometrical representations of data",
            "homology",
            "stable ranks"
        ],
        "abstract": "For a successful analysis a suitable representation of data by objects amenable for statistical methods is fundamental. There has been an explosion of applications in which homological representations of data played a significant role. I will present one such representation called stable rank and introduce various novel ways of using it to encode geometry, and then analyse, data. I will provide several illustrative examples of how to use stable ranks to find meaningful results. ",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/zgO1mmT8V1I?si=vjwgWcwhaYsZbqz6"
    },
    "141": {
        "speaker_id": 102,
        "date": "November 17, 2023",
        "date2": "20231117",
        "title": "Geometric Approaches to Frame Theory",
        "keywords": [
            "frame theory",
            "symplectic geometry",
            "signal processing",
            "geometric invariant theory"
        ],
        "abstract": "Frames are overcomplete systems of vectors in Hilbert spaces. They were originally introduced in the 1950s in the context of non-harmonic Fourier series, and came to renewed prominence in the 1980s in signal processing applications. More recently, there has been burgeoning interest in frames in finite-dimensional Hilbert spaces, with applications to signal processing, quantum information, and compressed sensing. </br></br>In this talk, I will describe some ways in which tools from differential, Riemannian, and symplectic geometry can be applied to problems in frame theory. Some key tools that crop up are Hamiltonian actions, the Cartan decomposition, and geometric invariant theory. This is joint work with Tom Needham and partially with Dustin Mixon and Soledad Villar.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/tuFUxcJU2A8?si=Vpx8DcPzsHU4of9f"
    },
    "140": {
        "speaker_id": 123,
        "date": "November 3, 2023",
        "date2": "20231103",
        "title": "Entanglement and invariants of theta-curves",
        "keywords": [
            "knot",
            "spatial graph",
            "theta-curve",
            "unknotting number"
        ],
        "abstract": "A theta-curve is a spatial embedding of the unique graph with two vertices joined by three parallel edges. Like knots and links, theta-curves and their mathematical properties are relevant to the mathematical modeling of biopolymers. In this talk, we will investigate unknotting operations and define new invariants of theta-curves. We will also generalize the statement that 'unknotting number one knots are prime' to theta-curves. This is joint work with several sets of authors.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/PLTpt9NGNT4?si=l5O6_mTC1S_FGmpQ"
    },
    "139": {
        "speaker_id": 122,
        "date": "October 20, 2023",
        "date2": "20231020",
        "title": "Simplicial Methods in Distributed Computing",
        "keywords": [
            "distributed computing",
            "simplicial methods",
            "standard distributed tasks",
            "complexity",
            "Weak Symmetry Breaking distributed task"
        ],
        "abstract": "We will give a brief introduction to the subject. The survey of main ideas and tools will be complemented with applications to specific standard distributed tasks. We will conclude with stating an open problem in combinatorial topology which is related to the complexity of the Weak Symmetry Breaking distributed task.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/rkvWtDzfr_M?si=OSxp2-FNulE8N8KG"
    },
    "138": {
        "speaker_id": 121,
        "date": "October 13, 2023",
        "date2": "20231013",
        "title": "The Fermat principle in Riemannian geometry",
        "keywords": [
            "topological data analysis",
            "persistent homology",
            "manifold learning",
            "distance learning",
            "time series"
        ],
        "abstract": "In many situations in physics, the path of light is determined not only by spatial geometry but also by an underlying local density (e.g., mass concentration in general relativity, refractive index in optics). Consider a scenario where a Riemannian manifold in Euclidean space is shaped by a density function, with only a finite sample of points available. How can we infer the original metric and determine the manifold's topology? This talk introduces a density-based method for estimating topological features from data in high-dimensional Euclidean spaces, assuming a manifold structure. The key to our approach lies in the Fermat distance, a sample metric that robustly infers the deformed Riemannian metric. Theoretical convergence results and implications in the homology inference of the manifold will be presented. Additionally, I will show practical applications in time series analysis with examples from real-world data. This talk is based on the article: X. Fernandez, E. Borghini, G. Mindlin, and P. Groisman. \"Intrinsic Persistent Homology via Density-Based Metric Learning.\" Journal of Machine Learning Research 24 (2023) 1-42.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/SxYSzAywDus?si=5qPy93w_X3HCQJrl"
    },
    "137": {
        "speaker_id": 120,
        "date": "October 6, 2023",
        "date2": "20231006",
        "title": "Geometrical singularities and free surface cusps",
        "keywords": [
            "cusp shapes",
            "viscous fluid",
            "surface tension",
            "global flow"
        ],
        "abstract": "Cusp shapes are widely observed in nature, most famously as the bright caustic lines on the inside of a coffee cup. This can be understood from the fact that a cusp arises from the smooth deformation of a parameterized curve. Remarkably, the same generic cusp can be formed on the surface of a viscous fluid with surface tension, as demonstrated by Jeong and Moffatt [J. Fluid Mech. 241, 1, (1992)], using complex mapping techniques. However, their observation is limited to very specific and idealized geometries. Here we demonstrate that cusps are indeed local solutions to the Stokes equation with surface tension, regardless of the global flow.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/xveoauQx7o4?si=7qXBxvP6CXw-rJez",
        "streaming_time": 9
    },
    "136": {
        "speaker_id": 119,
        "date": "September 22, 2023",
        "date2": "20230922",
        "title": "Modelling knotted proteins with tangles",
        "keywords": [
            "knots",
            "tangle model",
            "proteins"
        ],
        "abstract": "We prove using the mathematics of tangles that if a protein terminus passing through a single loop results in a locally knotted protein, then Taylor's twisted hairpin model is the most likely method for creating such knots. In this case the knotted products will all be twist knots. If we assume a right-handed chirality bias, which is common in proteins, then  the majority of these twist knots will be  right-handed trefoils ($+3_1$), followed by left-handed trefoils ($-3_1$), achiral figure eight knots ($4_1$) and right-handed five crossing twist knots ($-5_2$). An alternative pathway has been observed computationally where a terminus passes through two loops.  We use 3-string tangle analysis to model this pathway.  This is joint work with Garrett Jones and Puttipong Pongtanapaisan.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/pdtm3Kd2kYc?si=Zat7e5PM61QRUCmu",
        "slides": "https://drive.google.com/file/d/1OZ-dtxXVPvy6FYEyetlRxB19GUz_oxh8/view?usp=sharing"
    },
    "135": {
        "speaker_id": 118,
        "date": "September 8, 2023",
        "date2": "20230908",
        "title": "Singularity-free motion planning for redundant parallel manipulators",
        "keywords": [
            "motion planning",
            "topological complexity",
            "complexity of a kinematic map",
            "parallel mechanisms",
            "singularity-free"
        ],
        "abstract": "Some twenty years ago Michael Farber defined the topological complexity of robot motion planning as a measure of the difficulty to construct predictable motion plans for mechanical devices (like robots) that are allowed to move in a given work space. More recently, we defined the complexity of a kinematic map that takes into account the kinematic relation between the internal states of a serial mechanism and its spatial poses. In our talk we will discuss a more general motion planning for parallel mechanisms. In particular, we will consider mechanisms that are redundant in the sense that the dimension of their joint space is strictly bigger than the dimension of their work space. The additional degrees of freedom allow motion paths that avoid critical configurations of joints, and we will discuss how difficult it is to construct predictable singularity-free motion plans that perform a given set of tasks. This is joint work with Edward Haug and Adrian Peidro.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/CVrgrku4yUI?si=ygwS8QUM_6pm0iP7"
    },
    "134": {
        "speaker_id": 117,
        "date": "September 1, 2023",
        "date2": "20230901",
        "title": "Differential Calculus for Modules over Posets",
        "keywords": [
            "persistence modules",
            "discrete calculus on graphs",
            "spectral graph theory"
        ],
        "abstract": "The concept of a persistence module was introduced in the context of topological data analysis. In its original incarnation a persistence module is defined to be a functor from the poset of nonnegative real numbers with theory natural order to the category of vector spaces and homomorphisms. These are referred to as single parameter persistence modules and are a fundamental and useful concept in topological data analysis when the source data depends on a single parameter. The concept naturally lends itself to generalisation, and one may consider persistence modules as functors from an arbitrary poset (or more generally an arbitrary small category) to some abelian target category. In other words, a persistence module is simply a representation of the source category in the target abelian category. As such much research was dedicated to studying persistence modules in this context. Unsurprisingly, it turns out that when the source category is more general than a linear order, then its representation type is generally wild. In particular, keeping in mind that persistence module theory is supposed to be applicable, computability of general persistence modules is very limited. In this talk I will describe the background and motivation for persistence module theory and introduce a new set of ideas for local analysis of persistence module by methods borrowed from spectral graph theory and multivariable calculus.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/VVjdLzYby0U?si=W6uJgwC2ipc4CbnL"
    },
    "133": {
        "speaker_id": 116,
        "date": "August 18, 2023",
        "date2": "20230818",
        "title": "Coupling Time-Aware Multipersistence Knowledge Representation with Graph Convolutional Networks for Time Series Forecasting",
        "keywords": [
            "Graph Neural Networks",
            "multipersistence",
            "Euler-Poincaré surface",
            "forecasting"
        ],
        "abstract": "Graph Neural Networks (GNNs) are proven to be a powerful machinery for learning  complex dependencies in multivariate spatio-temporal processes. However, most existing GNNs have inherently static architectures, and as a result, do not explicitly account for time dependencies of the encoded knowledge and are limited in their ability to simultaneously infer latent time-conditioned relations among entities. We postulate that such hidden time-conditioned properties may be captured by the tools of multipersistence, i.e., an emerging machinery in topological data analysis which allows us to quantify dynamics of the data shape along multiple geometric dimensions. We propose to summarize inherent time-conditioned topological properties of the data as time-aware multipersistence Euler-Poincaré surface and prove its stability. We then construct a supragraph convolution module which simultaneously accounts for the extracted intra- and inter-dependencies in the data.  We illustrate the utility of the proposed approach in application to forecasting highway traffic flow, blockchain Ethereum token prices, and COVID-19 hospitalizations.",
        "season": "FALL 2023",
        "video": "https://www.youtube.com/embed/t-xYOeCot9s?si=F-hsAqzgg6B0bk0a&amp;controls=0"
    },
    "132": {
        "speaker_id": 115,
        "date": "June 2, 2023",
        "date2": "20230602",
        "title": "Metric geometry of spaces of persistence diagrams",
        "keywords": [
            "persistence diagram",
            "Wasserstein distance",
            "Alexandrov space",
            "metric pair",
            "bottleneck distance"
        ],
        "abstract": "Persistence diagrams are central objects in topological data analysis. They are pictorial representations of persistence homology modules and describe topological features of a data set at different scales. In this talk, I will discuss the geometry of spaces of persistence diagrams and connections with the theory of Alexandrov spaces, which are metric generalizations of complete Riemannian manifolds with sectional curvature bounded below. In particular, I will discuss how one can assign to a metric pair $(X,A)$ a one-parameter family of pointed metric spaces of (generalized) persistence diagrams $D_p(X,A)$ with points in $(X,A)$ via a family of functors $D_p$ with $p\\in [1,\\infty]$. These spaces are equipped with the p-Wasserstein distance when $p\\geq 1$ and the bottleneck distance when $p=\\infty$. The functors $D_p$ preserve natural metric properties of the space $X$, including non-negative curvature in the triangle comparison sense when $p=2$. When $p=\\infty$, the functor $D_\\infty$ is sequentially continuous with respect to a suitable notion of Gromov–Hausdorff convergence of metric pairs. When $(X,A) = (\\mathbb{R}^2,\\Delta)$, where $\\Delta$ is the diagonal of $\\mathbb{R}^2$, one recovers previously known properties of the usual spaces of persistence diagrams. This is joint work with Mauricio Che, Luis Guijarro, Ingrid Membrillo Solis, and Motiejus Valiunas. </br></br><a href=\"https://arxiv.org/abs/2109.14697\">https://arxiv.org/abs/2109.14697</a></br><a href=\"https://arxiv.org/abs/2205.09718\">https://arxiv.org/abs/2205.09718</a>",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/qobrDyof2Rg"
    },
    "131": {
        "speaker_id": 114,
        "date": "May 19, 2023",
        "date2": "20230519",
        "title": "Optimal partitions for the Yamabe equation",
        "keywords": [
            "Yamabe equation",
            "optimal l-partition",
            "generalized metric",
            "physics"
        ],
        "abstract": "The Yamabe equation on a Riemannian manifold $(M, g)$ is of relevance in differential geometry. A positive solution to it gives rise to a metric on $M$ which has constant scalar curvature and is conformally equivalent to the given metric $g$. </br>An optimal $l$-partition for the Yamabe equation is a cover of $M$ by $l$ pairwise disjoint open subsets such that the Yamabe equation with Dirichlet boundary condition has a least energy solution on each one of these sets, and the sum of the energies of these solutions is minimal. Such a partition induces a <i>generalized metric</i> that vanishes on a set of measure zero and is conformally equivalent to $g$ in the complement. </br>I will present some results obtained in collaboration with Angela Pistoia (La Sapienza Universit`a di Roma) and Hugo Tavares (Universidade de Lisboa) that ensure the existence and establish qualitative properties of this type of partitions. To do this, we use some ideas from physics.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/g9Tiv2C6TNQ"
    },
    "130": {
        "speaker_id": 89,
        "date": "June 16, 2023",
        "date2": "20230616",
        "title": "Magnetohydrodynamic relaxation, helicity and minimum energy states in magnetised plasmas",
        "keywords": [
            "magnetic fields",
            "relaxation",
            "helicity",
            "energy",
            "topology of magnetic fields"
        ],
        "abstract": "During the turbulent relaxation of a plasma with a high magnetic Reynolds number, the magnetic energy is typically dissipated faster than the magnetic helicity. Hence one can attempt to describe the result of such a relaxation as a state that minimises the energy while preserving the magnetic helicity. Mathematically the relation between magnetic helicity and energy is defined by an inequality, $|H(B)| \\le (2/C) E(B)$, a result that was first shown in a classical paper by V.I. Arnold (1974) for simply connected domains. The formula shows how a non-trivial magnetic field topology (a non-zero helicity) forms a lower bound for the magnetic energy. The formula contains a constant C, which is the smallest possible eigenvalue of the curl operator in a magnetically closed domain. The corresponding eigenfield is a state of maximum helicity for a given energy. We will discuss under which circumstances these maximum helicity (minimum energy) states can be reached, show how Arnold’s formula can be applied to non-simply connected domains, and how one can modify Arnold’s formula to find lower bounds for the energy even if $H(B)=0$.</br></br>References:</br></br>-Arnold, V.I., The asymptotic Hopf invariant and its application, Sel. Math. Sov., 5, 327 (1986) </br>-Candelaresi, S., Pontin, D. I., Hornig, G., & Podger, B. Topological Constraints in the reconnection of vortex braids, Physics of Fluids, (33), 056101 (2021) </br>-Yeates, A.R., Hornig, G. and Wilmot-Smith, A.L. Topological Constraints on Magnetic Relaxation, Phys. Rev. Lett., 105, 085002 (2010)",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/qvYwpHAckUI"
    },
    "129": {
        "speaker_id": 92,
        "date": "April 28, 2023",
        "date2": "20230428",
        "title": "Role of topology in study of cascade evolutions of physical knot/link complex systems",
        "keywords": [
            "topological fluid mechanics",
            "cascade evolution of knot complex systems",
            "topological transitions",
            "topology-energy relationship"
        ],
        "abstract": "Recent laboratory and numerical experiments in classical and quantum fluids[2][8][3] and in recombinant DNA plasmids[9][10] show that physical knots/links are highly unstable, decaying from a high-topological complexity state to a low-complexity state through a series of reconnection events. A possible theoretical picture for this phenomenon is that hierarchy of topological complexity is closely related to spectrum of energy or other dynamical properties. For this study the following progress would be reviewed: (i) ropelengths/crossing numbers of prime knots and links versus the groundstate energy spectrum[7]; (ii) adapted HOMFLYPT polynomial values used to quantify complexity of torus knots and links[4][6][1]; (iii) complexity degree of a knot defined in a Legendre polynomial basis in a suitably defined knot polynomial space[5]. Some relevant undergoing numerical simulation work is introduced as well. Our emphasis will be placed on the role that topologically non-conservative transitions play in the evolution of a knot complex system, in the hope of finding a scalar topological invariant to manage energy or other spectrums.</br></br>This is joint work with Prof. Renzo L. Ricca (U Milano-Biccoca, Italy), Drs. Xinfei Li (Guangxi U Science & Technology, P.R. China) & Simone Zuccher(U Verona, Italy), and Mr. Hao Guan (Beijing U Technology, P.R. China).</br></br>[1] Cooper R.G., Mesgarnezhad M., Baggaley A.W., Barenghi C.F. (2019) Knot spectrum of turbulence. Sci. Rep. 9,10545.</br>[2] Kleckner D., Irvine W.T.M. (2013) Creation and dynamics of knotted vortices. Nat Phys. 9, 253.</br>[3] Kleckner D., Kauffman L.H., Irvine W.T.M. (2016) How superfluid vortex knots untie. Nat Phys. 12, 650–655.</br>[4] Liu X. & Ricca R.L. (2016) Knots cascade detected by a monotonically decreasing sequence of values. Sci. Rep. 6, 24118.</br>[5] Liu X., Ricca R.L. & Li X.-F. (2020) Minimal unlinking pathways as geodesics in knot polynomial space. Communications Phys. 3, 136.</br>[6] Mesgarnezhad M., Cooper R.G., Baggaley A.W., Barenghi C.F. (2018) Helicity and topology of a small region of quantum vorticity. Fluid Dyn. Res. 50, 011403.</br>[7] Ricca R.L., Maggioni F. (2014) On the groundstate energy spectrum of magnetic knots and links. J. Phys. A: Math. & Theor. 47, 205501.</br>[8] Scheeler M.W. et al. (2014) Helicity conservation by flow across scales in reconnecting vortex links and knots. PNAS USA 111,15350.</br>[9] Shimokawa K., et al. (2013) FtsK-dependent XerCD-dif recombination unlinks replication catenanes in a stepwise manner. PNAS USA, 110, 20906–20911.</br>[10] Stolz R. et al. (2017) Pathways of DNA unlinking: A story ofstepwise simplification. Sci. Rep. 7 12420.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/bsahyS5NNhs"
    },
    "128": {
        "speaker_id": 113,
        "date": "April 14, 2023",
        "date2": "20230414",
        "title": "Curvature for Graph Learning",
        "keywords": [
            "curvature",
            "graph learning",
            "filtration",
            "persistent homology",
            "topological machine learning"
        ],
        "abstract": "Curvature bridges geometry and topology, using local information to derive global statements. While well-known in a differential topology context, it was recently extended to the domain of graphs. In fact, graphs give rise to various notions of curvature, which differ in expressive power and purpose. We will give a brief overview of curvature in graphs, define some relevant concepts, and show their utility for data science and machine learning applications. In particular, we shall discuss two applications: first, the use of curvature to *distinguish* between different models for synthesising new graphs from some unknown distribution; second, a novel *framework* for defining curvature for hypergraphs, whose structural properties require a more generic setting. We will also describe new applications that are specifically geared towards a treatment by curvature, thus underlining the utility of this concept for data science.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/yTOQJtgc66E"
    },
    "127": {
        "speaker_id": 101,
        "date": "March 31, 2023",
        "date2": "20230331",
        "title": "Applications of band surgery on knots and links",
        "keywords": [
            "DNA recombination",
            "anti-parallel reconnection",
            "vortex",
            "band surgeries",
            "knots",
            "links"
        ],
        "abstract": "We consider local moves of knots and links, called band surgeries. A band surgery usually changes the topology of knots and links. Signatures, Jones polynomials, and other link invariants can be used to show the absence of band surgery between a given pair of links. A band surgery has been used for establishing mathematical models of DNA recombination and anti-parallel reconnection of vortex knots and links. In this talk, we discuss applications of results of band surgeries to the unlinking of DNA links by site-specific recombination and to the untying of vortex knots by anti-parallel reconnection.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/N9Be_eVl-Iw",
        "streaming_time": 8
    },
    "126": {
        "speaker_id": 112,
        "date": "March 17, 2023",
        "date2": "20230317",
        "title": "Mapping Space Signatures",
        "keywords": [
            "path signature",
            "differential forms",
            "iterated integrals",
            "universal and characteristic features"
        ],
        "abstract": "The path signature is a characterization of paths which has led to the development of rough paths in stochastic analysis, and a powerful set of novel tools for time series data in machine learning. In this talk, we begin with some background on signature methods in machine learning. We introduce the mapping space signature, a generalization of the path signature for maps from higher dimensional cubical domains (such as images or videos), which is motivated by the topological/geometric perspective of iterated integrals of differential forms by K. T. Chen. The mapping space signature shares many of the analytic and algebraic properties of the path signature, in particular it is universal and characteristic. This is joint work with Chad Giusti, Vidit Nanda, and Harald Oberhauser.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/H4cSoSAqn18"
    },
    "125": {
        "speaker_id": 111,
        "date": "March 3, 2023",
        "date2": "20230303",
        "title": "Simplicial complexes and the index lemma: A pathway to reach agreements fairly",
        "keywords": [
            "social choice",
            "combinatorial topology",
            "Arrow's impossibility theorem",
            "index lemma",
            "domain restriction",
            "aggregating preferences"
        ],
        "abstract": "Aggregating individual preferences is a fundamental problem in democracy: How can we take collective decisions fairly based on individual preferences? Arrow's impossibility theorem (1951) proves that it is not possible to do it when we assume some apparently mild conditions. Fortunately, in some cases, aggregation is possible when the domain of individual preferences is restricted. That is, when voters can only report some preferences, good aggregation rules exist. However, no theorem characterizes the domains in which aggregation is possible, and the problem remains open.</br></br>Despite the Arrovian model being purely combinatorial, Baryshnikov (1993) used simplicial complexes and homology to prove Arrow's theorem and exposed a conjecture which characterized restricted domains through homology groups. The main drawback of using homology is that it is not affordable for most of the social scientists. Therefore, instead of homology, we have used combinatorial topology tools such as the Index Lemma (the combinatorial counterpart to Poincare's Lemma) to tackle the problem. First, we have proved the Arrow's impossibility theorem, showing that combinatorial topology is helpful for our purposes.</br></br>Second, we have characterized the domains allowing aggregation rules for the base case of two voters and three candidates. Our characterization proves that homology groups are not enough to characterize such domains. Our result gives us hope to obtain a general characterization of the good domains for aggregating preferences. Moreover, it could be implemented computationally, making it handled by practitioners in politics and economics.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/ksk2B2G-eK0"
    },
    "124": {
        "speaker_id": 110,
        "date": "February 17, 2023",
        "date2": "20230217",
        "title": "Spaces of discrete vector fields and their applications to complex systems dynamics",
        "keywords": [
            "discrete vector fields",
            "metric spaces",
            "complex systems",
            "dynamical systems",
            "soft matter",
            "materials science"
        ],
        "abstract": "A complex system is formed by entities that, through their interactions and dependencies, give rise to a unified whole with properties and behaviour distinct from those of its constituent parts. Examples of complex systems are the human brain, living cells, the Earth's global climate, organisms, smart materials, ecosystems and the economy. Modelling complex systems dynamics is challenging due to the high dimensionality and variety of the non-linear phenomena that these systems exhibit, such as network and pattern formation, evolution, adaptation and self-organisation.</br></br>In this talk, we will present a data-driven approach to studying complex systems using spaces of discrete vector fields. These spaces can be endowed with a family of metrics that allow us to keep track of the dynamics of complex systems.  We will show that this geometric framework can be used for dimensionality reduction, detection of stable and unstable global attractors, and quantification of physical properties. In particular, we will show applications to the analysis of data obtained from simulations and experiments of soft matter materials, and simulations of pattern formation on curved domains. This is part of joint works with M. Van Rossem, T. Orlova, N. Podoliak, T. Madeleine, H. Sohn, I. Smalyukh, G. D'Alessandro, M. Kaczmarek and J. Brodzki.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/F_iCnzgape4"
    },
    "123": {
        "speaker_id": 109,
        "date": "February 10, 2023",
        "date2": "20230210",
        "title": "Signed rank decompositions for multi-parameter persistence: from Moebius inversion to relative homological algebra",
        "keywords": [
            "multi-parameter persistence",
            "Moebius inversion",
            "relative homological algebra"
        ],
        "abstract": "A question that comes up repeatedly in recent developments on multi-parameter persistence is to define mathematically sound and computationally tractable notions of approximation for multi-parameter persistence modules. As $\\mathbb{R}^n$ is of wild representation type, one seeks to approximate arbitrary (say, finitely presentable) modules by modules coming from some subcategory that is easier to work with in practice. An obvious candidate subcategory is the one of interval-decomposable modules, whose summands are indicator modules of intervals (i.e. convex, connected subsets of $\\mathbb{R}^n$, equipped with the product order). Indeed, interval-decomposable modules are convenient to work with, since they are easy to encode and manipulate on a computer, and to interpret visually. Several notions of module approximation using this subcategory have been proposed, among which the most common one seeks to preserve the rank invariant when switching from the original module to its interval-decomposable approximation. The motivation is that, the rank invariant being one of the weakest invariants available to us, preserving it is considered to be a minimum. As it turns out, this is not always possible, however one can always decompose the rank invariant of the module as a $\\mathbb{Z}$-linear combination of rank invariants of interval modules. Thus, a weaker form of preservation of the rank invariant is possible, in which the interval summands are signed (hence the name 'signed rank decomposition'). This fact can be viewed as a consequence of the Moebius inversion formula, but more fundamentally, it can be obtained by working in  the Grothendieck group relative to an appropriate exact structure, where the rank invariant of the module becomes equal to the alternating sum of the rank invariants of the various terms in the module's minimal relative projective resolution. This alternative proof strategy offers some significant benefits: (1) it links the coefficients in the decomposition to the structure of the module, as in the 1-parameter setting; (2) it provides a roadmap to study their bottleneck stability; (3) it connects multi-parameter persistence to relative homological algebra, thereby paving the way towards the definition of more refined invariants for multi-parameter persistence modules using larger classes of projectives. The purpose of my talk will be to tell this story.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/sMoe6x6Bwgs"
    },
    "122": {
        "speaker_id": 108,
        "date": "January 27, 2023",
        "date2": "20230127",
        "title": "Topology of random 2-dimensional cubical complexes",
        "keywords": [
            "stochastic topology",
            "cubical complexes",
            "random groups",
            "extremal topological combinatorics"
        ],
        "abstract": "We study a natural model of random 2-dimensional cubical complexes which are subcomplexes of an n-dimensional cube, and where every possible square (2-face) is included independently with probability p. Our main result exhibits a sharp threshold p=1/2 for homology vanishing as the dimension n goes to infinity. This is a 2-dimensional analogue of the Burtin and Erdős-Spencer theorems characterizing the connectivity threshold for random graphs on the 1-skeleton of the n-dimensional cube. Our main result can also be seen as a cubical counterpart to the Linial-Meshulam theorem for random 2-dimensional simplicial complexes. However, the models exhibit strikingly different behaviors. We show that if p > 1 - √1/2 ≈ 0.2929, then with high probability the fundamental group is a free group with one generator for every maximal 1-dimensional face. As a corollary, homology vanishing and simple connectivity have the same threshold. This is joint work with Matthew Kahle and Elliot Paquette.",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/tVro0p6QHeQ"
    },
    "121": {
        "speaker_id": 107,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Evolution of quantum knots driven by minimal surfaces",
        "keywords": [
            "quantum knots",
            "minimal surfaces",
            "Gross-Pitaevskii equation"
        ],
        "abstract": "The origin and dynamics of some quantum knots and links are studied under the Gross-Pitaevskii equation in an infinitely extended, unitary background density. Several direct numerical simulations are carried out by employing a new numerical code [1] that resolves the limits of boundary conditions on a truncated domain. The head-on collision of quantum vortex rings and the creation of a trefoil knot from initially unlinked, unknotted loops are realized for the first time. Three generic scenarios are identified: (i) direct topological cascade and collapse, (ii) structural and topological cycles, and (iii) inverse topological cascade of complex structures. Thanks to defect localization, we can apply geometric and topological techniques to get physical insight on the dynamics of these evolutionary processes. Writhing number proves to be an appropriate detector of direct topological cascade that governs the decay of complex structures to small-scale vortex rings, whereas picks of total curvature provide a clear signature of reconnection events. We show that isophase minimal surfaces spanning knots and links have a privileged role in the decay process by detecting surface energy relaxation of complex systems [2].</br></br><i>This work has been carried out in collaboration with Renzo Ricca. </i></br></br>[1] Caliari ,M. & Zuccher, S. 2021 A fast time splitting finite difference approach to Gross-Pitaevskii equations. Commun. Comput. Phys. 29, 1336-1364. </br>[2] Zuccher, S. & Ricca, R.L. 2022 Creation of quantum knots and links driven by minimal surfaces. J. Fluid Mech. 942, A8.",
        "video": "https://www.youtube.com/embed/IcnxViCEPsw"
    },
    "120": {
        "speaker_id": 106,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Meaningful definitions of magnetic helicity in open domains",
        "keywords": [
            "magnetic helicity",
            "winding gauge"
        ],
        "abstract": "It is well known that the magnetic helicity integral of magnetohydrodynamics is non-unique if the magnetic field passes through the domain boundary. Rather, it depends on the choice of vector potential, even in a topologically simple domain. The same is true of the field line helicity. In some sense, any choice of (field line) helicity is equally meaningful, because all are invariant under ideal deformations that vanish on the boundary. However, our proposition is that some choices are more physically meaningful than others, if one wishes to  measure topological complexity of the magnetic field. Candidate vector potentials include the so-called “winding gauge” [1] or the “poloidal-toroidal gauge” [2]. I will outline our ideas about what might be the “natural” choice of vector potential, both in Cartesian domains and in spherical shell domains. The latter are relevant to magnetic fields in the Sun’s atmosphere.</br></br><i>Joint work with Chris Prior and Daining Xiao. </i></br></br>[1] Prior, C.B. & Yeates, A.R. 2014 On the helicity of open magnetic fields. Astrophys. J. 787, 100. </br>[2] Berger, M.A. & Hornig, G. 2018 A generalized poloidal-toroidal decomposition and an absolute measure of helicity. J. Phys. A: Math. Theor. 51, 495501.",
        "video": "https://www.youtube.com/embed/RTbOBxfbA28"
    },
    "119": {
        "speaker_id": 105,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Noether currents for Eulerian variational principles in non-barotropic magneto-hydrodynamics and topological conservations laws",
        "keywords": [
            "Noether current",
            "non-barotropic magnetohydrodynamics"
        ],
        "abstract": "We derive a Noether current for the Eulerian variational principle of ideal non-barotropic magnetohydrodynamics (MHD). It was shown previously that ideal non-barotropic MHD is mathematically equivalent to a five-function field theory with an induced geometrical structure in the case that field lines cover surfaces and this theory can be described using a variational principle. Here we use various symmetries of the flow to derive novel topological constants of motion through the newly derived Noether current and discuss their implication for non-barotropic MHD and plasma confinement.</br></br><i>In collaboration with Hong Qin (Princeton U.). </i></br></br>[1] Yahalom, A. 2021 A Three-Function Variational Principle for Stationary Nonbarotropic Magnetohydrodynamics. Symmetry 13(9) 1632. </br>[2] Yahalom A. & Qin H. 2021 Noether Currents for Eulerian Variational Principles in Non-Barotropic Magnetohydrodynamics and Topological Conservations Laws. J. Fluid Mech. 908, A4. </br>[3] Yahalom A. 2017 Non-Barotropic Cross-helicity Conservation Applications in Magnetohydrodynamics and the Aharanov-Bohm effect. Fluid Dyn. Res. 50(1), 011406.",
        "video": "https://www.youtube.com/embed/UroJX0pBxWA"
    },
    "118": {
        "speaker_id": 104,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Mysterious triality and M-theory",
        "keywords": [
            "M-theory",
            "Del Pezzo surface",
            "rational homotopy"
        ],
        "abstract": "Mysterious duality was discovered by Iqbal, Neitzke, and Vafa [1] as a convincing, yet mysterious correspondence between certain symmetry patterns in toroidal compactifications of M-theory and del Pezzo surfaces, both governed by the root system series $E_k$. It turns out that the sequence of del Pezzo surfaces is not the only sequence of objects in mathematics which gives rise to the $E_k$ symmetry pattern. I will present a sequence of topological spaces, starting with the four-sphere $S^4$, and then forming its iterated cyclic loop spaces $L_c^k$ $S^4$, within which we will see the $E_k$ symmetry pattern via rational homotopy theory. For this sequence of spaces, the correspondence between its $E_k$ symmetry pattern and that of toroidal compactifications of M-theory is no longer a mystery, as each space $L_c^k$ $S^4$ is naturally related to the compactification of M-theory on the k-torus via identification of the equations of motion of (11-k)-dimensional supergravity as the defining equations of the Sullivan minimal model of Lck S4. This gives an explicit duality between rational homotopy theory and physics. Thereby, Iqbal, Neitzke, and Vafa’s mysterious duality between algebraic geometry and physics is extended to a triality involving algebraic topology, with the duality between topology and physics demystified. The mystery is now transferred to the mathematical realm as duality between algebraic geometry and topology.</br></br><i>This is a joint work [2] with Hisham Sati. </i></br></br>[1] Iqbal, A., Neitzke, A., Vafa, C. 2002 A mysterious duality. Adv. Theor. Math. Phys. 5, 769-808. arXiv:0111068 [hep-th]. </br>[2] Sati, H., Voronov, A.A. 2021 Mysterious Triality. Preprint IPMU21- 0084. arXiv:2111.14810 [hep-th].",
        "video": "https://www.youtube.com/embed/-UQw5zeXEGs"
    },
    "117": {
        "speaker_id": 18,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "The Burau representation of the braid group and its application to dynamics",
        "keywords": [
            "Burau representation",
            "braid group"
        ],
        "abstract": "Strings that are anchored to parallel planes are called braids, and E. Artin realized that they could be given a group structure by concatenation.  The resulting braid group can be used for many purposes, in particular for encoding a dataset of two-dimensional trajectories in a concise form [1].  For example, the trajectories could arise from drifter observations in the ocean. Burau [2] introduced a convenient linear representation of the braid group, which has its origins in the homology of a branched cover.  We describe this representation, and see how it can be used to extract dynamical information about orbits, such as a measure of complexity that usually indicates the presence of chaotic dynamics, as well as a an indication of coherence of trajectories [3, 4].</br></br>[1] Thiffeault, J.-L.. 2022 Braids and Dynamics. Springer. </br>[2] Burau, W. 1935 Über Zopfgruppen und gleichsinnig verdrillte Verkettungen. Abh. Math. Semin. Univ. Hambg. 11, 179–186. </br>[3] Allhouse, M., Thiffeault, J.-L. 2012 Detecting coherent structures using braids. Physica D 241, 95–105. </br>[4] Yeung M., Cohen-Steiner, D., Desbrun, M. 2020 Material coherence from trajectories via Burau eigen-analysis of braids. Chaos 30, 033122.",
        "video": "https://www.youtube.com/embed/iMrD0oGjwIc"
    },
    "116": {
        "speaker_id": 103,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Topological solitons as nuclei",
        "keywords": [
            "topological solitons",
            "Skyrmions"
        ],
        "abstract": "Topological solitons [1] are particle-like solutions of nonlinear partial differential equations. This contribution will provide an introduction to Skyrmions, which are topological solitons that model nuclei [2]. Some of the properties of Skyrmions will be discussed in Skyrme’s original theory, followed by more recent developments that attempt to improve on this theory, for example by matching the cluster structure of light nuclei [3].</br></br>[1] Manton, N.S. and Sutcliffe, P.M. 2004 Topological Solitons. Cambridge University Press. </br>[2] Manton, N.S. 2022 Skyrmions: A Theory of Nuclei. World Scientific. </br>[3] Naya, C. and Sutcliffe, P.M. 2018 Skyrmions and clustering in light nuclei. Phys.Rev.Lett. 121, 232002.",
        "video": "https://www.youtube.com/embed/OXJ23ru6iWY"
    },
    "115": {
        "speaker_id": 0,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Helicity of seifert framed defects",
        "keywords": [
            "helicity",
            "defects",
            "reconnection",
            "Seifert surface"
        ],
        "abstract": "The topology and helicity of anti-parallel defect reconnection will be discussed.  Line defects are one-dimensional phase singularities (forming knots and links) that arise in a variety of physical systems. In these systems, isophase surfaces (Seifert surfaces) have the phase defects as boundary, and these Seifert surfaces define a framing of the normal bundle of each link component. We define the individual helicity for each component of a link singularity, and prove that each individual helicity is zero if and only if there exists a Seifert framing for the link. We extend these results to multi-armed defects. We prove that under anti-parallel reconnection of framed defect strands that both twist and writhe helicity are conserved.</br></br><i>Co-authors: Christian E. Laing, Renzo L. Ricca, Irma Cruz-White </i></br></br>[1] Laing, C.E. Ricca, R.L. Sumners, D.W. 2015 Conservation of writhe helicity under anti-parallel reconnection, Nature Scientific Reports 5, 9224. </br>[2] Sumners, D.W., Cruz-White, I. Ricca, R.L. 2021 Zero Helicity of Seifert Framed Defects, J. Phys A, Math. Theor. 54, 295203.",
        "video": "https://www.youtube.com/embed/-5ijF0kWfxA"
    },
    "114": {
        "speaker_id": 102,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Topological polymers and random embeddings of graphs",
        "keywords": [
            "topological polymers",
            "random embeddings",
            "graphs"
        ],
        "abstract": "Over the last few decades, substantial progress has been made is developing a rigorous mathematical theory of ring polymers (like DNA minicircles and mitochondrial DNA), mostly be researchers at the interface between knot theory and biology. Recently, chemists working on developing novel materials have made substantial progress in synthesizing so-called “topological polymers” which are modeled on more complicated graphs, including lassos, θ-curves, and even $K_{3,3}$ and $K_4$. Predicting the material properties of these polymers in solution requires a mathematical theory of random embeddings of graphs. Such a theory was developed by James, Guth, and Flory [1,2,3] in the 20th century to study elasticity, but only with simple Gaussian interactions between monomers. This talk describes a generalization of that theory [4] which can handle arbitrary interaction potentials, including freely-jointed networks and steric interactions.</br></br><i>Joint with Jason Cantarella, Tetsuo Deguchi, and Erica Uehara. </i></br></br>[1] James, H.M., Guth, E. 1943 Theory of the elastic properties of rubber. J. Chem. Phys. 11, 455–481. </br>[2] James, H.M. 1947 Statistical properties of networks of flexible chains. J. Chem. Phys. 15, 651–668. </br>[3] Flory, P.J. 1976 Statistical thermodynamics of random networks. Proc. R. Soc. Lond. A 351, 351–380. </br>[4] Cantarella, J., Deguchi, T., Shonkwiler, C., Uehara, E. 2022 Random graph embeddings with general edge potentials. arXiv: 2205.09049.",
        "video": "https://www.youtube.com/embed/vH6aobRg0sc"
    },
    "113": {
        "speaker_id": 101,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Untying pathways of vortex knots",
        "keywords": [
            "untying",
            "vortex knots",
            "reconnections",
            "band surgery"
        ],
        "abstract": "The untying of vortex knots by reconnections has been observed in [1]. We analyze such untying pathways by using the characterizations of band surgery on knots and links. The topology of entangled vortices is represented using oriented knots and links, and the reconnection of vortices is modeled using coherent band surgeries [2-4]. For the case where the topology of the vortices are torus knots or links of type T(2,p), we characterize the untying pathways and determine where the reconnections occur.</br></br>[1] Kleckner D. and Irvine W. 2013 Creation and dynamics of knotted vortices. Nature Phys. 9, 253-258. </br>[2] Hirasawa M. and Shimokawa K. 2000 Dehn surgeries on strongly invertible knots which yield lens spaces. Proc. Amer. Math. Soc. 128, 3445-3451. </br>[3] Shimokawa K., Ishihara K., Grainge I., Sherratt D.J, and Vazquez M. 2013 FtsK-dependent XerCD-dif recombination unlinks replication catenanes in a stepwise manner. Proc. Natl. Acad. Sci. USA 110, 20906-20911. </br>[4] Stolz R., Yoshida M., Brasher R., Flanner M., Ishihara K., Sherratt D.J., Shimokawa K., and Vazquez M. 2017 Pathways of DNA unlinking: a story of stepwise simplification. Sci. Rep. 7, 12420.",
        "video": "https://www.youtube.com/embed/Sc7T5FiI1oo"
    },
    "112": {
        "speaker_id": 100,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Knots for quantum computation from defect branes",
        "keywords": [
            "worldlines",
            "topological K-theory",
            "anyon braid"
        ],
        "abstract": "Already 25 years ago [1], Kitaev proposed that intrinsically fault-tolerant quantum computation should be possible by knotting the worldlines of defect points in effectively 2-dimensional quantum materials akin to graphene. Meanwhile, there have been striking advances (a) in the theoretical understanding of such quantum materials, in terms of topological K-theory; and (b) in the practical construction of toy quantum computers – but the “topological quantum gates” proposed by Kitaev have remained somewhat elusive, both practically but also theoretically. Recently we have shown [2] that a previously neglected sector of topological K-theory in its fully-fledged “twisted & equivariant & differential” refinement does reflect those topological quantum gates that are thought to be practically realizable – namely the “su(2)-anyon braid gates”. This insight was drawn from the study of “defect branes” in string theory and points to a non-perturbative enhancement of what is known as “holographic” condensed matter theory. I will give a gentle motivation and exposition of these results. Talk notes will be available at: ncatlab.org/schreiber/show/Erice+2022</br></br><i>This is joint work with Hisham Sati. </i></br></br>[1] Kitaev, A. 1997 Faul-tolerant quantum computation by anyons. Annals of Physics, 303, 2-30. arXiv:quant-ph/9707021 </br>[2] Sati, H. & Schreiber, U. 2022 Topological Quantum Programming in TED-K, PlanQC 2022, 33.",
        "video": "https://www.youtube.com/embed/1422U_oxRvM"
    },
    "111": {
        "speaker_id": 99,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Introducing KnotPlot redux for experiments in knot theory",
        "keywords": [
            "KnotPlot"
        ],
        "abstract": "A newly reworked version of the speaker's software KnotPlot will be presented.  This version has an updated user interface with a native look and feel on multiple platforms, making the program much easier to learn and use.  In addition, KnotPlot is now augmented with powerful scripting languages (Lua and Python) that will allow researchers to write their own code for their experiments.  Example projects involving geometrical and topological simplification of knots, and a plugin mechanism for customizing the dynamics, will be presented.</br></br>[1] KnotPlot: https://www.knotplot.com/",
        "video": "https://www.youtube.com/embed/Euyiq5HTCfY"
    },
    "110": {
        "speaker_id": 98,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Integrability and hamiltonisation of non-holonomic systems with symmetry",
        "keywords": [
            "integrability",
            "Hamiltonian",
            "non-holonomic systems"
        ],
        "abstract": "The problems of integrability and Hamiltonisation of nonholonomic systems (with symmetry) has been an active topic of research in the last twenty years. In this talk I present a sufficient condition that guarantees both the existence of a reduced Poisson structure that makes the reduced system Hamiltonian, and the  (broad) integrability of the reduced system. Moreover if some compactness issue on the reduced dynamics is satisfied also the integrability of the complete systems can be ensured. Finally some important examples are presented.</br></br><i>Based on a joint work with Paula Balseiro (UFF, Brazil). </i></br></br>[1] Balseiro, P. and Sansonetto, N. 2022 First Integrals and Symmetries of Nonholonomic Systems Arch. Rat. Mech. Anal. 244, 343-389.",
        "video": "https://www.youtube.com/embed/MQs5aRcLBV4"
    },
    "109": {
        "speaker_id": 5,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Multi-valued potentials and physical reality",
        "keywords": [
            "multi-valued potentials",
            "multiply-connected domains"
        ],
        "abstract": "Riemann’s paper [1] on multi-valued potentials in multiply-connected domains marks arguably the origin of topology. It prompted Lord Kelvin [2] to propose a correction to Green’s first identity in potential theory, but his result remained almost unnoticed. Following Kelvin’s own work we re-derive this result from first principles, and show how ideas and techniques introduced have important implications in modern physics and in current applications of multi-valued gauge theory in condensed matter physics [3].</br></br>[1] Riemann, B. 1857 Lehrsätze aus der analysis situs für die Theorie der Integrale von zweigliedrigen vollständigen Differentialen. J. Mathematik 54, 105-110. </br>[2] Thomson, W. (Lord Kelvin) 1869 On vortex motion. Trans. Roy. Soc. Edin. 25, 217-260. </br>[3] Ricca R.L., Foresti M. 2022 Multi-valued potentials in topological field theory. In Knotted Fields (edited by R.L. Ricca & X. Liu), to appear, Springer.",
        "video": "https://www.youtube.com/embed/5X8gRy-dDSE"
    },
    "108": {
        "speaker_id": 97,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Some results and open questions regarding vector field winding",
        "keywords": [
            "vector field winding",
            "helicity",
            "linking",
            "braided fields"
        ],
        "abstract": "The helicity is a well-known and critical topological quantity in a number of fields, including magnetohydrodynamics, fluid mechanics, non-linear elasticity and gauge field theories. In fact it is a product of two pieces of information, the strength (flux) of the field, and the winding/linking (the topological part). I will present two results: First that the winding can uniquely topologically classify certain types of braided fields [1] (this uniqueness is lost for the helicity). Second, that in continuum theories there are classes of vector fields for which the helicity can decay but the topology stays fixed [2]. In other words the two distinct components of the helicity have their own evolutionary rules. Using these results I will pose some open questions about the topology of vector fields whose answer I believe would provide significant insight.</br></br><i>This is joint work with David MacTaggart and Anthony Yeates. </i></br></br>[1] Prior, C.B., & Yeates, A.R. 2021 Intrinsic winding of braided vector fields in tubular subdomains. J. Phys. A: Mathematica & Theoretical 54, 465701. </br>[2] Prior, C., & MacTaggart, D. 2020 Magnetic winding: what is it and what is it good for?. Proc. Roy. Soc. A 476, 20200483.",
        "video": "https://www.youtube.com/embed/E_Wz_XOSqqQ"
    },
    "107": {
        "speaker_id": 45,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Topology of the nodal sets of eigenfunctions of Schrödinger operators",
        "keywords": [
            "nodal sets",
            "Schrödinger operators"
        ],
        "abstract": "In 2001, Sir Michael Berry conjectured that given any knot there should exist a (complex-valued) eigenfunction of the harmonic oscillator or the hydrogen atom whose nodal set contains a component of such a knot type. This is a particular instance of the following problem: how is the topology of the nodal sets of eigenfunctions of Schrödinger operators? In this talk I will focus on the flexibility aspects of the problem: if we consider operators with a large group of symmetries, one can exploit the large multiplicity of the high eigenvalues to use a novel inverse localization property. In particular, I will show how to use this strategy to tackle the aforementioned Berry's problem.</br></br><i>This is based on different joint works with Alberto Enciso, Alba García- Ruiz, David Hartley and Francisco Torres de Lizaur. </i></br></br>[1] Enciso, A., Hartley, D., Peralta-Salas, D. 2018 A problem of Berry and knotted zeros in the eigenfunctions of the harmonic oscillator. J. Eur. Math. Soc. 20, 301-314. </br>[2] Enciso, A., Hartley, D., Peralta-Salas, D. 2018 Dislocations of arbitrary topology in Coulomb eigenfunctions. Rev. Mat. Iberoam. 34, 1361-1371. </br>[3] Enciso, A., Peralta-Salas, D., Torres de Lizaur, F. 2021 High-energy eigenfunctions of the Laplacian on the torus and the sphere with nodal sets of complicated topology. Springer Proc. Math. & Stat. 346, 245-261. </br>[4] Enciso, A., García-Ruiz, A., Peralta-Salas, D. 2022, Inverse localization and global approximation for some Schrödinger operators on hyperbolic spaces. Preprint (available in ArXiv).",
        "video": "https://www.youtube.com/embed/pue3EoCXs7s"
    },
    "106": {
        "speaker_id": 29,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Timecrystalline vortices, saddle points and the Poincaré index formula",
        "keywords": [
            "timecrystalline vortices",
            "saddle points",
            "Poincaré index formula"
        ],
        "abstract": "Vortices in a Bose-Einstein condensate are modelled as spontaneously symmetry breaking minimum energy solutions of the time dependent Gross-Pitaevskii equation.  In a non-rotating axially symmetric trap, the core of a single vortex precesses around the trap center and, at the same time, the phase of its wave function shifts at a constant rate. The precession velocity,  the speed of phase shift, and the distance between the vortex core and the trap center, depend continuously on the value of the conserved angular momentum that is carried by the entire condensate. The number of vortices increases with increasing angular momentum, and the vortices repel each other to form timecrystalline Abrikosov lattices. Poincaré index formula states that besides vortices there are also saddle points, and the difference in the number of vortices and saddle points can never change. But unlike vortices the saddle points can also attract each other, they can join and become combined into timecrystalline degenerate critical point configurations. But when the number of saddle points becomes sufficiently large there is a transition, and instead of attracting each other, the saddle points start repelling each other, and pair up with vortices. The ensuing structures rotate around the trap center, in regular arrangements akin Abrikosov lattices [1].</br></br><i>This is joint work with Julien Garaud and Jin Dai. </i></br></br> [1] Garaud J., Dai J. and Niemi A.J. 2021 Vortex precession and exchange in a Bose-Einstein condensate. J. High Energy Physics 157, 1-21.",
        "video": "https://www.youtube.com/embed/DAiYfC79HbI"
    },
    "105": {
        "speaker_id": 41,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Fractal dimension meets topology: statistics of collapsed polymers and beyond",
        "keywords": [
            "fractional Brownian polymers",
            "knot complexity",
            "braids"
        ],
        "abstract": "We consider statistical and topological properties of fractional Brownian polymers, equipped with short-range volume interactions [1]. The attention is paid to statistical properties of collapsed conformations with the fractal dimension $D_f \\geq 2$ in 3D, which are analyzed both numerically and via the mean-field Flory approach. Our study is motivated by an attempt to mimic the conformational statistics of collapsed unknotted polymer rings, which are known to equilibrate into the compact hierarchical crumpled globules (CG) with $D_f = 3$ at large scales. Replacing the topologically stabilized CG state by a self-avoiding fractal path adjusted to the fractal dimension $D_f \\approx 3$, we tremendously simplify the problem of generating the CG-like conformations since we wash out the topological constraints from the consideration. We show that, with the increase of $D_f$, typical conformations become more territorial and less knotted. Distributions of the knot complexity, $P(\\chi)$, for collapsed ring chains with $D_f \\geq 2$ suggest a direct correspondence between the fractal dimension and knotting of fractal paths. We extend the found results to the investigation of braiding of directed polymers near curved surfaces where the statistics of random walks becomes non-Gaussian [2].</br></br>[1] Astakhov, A.M., Avetisov, V.A., Nechaev, S.K. and Polovnikov, K.E. 2021 Fractal dimension meets topology: statistical and topological properties of globular macromolecules with volume interactions. Macromolecules 54, 1281. </br>[2] Valov, A., Avetisov, V., Nechaev, S. and Oshanin, G. 2020 Field-driven tracer diffusion through curved bottlenecks: fine structure of first passage events. Phys. Chem. Chem. Phys. 22, 18414.",
        "video": "https://www.youtube.com/embed/_OARKkv2Yh0"
    },
    "104": {
        "speaker_id": 96,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "An interactive topological organization of a vortex between vortical flow and bundle of vorticity lines",
        "keywords": [
            "vortical flow",
            "swirlity",
            "vorticity lines"
        ],
        "abstract": "The present study clarifies a mechanism of an interactive organization of vortical flow structure and bundle of vorticity lines of a vortex. The formulation of the vortex stretching in a Galilei invariant coordinate system associated with the swirl plane, vortex space [1], shows that the vortical flow structure swirls a bundle of the vorticity lines which feature depends on the topological dynamics of the flow along a vortical region. Inversely, the velocity structure is influenced by swirling or rotating feature of the vorticity lines, which generates the axial flow of the vortex. The local axis geometry scheme specifies the topology of the bundle in the vortical region, and the topological quantities, i.e., swirlity, sourcity, and vortical flow symmetry [2], clarify the topological characteristics of both vortical flow and vorticity lines. This theory conjectures the specifec vortical structure in a homogeneous isotropic turbulence or wind turbine.</br></br><i>Part of the work was carried out with the financial support of the Bilateral Joint Program JSPS (Grant No. JPJSBP120214812), and under the Collaborative Research Project of the Institute of Fluid Science, Tohoku University, and 37th Grant from The Nitto Foundation. </i></br></br> [1] Nakayama, K. 2017 Topological features and properties associated with development/decay of vortices in isotropic homogeneous turbulence. Phy. Rev. Fluids 2, 014701. </br>[2] Nakayama, K. 2014 Physical properties corresponding to vortical flow geometry. Fluid Dyn. Res. 46, 055502.",
        "video": "https://www.youtube.com/embed/-fxssHZP_hs"
    },
    "103": {
        "speaker_id": 95,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Minimal surface generating flow",
        "keywords": [
            "minimal surfaces",
            "geometric flow",
            "space curves"
        ],
        "abstract": "Minimal surfaces are abundant in nature, from the shape of grain boundaries and soap films to the apparent horizon of a black hole. In this contribution, we discuss how minimal surfaces can be generated via geometric flow of space curves. We present two different approaches, discuss their possible applications and outline future work.</br></br><i>This is a joint work Michal Beneš. </i></br></br> [1] Minarčík, J., Beneš M. 2022 Minimal surface generating flow for space curves of non-vanishing torsion. Discrete & Continuous Dynamical Systems B, to appear. </br>[2] Minarčík, J., Beneš, M. 2022 Non-degenerate homotopy and geometric flows. Homology, Homotopy and Applications, to appear.",
        "video": "https://www.youtube.com/embed/ucsY6I_j9Bs"
    },
    "102": {
        "speaker_id": 94,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "The groups $G_n^k$ and $\\Gamma_n^k$ and their applications in topology, algebra and geometry",
        "keywords": [
            "braid group",
            "braid particles"
        ],
        "abstract": "In 2015, the author defined the two-parametric family of groups $G_n^k$, that depend on two integer parameters $n > k$, and formulated the following principle: “If a dynamical system describing the motion of $n$ particles possesses a nice co-dimension 1 property governed by exactly $k$ particles, then this dynamical system has a topological invariant valued in $G_n^k$.” </br></br>The first examples describe motions of points on the plane with properties that “3 points are collinear” and “4 points belong to the same circle or line”, which lead to homomorphisms from the pure braid group given by  $PB_n \\to G_n^3$, and $PB_n \\to G_n^k$, respectively. In a similar manner we defined other series of groups $\\Gamma_n^4$, that correspond to the configuration space of triangulations. We shall describe various examples and applications of the groups $G_n^k$ and $\\Gamma_n^4$ in algebra, geometry and topology and formulate some open problems.</br></br><i>This is joint work with several collaborators including I.M. Nikonov, S. Kim, D.A. Fedoseev, Z. Wan, J. Wu and H. Yan. </i></br></br> [1] Manturov, V.O., Fedoseev, D.A., Nikonov, I.M. and Kim, S. 2020 Invariants and Pictures: Low-Dimensional Topology and Combinatorial Group Theory. World Scientific.",
        "video": "https://www.youtube.com/embed/JRXkpt3jBu0"
    },
    "101": {
        "speaker_id": 93,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Magnetic helicity in multiply connected domains and the proof of Taylor’s conjecture",
        "keywords": [
            "magnetic helicity",
            "multiply connected domains",
            "Taylor’s conjecture"
        ],
        "abstract": "Magnetic helicity is a topological invariant of ideal magnetohydrodynamics that describes the linkage of field lines weighted by magnetic flux. In simply connected and magnetically closed domains, its definition is the integral, over the domain, of the dot product of the magnetic field with a vector potential of the magnetic field. This definition is gauge-invariant, i.e. it does not depend on the choice of the vector potential. Often, however, it is necessary to consider magnetic helicity in multiply connected domains, such as a torus or a toroidal shell – two domains important in plasma physics. The standard definition of magnetic helicity in simply connected domains for any vector potential is no longer applicable in multiply connected domains as it is not gauge invariant. In this contribution, we present two main results. (1) The extension of the definition of magnetic helicity to bounded and multiply connected domains, making the definition gauge invariant. (2) The use of this extended definition to complete the landmark proof of Taylor’s conjecture in [1], allowing for arbitrary vector potentials to be used in multiply connected domains. Further details can be found in [2] and [3].</br></br><i>This is joint work with Daniel Faraco, Sauli Lindberg and Alberto Valli. </i></br></br> [1] Faraco, D., Lindberg, S. 2020 Proof of Taylor’s conjecture on magnetic helicity conservation. Comm. Math. Phys. 373, 707-738. </br>[2] MacTaggart, D., Valli, A. 2019 Magnetic helicity in multiply connected domains, J. Plasma Phys. 85, 77580501. </br>[3] Faraco, D., Lindberg, S, MacTaggart, D., Valli, A. 2022 On the proof of Taylor’s conjecture in multiply connected domains. Appl. Math. Lett. 124, 107654.",
        "video": "https://www.youtube.com/embed/yx8xNFNDSU0"
    },
    "100": {
        "speaker_id": 92,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Measuring topological complexity of physical knots and links to detect cascade evolution",
        "keywords": [
            "vortex knots",
            "adapted HOMFLYPT polynomial",
            "complexity degree"
        ],
        "abstract": "Recent laboratory and numerical experiments in classical and quantum fluids[1][5] and recombinant DNA plasmids [6] show that physical knots/links are highly unstable, decaying from a high-topological complexity state to a low-complexity state through a series of reconnection events. In this talk we would review the following progress: (i) crossing numbers of prime knots/links versus the groundstate energy spectrum [4]; (ii) adapted HOMFLYPT polynomial values used to quantify complexity of torus knots and links [2]; (iii) complexity degree of a knot defined in a Legendre polynomial basis in a suitably defined knot polynomial space [3].</br></br><i>This is joint work with Renzo Ricca (U. Milano-Biccoca, Italy) and Xinfei Li (Guangxi U. Science & Technology, China). </i></br></br> [1] Kleckner D., Kauffman L.H., Irvine W.T.M. 2016 How superfluid vortex knots untie, Nature Phys. 12, 650–655. </br>[2] Liu X. & Ricca R.L. 2016 Knots cascade detected by a monotonically decreasing sequence of values. Sci. Rep. 6, 24118. </br>[3] Liu X., Ricca R.L. & Li X.-F. 2020 Minimal unlinking pathways as geodesics in knot polynomial space. Communications Phys. 3, 136. </br>[4] Ricca R.L., Maggioni F. 2014 On the groundstate energy spectrum of magnetic knots and links. J. Phys. A: Mathematical & Theoretical 47, 205501. </br>[5] Scheeler M.W. et al. 2014 Helicity conservation by flow across scales in reconnecting vortex links and knots. PNAS USA 111,15350. </br>[6] Stolz R. et al. 2017 Pathways of DNA unlinking: A story of stepwise simplification. Sci. Rep. 7 12420.",
        "video": "https://www.youtube.com/embed/2tKlN0MTZhM"
    },
    "99": {
        "speaker_id": 91,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Topological surgery and applications",
        "keywords": [
            "topological surgery",
            "Morse description"
        ],
        "abstract": "We discuss topological surgery in dimensions 1, 2 and 3 enriched by local dynamics and we provide the Morse description. Along the way we present some interesting phenomena exhibiting surgery.</br></br><i>This is joint work with Stathis Antoniou and Louis Kauffman. </i></br></br> [1] Antoniou, S. and Lambropoulou, S. 2017 Extending topological surgery to natural processes and dynamical systems, PLOS 12 (9). </br>[2] Antoniou, S., Kauffman, L.H. and Lambropoulou, S. 2019 Topological surgery in cosmic phenomena, Adv. Theor. Math. Phys. 23, No. 3. </br>[3] Antoniou, S., Kauffman, L.H. and Lambropoulou, S. 2019 Detecting and visualizing 3-dimensional surgery, J. Knot Theory Ramif. 28, 13, 1-29.",
        "video": "https://www.youtube.com/embed/64Vszyv7scI"
    },
    "98": {
        "speaker_id": 90,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Beyond Arnold's geodesic framework of an ideal hydrodynamics",
        "keywords": [
            "ideal hydrodynamics",
            "Lie groupoid",
            "volume-preserving diffeomorphisms"
        ],
        "abstract": "We discuss ramifications of Arnold’s group-theoretic approach to ideal hydrodynamics as the geodesic flow for a right-invariant metric on the group of volume-preserving diffeomorphisms. We show that problems of optimal mass transport are in a sense dual to the Euler hydrodynamics. Moreover, many equations of mathematical physics, such as the motion of vortex sheets or fluids with moving boundary, have Lie groupoid, rather than Lie group, symmetries [1, 2].</br></br><i>This is a joint work with Anton Izosimov. </i></br></br> [1] Izosimov, A. and Khesin, B. 2018, Vortex sheets and diffeomorphism groupoids. Advances in Math. 338, 447-501. arXiv:1705.01603 </br>[2] Izosimov, A. and Khesin, B. 2022, Geometry of generalized fluid flows. Preprint. arXiv:2206.01434, 27pp.",
        "video": "https://www.youtube.com/embed/ZfNzuee_nB4"
    },
    "97": {
        "speaker_id": 8,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Reconnection number of vortex knots",
        "keywords": [
            "reconnection number",
            "vortex knots"
        ],
        "abstract": "Knotted vortices such as those produced by Kleckner and Irvine at the Frank Institute of the University of Chicago tend to transform by reconnection to collections of unknotted and unlinked circles [1], [2]. The reconnection number R(K) of an oriented knot of link K is the least number of reconnections (oriented re-smoothings) needed to unknot/unlink K. Putting this problem into the context of knot cobordism, we show, using Rasmussen’s Theorem ([3], [4], [5]) that the reconnection number of a positive knot is equal to twice the genus of its Seifert spanning surface. In particular an (a,b) torus knot has R = (a-1)(b-1). For any knot or link diagram K, we show that R(K) is counted from above by c(K) - s(K) + 1 where c(K) is the number of crossings of K and s(K) is the number of Seifert circles of K. For an arbitrary positive knot or link K, this is an equality. That is, for K a positive link, R(K) = c(K) -s(K) + 1. Examples of vortex dynamics will be illustrated.</br></br>[1] Kleckner, D. and Irvine, W.T.M. 2013 Creation and dynamics of knotted vortices. Nature Physics 9, 253258. </br>[2] Kleckner, D., Kauffman, L.H. and Irvine, W.T.M. 2016 How superfluid vortex knots untie, Nature Physics 12, 650655. </br>[3] Kauffman, L. H. 2016 An introduction to Khovanov homology. In Knot Theory and Its Applications”, p. 105139. Contemp. Math., 670, Amer. Math. Soc., Providence, RI. </br>[4] Dye, H.A., Kaestner, A. and Kauffman, L.H. 2017 Khovanov homology, Lee homology and a Rasmussen invariant for virtual knots. J. Knot Theory Ramifications 26, 1741001. </br>[5] Rasmussen, J. 2010 Khovanov homology and the slice genus. Invent Math. 182, 419447.",
        "video": "https://www.youtube.com/embed/25OtKxtNakk"
    },
    "96": {
        "speaker_id": 65,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Topological lessons from liquid crystals",
        "keywords": [
            "liquid crystals",
            "topological defects"
        ],
        "abstract": "The topology of the manifold of ground states in an equilibrium system determines the nature and variety of topological defects in ordered materials.  Liquid crystals enjoy a great variety of different manifolds and, as a result, many have topological defects that interact in a non-Abelian manner.  I will discuss the smectic liquid crystal as the paradigm for all spatially ordered states, describe the interaction between translational and rotational defects, and show how the energy can have a topological nature.  All in an hour!</br></br>[1] Machon, T. Aharoni, H., Hu Y. and Kamien, R.D. 2019 Aspects of Defect Topology in Smectic Liquid Crystals. Commun. Math. Phys. 372, 525–542. </br>[2] Hocking, B.J., Ansell, H.S., Kamien, R.D. and Machon T. 2022 The Topological Origin of the Peierls-Nabarro Barrier. Proc. Roy. Soc. A 478, 20210725. </br>[3] Aharoni, H., Machon T. and Kamien R.D. 2017 Composite Dislocations in Smectic Liquid Crystals, Phys. Rev. Lett. 118, 257801.",
        "video": "https://www.youtube.com/embed/aSKchadHWfo"
    },
    "95": {
        "speaker_id": 89,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Magnetohydrodynamic relaxation",
        "keywords": [
            "magnetic relaxation",
            "Taylor’s theory"
        ],
        "abstract": "The equations of Magnetohydrodynamics (MHD) describe the evolution of an electrically conducting fluid. The resistive term in the MHD equations is for most astrophysical and also many technical plasmas very small. If one neglects this term (ideal MHD), the equations have an infinite number of conserved quantities related to the conservation of the topology of the magnetic field. On the other hand, even with very small resistivity strong current sheets can develop in localised regions leading to magnetic reconnection. This raises the question which ideal invariants are still approximate invariants in the limit of small, but non-vanishing, resistivity. We will discuss a number of numerical relaxation experiments which we have performed on plasmas with complex, braided, magnetic fields to find out which invariants govern the relaxation process towards a minimum energy state. This includes a critical review of Taylor’s theory [1], as well as a discussion of the role of turbulence [2, 3].</br></br><i>This is joint work with Anthony Yeates and Alexander Russell. </i></br></br> [1] Taylor, J.B. 1986 Relaxation and Magnetic Reconnection in Plasmas. Rev. Mod. Phys. 58, 741. </br>[2] Yeates A.R., Russell A.J.B. and Hornig, G. 2015 Physical role of topological constraints in localized magnetic relaxation. Proc. R. Soc. A. 471, 20150012. </br>[3] Yeates, A.R., Russell, A.J.B. and Hornig, G. 2021 Evolution of field line helicity in magnetic relaxation. Phys. Plasmas 28, 082904.",
        "video": "https://www.youtube.com/embed/JCiAQbynuyw"
    },
    "94": {
        "speaker_id": 88,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "New evolutionary pathways map for a system of physical knots and links",
        "keywords": [
            "Borromean rings",
            "quantum reconnection"
        ],
        "abstract": "The study of quantum defects bears several analogies with classical fluids. It is well known that physical knots and links decay from a high-topological complexity state to a low-complexity state [1,2] and during evolution different dacaying paths can occur. A theoretical explanation of this phenomenon represents a fundamental open problem. Here we consider the spontaneous decay of Borromean superfluid rings governed by the Gross-Pitaevskii equation. Due to quantum reconnections [3] the system experiences a cascade path passing through midway stages forming a Whitehead link, a trefoil knot and a Hopf link, ultimately producing trivial loops. In particular, among the evolution paths, a new inverse cascade progress is observed in free evolution. The pathways discovered form an evolutionary map that helps to establish a theoretical framework of similar phenomena.</br></br><i>This is joint work with Simone Zuccher (U. Verona, Italy) and Xin LIU (Beijing U. Technology, China).</i></br></br> [1] Liu X. & Ricca R.L. 2016 Knots cascade detected by a monotonically decreasing sequence of values. Sci. Rep. 6, 24118. </br>[2] Liu X., Ricca R.L. & Li X.-F. 2020 Minimal unlinking pathways as geodesics in knot polynomial space. Communications Phys. 3, 136. </br>[3] Zuccher S. et al. 2012 Quantum vortex reconnections. Phys. Fluids. 24, 125108.",
        "video": "https://www.youtube.com/embed/5riTednD9cE"
    },
    "93": {
        "speaker_id": 87,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Nambu brackets for ideal fluid and mhd equations and their applications",
        "keywords": [
            "Nambu brackets",
            "Lie-Poisson Hamiltonian"
        ],
        "abstract": "For the ideal magnetohydrodynamics (MHD), Noether's theorem states that the topological invariant associated with the particle relabeling symmetry is the cross helicity, the volume integral of the scalar product of the velocity field and a frozen-in field. This is also the case for the dynamics of an ideal fluid. A proof to it is given in terms of variation of the Lagrangian label as a function of the Eulerian position [1,2]. In addition to the cross helicity, the total mass, the total entropy and the magnetic helicity are topological invariants. We construct the Nambu bracket for the ideal MHD with constant coefficients, using the three topological invariants other than the total mass as Hamiltonians, together with the total energy [3]. The Lie-Poisson bracket induced from the Nambu bracket gives an extension of the known one [4] and automatically guarantees the cross-helicity to be a Casimir invariant. The Casimir manifested by the Namb btacket, if specialized to a vortex filament, provides the recursion operator for producing the localized induction hierarchy.</br></br><i>This is joint work with Rong Zou (U. Hawaii at Mānoa, USA). </i></br></br>[1] Fukumoto, Y. 2008 A unified view of topological invariants of fluid flows. Topologica 1, 3. </br>[2] Fukumoto, Y. and Sakuma H. 2013 A unified view of topological invariants of barotropic and baroclinic fluids and their application to formal stability analysis of three-dimensional ideal gas flows. Procedia IUTAM 7, 213-222. </br>[3] Nambu, Y. 1973 Generalized Hamiltonian Dynamics. Phys. Rev. D 7, 2405- 2412. </br>[4] Morrison P.J. and Greene I.M. 1980 Phys. Rev. Lett. 45, 790-794. 1982 Errata 48, 569.",
        "video": "https://www.youtube.com/embed/QCwjSJUjzpI"
    },
    "92": {
        "speaker_id": 86,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Physical effects of global and localized Twist phase on quantum vortex defects",
        "keywords": [
            "twist phase",
            "quantum defects",
            "local",
            "global",
            "helicity"
        ],
        "abstract": "Twist is a well-known quantity in classical vortex theory, but its physical effects have not been studied in the context of quantum vortex defects in Bose-Einstein condensates. Here we introduce the concepts of global twist phase and localized twist phase to analyze the physical effects induced by the different phase presence on defects [1]. These effects are studied by making use of Kleinert’s multi-valued gauge theory [2, 3] under the zero helicity condition for the Gross-Pitaevskii equation. In the presence of global twist we show that secondary defects must be produced consistently with the zero-linking number requirement. If however a twist phase remains localized in the healing region of the defect the system is proved to be unstable [4], converting twist into writhe in analogy with the writhe instability of supercoiled elastic strings.</br></br><i>This is a joint work with Renzo Ricca. </i></br></br>[1] Foresti, M. & Ricca, R.L. 2020 Hydrodynamics of a quantum vortex in the presence of twist. J. Fluid Mech. 904, A25. </br>[2] Kleinert, H. 2008 Multivalued Fields in Condensed Matter, Electromagnetism and Gravitation. World Scientific, Singapore. </br>[3] Ricca R.L., Foresti M. 2022 Multi-valued potentials in topological field theory. In Knotted Fields (edited by R.L. Ricca & X. Liu), to appear, Springer. </br>[4] Foresti, M. & Ricca, R.L. 2022 Instability of a quantum vortex by twist perturbation. J. Fluid Mech., to appear.",
        "video": "https://www.youtube.com/embed/SRkZEp7ptLA"
    },
    "91": {
        "speaker_id": 7,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Skyrmionic hopfions: realising particle-like topologies in structured light",
        "keywords": [
            "Skyrmionic Hopfions",
            "Hopf fibration",
            "optical defects"
        ],
        "abstract": "Three-dimensional (3D) particle-like topological excitations, such as skyrmions and hopfions, originally proposed as topological models of fundamental particles and nuclei, have received much attention in high-energy and condensed matter systems. Rather than being based on special points and lines, the field values wrap around a 2-dimensional or 3D sphere “target space” within a plane or volume, realising a topological mapping of nontrivial degree, the Skyrme number. The full state of light, including polarisation and phase, determines a point on 3-sphere we call the optical hypersphere. Decomposing via the Hopf fibration, phase varies around Hopf loops, and the base space is the Poincaré sphere parametrising polarisation. We design, experimentally generate and measure an optical beam configuration which realises all polarisations and phases together in a propagation volume, realising a 3D optical skyrmionic hopfion [1]. For sufficiently high topological degree, the 3D polarisation structures are linked and knotted [2].</br></br><i>Joint work with Danica Sugic, Ramon Droop, Eileen Otte, Daniel Ehrmanntraut, Christopher Parmee, Franco Nori, Janne Ruostekoski and Cornelia Denz.</i></br></br>[1] Sugic D., Droop R., Otte E., Ehrmanntraut D., Nori F., Ruostekoski J., Denz C., & Dennis M.R. 2021 Particle-like topologies in light, Nature Comm. 12 6785 </br>[2] Parmee C.D., Dennis M.R., & Ruostekoski J. 2022 Optical excitations of Skyrmions, knotted solitons, and defects in atoms, Communications Phys. 5, 54.",
        "video": "https://www.youtube.com/embed/dr3QnSp4rhI"
    },
    "90": {
        "speaker_id": 20,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Polygons in higher dimensions via conformal barycenter sampling",
        "keywords": [
            "polygons",
            "Millson and Kapovich method"
        ],
        "abstract": "Topologists and geometers have been interested in the configuration spaces of linkages for a long time. In three dimensions, Millson and Kapovich observed that the configuration spaces of polygons (modulo rotations) were symplectic, leading to a natural structure on these polygon spaces [1] and eventually to a fast sampling algorithm [2]. Much of the MK method is inherently three-dimensional. However, in this talk, we present an extension of the MK construction which allows us to build and sample polygons of fixed edgelengths in a space of any dimension. Our method is a reweighted sampler; numerical experiments show it to be both accurate and efficient. It is based on ideas from hyperbolic geometry and depends on our previous algorithm for computing the conformal barycenter [3].</br></br><i>Joint work with Henrik Schumacher.</i> </br></br>[1] Kapovich, M. and Millson, J. 1996 The symplectic geometry of polygons in Euclidean Space. J. Differential Geometry 12, 479-513. </br>[2] Cantarella, J., Duplantier, B., Shonkwiler, C. and Uehara, E. 2016 A fast direct sampling algorithm for equilateral closed polygons. J. Physics A 49, 275205. </br>[3] Cantarella, J., Schumacher, H. 2022 Computing the conformal barycenter. SIAM J. on Applied Algebra and Geometry, to appear.",
        "video": "https://www.youtube.com/embed/21h4bUKbfO4"
    },
    "88": {
        "speaker_id": 85,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Stable knots and links in electromagnetic fields",
        "keywords": [
            "electromagnetic knots and links",
            "null field"
        ],
        "abstract": "An electromagnetic field consists of two time-dependent vector fields Et and Bt that satisfy Maxwell's equations. At any fixed time t closed field lines of Et or Bt form knots and links. If an electromagnetic field is null for all time, the time evolution of its field lines is given by a 1-parameter family of diffeomorphisms. In particular, the knot types of the closed field lines do not change with time. They are stable. The most famous example of a null field with knotted field lines is Rañada's Hopfion, where all field lines are closed and any pair of them forms a Hopf link [4]. In 2013, Kedia, Bialynicki-Birula, Peralta-Salas and  Irvine used a construction by Bateman [1] to obtain any torus knot as a closed field line of a null electromagnetic field [3].</br></br>In this talk I will use Bateman's construction and its relation to contact topology to prove that every knot and every link arises as a set of closed field lines of a null electromagnetic field [2].</br></br>[1] Bateman, H. 1915 The mathematical analysis of electrical and optical wavemotion. Dover. </br>[2] Bode, B. 2021 Stable knots and links in electromagnetic fields. Commun. Math. Phys. 387, 1757-1770. </br>[3] Kedia, H., Bialynicki-Birula, I., Peralta-Salas, D., Irvine, W.T.M. 2013 Tying knots in light. Phys. Rev. Lett. 111, 150404. </br>[4] Rañada, A.F. 1989 A topological theory of the electromagnetic field. Letters in Mathematical Physics 18, 97-106.",
        "video": "https://www.youtube.com/embed/sFXY29xUVvE"
    },
    "87": {
        "speaker_id": 36,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Definitions of twist, writhe, and absolute helicity in simply connected volumes",
        "keywords": [
            "twist",
            "writhe",
            "helicity"
        ],
        "abstract": "Quantities like twist and writhe are local building blocks of the global invariants linking number and helicity. They are readily defined when working in Cartesian or spherical geometries. In less symmetric geometries some complications arise. The talk will describe how the poloidal-toroidal representation of vector fields in spherical geometries can be generalized [1]. We foliate space into nested simply connected surfaces. If these surfaces lack spherical symmetry then the poloidal field acquires a shape term which arises from variation in curvature. We can then employ the shape term in defining absolute definitions of helicity, which describe how toroidal and poloidal components wrap about each other.</br></br><i>Joint work with Gunnar Hornig.</i></br></br>[1] Berger, M.A. and Hornig, G. 2018, A generalized poloidal–toroidal decomposition and an absolute measure of helicity. J. Phys. A: Math. Theor. 51 495501.",
        "video": "https://www.youtube.com/embed/OEt946XY-zg"
    },
    "86": {
        "speaker_id": 84,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Proof of zero-helicity for the Gross-Pitaevskii equation by Noether theorem",
        "keywords": [
            "helicity",
            "Gross-Pitaevskii equation",
            "Seifert framing"
        ],
        "abstract": "In ideal conditions the standard kinetic helicity, that is well-defined for classical fluid systems, is a well-known conserved quantity. In quantum fluids its rigorous definition needs an appropriate adjustment due to the lack of regularity for the presence of defects. As shown by Salman [1], and subsequently proven using topological arguments by Sumners et al. [2], helicity can be demonstrated to be invariably zero for systems that admit Seifert framing. A typical example of such systems is given by quantum vortex defects governed by the Gross-Pitaevskii equation. In this case an attempted proof of zero-helicity using Noether theorem was given by Kedia et al. [3]. Their demonstration, however, has several inconsistencies. Here by making use of Kleinert’s [4] multi-valued gauge theory and Seifert surface properties we provide a rigorous proof of this result.</br></br><i>This is joint work with Renzo Ricca.</i> </br></br>[1] Salman, H. 2017 Helicity conservation and twisted Seifert surfaces for superfluid vortices. Proc. R. Soc. A. 473, 20160853. </br>[2] Sumners, De W.L., Cruz-White, I.I. and Ricca, R.L. 2021 Zero helicity of Seifert framed defects. J. Phys. A: Math. & Theoret. 54, 295203. </br>[3] Kedia, H., Kleckner, D. Scheeler, M.W. and Irvine W.T.M. 2018 Helicity in superfluids: existence and the classical limit. Phys. Rev. Fluids 3, 104702. </br>[4] Kleinert, H. 2008 Multivalued Fields in Condensed Matter, Electromagnetism and Gravitation. World Scientific, Singapore.",
        "video": "https://www.youtube.com/embed/-e_qRTbjnOg"
    },
    "85": {
        "speaker_id": 79,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Tangled vortex lines",
        "keywords": [
            "vortex tangles",
            "quantum turbulence",
            "quantum fluids"
        ],
        "abstract": "Turbulent streamlines, vortex lines or magnetic field lines are usually chaotic, twisted, even apparently linked or knotted. In this lecture I shall address the problem of the complexity of turbulence in the context of quantum fluids, physical systems such as superfluid helium and atomic Bose-Einstein condensates which are studied in the laboratory at temperatures close to absolute zero. In quantum fluids, any rotational motion is constrained by quantum mechanics to individual (discrete) vortex lines of fixed (quantised) strength [1]. This is unlike what happens in ordinary fluids, where vorticity is a continuous field. Quantum turbulence, created by stirring a quantum fluid, is thus conceptually simpler than ordinary turbulence, consisting of a tangle of individual vortex lines rather than a disordered continuous vorticity field. After describing some surprising similarities between quantum turbulence [2] and ordinary turbulence in terms of energy spectrum and velocity statistics, I shall show how the geometry and the topology of quantum turbulence can be quantified in a relatively simple way [3, 4].</br></br>[1] Barenghi C.F. and Parker N.G. 2016 A Primer on Quantum Fluids, Springer. </br>[2] Barenghi C.F., Skrbek L., and Sreenivasan K.R. 2014 Introduction to quantum turbulence, PNAS USA 111 (Suppl. 1), 4647. </br>[3] Cooper R.G., Mesgarnezhad M., Baggaley A.W. and Barenghi C.F. 2019 Knot spectrum of turbulence, Sci. Reports 9, 10545. </br>[4] Barenghi C.F. 2022 Tangled vortex lines: dynamics, geometry and topology of quantum turbulence, In Knotted Fields (ed. R.L. Ricca & X. Liu), to appear, Springer. arXiv:2207.04260v1.",
        "video": "https://www.youtube.com/embed/aJ0qexoJSHE"
    },
    "84": {
        "speaker_id": 83,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Using writhe to produce realistic protein structure predictions from biosaxs data",
        "keywords": [
            "writhe",
            "proteins",
            "open curves"
        ],
        "abstract": "The writhe is a measure of global self entanglement of a curve. The usual technique for studying entanglement of protein backbones requires artificial or probabilistic closures, thus altering the geometry of the curve. By using the open curve definition of the writhe we can study the geometry of protein curves in a more natural way. In particular, I will present bounds on the amount of global entanglement as measured by both the writhe and absolute writhe. With these bounds, we can produce realistically folded structures from BioSAXS data[1] with a much higher chance of success when passed into an MD simulation. These bounds, inspired by work in the magnetic helicity community[2], give rise to interesting classifications of proteins for further study. By studying the writhe of subsections of the protein’s backbone, we are also able to highlight sites of interest such as highly flexible sections allowing large scale conformational changes or areas of maximal entanglement.<br></br><i>This is joint work with Chris Prior.</i></br></br>[1] Prior, C., Davies, O.R., Bruce, D. and Pohl, E. 2020 Obtaining tertiary protein structures by the ab initio interpretation of small angle X-ray scattering data. J. Chem. Theory and Computation 16, 1985–2001. </br>[2] Cantarella, J., DeTurck, D. and Gluck, H. 2001. Upper bounds for the writhing of knots and the helicity of vector fields. AMS IP Studies in Advanced Mathematics 24, 1–22.",
        "video": "https://www.youtube.com/embed/rtjaETwUCzA"
    },
    "83": {
        "speaker_id": 15,
        "eventId": "0",
        "date": "September, 2022",
        "date2": "20220901",
        "title": "Topological Chirality",
        "keywords": [
            "crystal defects",
            "chirality",
            "cholesterics"
        ],
        "abstract": "Cholesterics are a type of liquid crystal with a chiral structure, or intrinsic handedness, which imbues them with a great richness of textures. Recently, methods of contact geometry have been introduced to characterise the properties of cholesterics and understand their distinctive geometry and topology [1-4]. I will describe our work on defects in cholesterics, covering point defects [2], a peculiar form of topological soliton [2] and disclination lines [3]. Time permitting, I will also describe briefly our work on chiral active liquid crystals, their vortex lattice states and odd elasticity [5].</br></br><i>The first part is joint work with Joseph Pollard, Gregor Posnjak, Simon Čopar and Igor Muševič; the last part is joint work with SJ Kole, Sriram Ramaswamy and Ananyo Maitra.</i></br></br>[1] Machon, T. 2017 Contact topology and the structure and dynamics of cholesterics. New J. Phys. 19, 113030. doi: 10.1088/1367-2630/aa958d </br>[2] Pollard, J., Posnjak, G., Čopar, S., Muševič, I., and Alexander, G.P. 2019 Point Defects, Topological Chirality, and Singularity Theory in Cholesteric Liquid- Crystal Droplets. Phys. Rev. X 9, 021004. doi:10.1103/PhysRevX.9.021004 </br>[3] Pollard, J. 2020 The Topology and Geometry of Liquid Crystals. Ph.D. thesis, University of Warwick. http://wrap.warwick.ac.uk/158722 </br>[4] Eun, J., Pollard, J., Kim, S-J., Machon, T., and Jeong, J. 2021 Layering transitions and metastable structures of cholesteric liquid crystals in cylindrical confinement. Proc. Natl. Acad. Sci. U.S.A. 118, e2102926118. doi: 10.1073/pnas.2102926118 </br>[5] Kole, S.J., Alexander, G.P., Ramaswamy, S., and Maitra, A. 2021 Layered Chiral Active Matter: Beyond Odd Elasticity. Phys. Rev. Lett. 126, 248001. doi: 10.1103/PhysRevLett.126.248001",
        "video": "https://www.youtube.com/embed/YRjnGCv_lww"
    },
    "82": {
        "speaker_id": 82,
        "date": "January 13, 2023",
        "date2": "20230113",
        "title": "Measure Vectorization for Automatic Topologically-Oriented Learning with guarantees.",
        "keywords": [
            "topological data analysis",
            "persistence diagrams",
            "unsupervised learning",
            "clustering",
            "quantization of measures"
        ],
        "abstract": "Robust topological information commonly comes in the form of a set of persistence diagrams that can be seen as discrete measures and are uneasy to use in generic machine learning frameworks.</br></br>In this talk we will introduce a fast, learnt, unsupervised vectorization method, named ATOL, for measures in Euclidean spaces and use it for reflecting underlying changes in topological behaviour in machine learning contexts. The algorithm is simple and efficiently discriminates important space regions where meaningful differences to the mean measure arise. We will show that it is proven to be able to separate clusters of persistence diagrams. We will illustrate the strength and robustness of our approach on a few synthetic and real data sets. ",
        "season": "SPRING 2023",
        "video": "https://www.youtube.com/embed/dgwe2JwSf4Q"
    },
    "81": {
        "speaker_id": 81,
        "date": "December 16, 2022",
        "date2": "20221216",
        "title": "Mathematical Virology: Geometry in the Fight against Viral Infection",
        "keywords": [
            "Geometric and topological models of virus structure",
            "Virus (dis)assembly",
            "Viral Tiling theory",
            "Hamiltonian paths"
        ],
        "abstract": "The Covid-19 pandemic has highlighted the need for novel antiviral strategies. In this talk, I will demonstrate that insights into the geometric principles underpinning virus architecture provide a key to uncovering the mechanisms by which viruses replicate and infect their hosts. Geometric and topological descriptors of virus architecture, combined with stochastic simulations, reveal how viruses navigate the knife’s edge between stability and instability, guaranteeing protection for their genetic cargo while also enabling its timely release. Models of virus architecture also provide a novel perspective on open problems in virus assembly. This includes the origin and control of polymorphic particle assembly, which arises, amongst others, when virus-derived protein containers are functionalised to present antigens for applications in vaccinology. They moreover play an instrumental role in the discovery of genome- encoded virus assembly instructions. These results shed new light on selective pressures on viral evolution and pave the way for innovation in antiviral therapy and virus nanotechnology.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/IvBvycFgcT4",
        "slides": "https://drive.google.com/file/d/1s4UIR7Ij5VjsDyTe3QRisclP5tt-T17V/view?usp=share_link"
    },
    "80": {
        "speaker_id": 80,
        "date": "December 9, 2022",
        "date2": "20221209",
        "title": "Over-squashing and over-smoothing through the lenses of curvature and multi-particle dynamics",
        "keywords": [
            "graphs",
            "graph neural networks",
            "curvature",
            "gradient flows"
        ],
        "abstract": "I am going to talk about two problems that Message Passing Neural Networks (MPNNs) have been shown to be struggling from. The first one – known as over-squashing – is unavoidable in the MPNN class and concerns the input graph topology. This relates to how information propagates in a graph. We show that discrete curvature quantities (old and new) could help us understand where messages are being lost and we can provably characterize the over-squashing phenomenon in terms of curvature. The second problem consists in analysing GNNs as multi-particle dynamics using the lens of gradient flows of an energy. We investigate what happens when instead of learning the MPNN equations we learn an energy and then let the equations follow the gradient flow of such energy. This allows us to understand further the role of the channel-mixing matrix that is ubiquitous in standard graph convolutional models as a bilinear potential inducing both attraction and repulsion along edges via its positive and negative eigenvalues respectively.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/nlh9Funk7k8",
        "slides": "https://drive.google.com/file/d/1r213zKOS3FH-wSEuoG8C6_FwvM1UxJ4z/view?usp=share_link"
    },
    "79": {
        "speaker_id": 79,
        "date": "November 18, 2022",
        "date2": "20221118",
        "title": "Is turbulence knotted?",
        "keywords": [
            "Turbulence",
            "knots",
            "vortex lines",
            "superfluid",
            "Bose-Einstein condensation"
        ],
        "abstract": "Vortex lines and streamlines in turbulent flows, visualized in the experiments or in the numerics, appear chaotic, twisted, perhaps linked or knotted. The physical meaning of this complexity and its relation to the dynamics is still obscure. In this lecture I shall address this problem - the geometrical and topological complexity of turbulence - in the arguably simpler context of \"quantum fluids\". </br></br>Quantum fluids (superfluid helium, atomic Bose-Einstein condensates, etc) are studied in the laboratory at temperatures close to absolute zero. At these low temperatures the fundamental quantum properties of matter are not masked by thermal disorder. In particular, any rotational motion is constrained by quantum mechanics to individual vortex lines of fixed strength (phase defects of a complex order parameter), unlike what happens in ordinary fluids where vorticity is a continuous field. Quantum turbulence, created by stirring a quantum fluid, is thus conceptually simpler than ordinary turbulence, consisting of a tangle of individual vortex lines rather than a disordered continuous vorticity field. </br></br>After describing some surprising similarities between quantum turbulence and ordinary turbulence, I shall show how the geometry and the topology of quantum turbulence can be quantified in a relatively simple way, hence demonstrate that quantum turbulence is indeed knotted. Is ordinary turbulence knotted too? </br></br>References: <ul><li>Barenghi, C.F. and Parker, N.G. 2016 A primer on quantum fluids, Springer.</li> <li>Barenghi, C.F., Skrbek, L., and Sreenivasan, K.R. 2014 Introduction to quantum turbulence, Proc. Nat. Acad. Sci. (USA) 111 (Suppl. 1), 4647. </li> <li>Cooper, R.G., Mesgarnezhad, M., Baggaley, A.W., and Barenghi, C.F. 2019 Knot spectrum of turbulence, Sci. Reports9, 10545.</li> <li>Barenghi, C.F. 2022 Tangled vortex lines: dynamics, geometry and topology of quantum turbulence, arXiv:2207.04260v1, to appear in Knotted fields, ed. Ricca, R.L. and Liu, X., Springer.</li</ul>",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/YdypBga69TA"
    },
    "78": {
        "speaker_id": 78,
        "date": "November 4, 2022",
        "date2": "20221104",
        "title": "Knot theory and machine learning",
        "keywords": [
            "knot",
            "hyperbolic",
            "signature",
            "Heegaard Floer homology",
            "machine learning",
            "natural slope",
            "cusp geometry",
            "Dehn surgery",
            "4-ball genus"
        ],
        "abstract": "Knot theory is divided into several subfields. One of these is hyperbolic knot theory, which is focused on the hyperbolic structure that exists on many knot complements. Another branch of knot theory is concerned with invariants that have connections to 4-manifolds, for example the knot signature and Heegaard Floer homology. In my talk, I will describe a new relationship between these two fields that was discovered with the aid of machine learning. Specifically, we show that the knot signature can be estimated surprisingly accurately in terms of hyperbolic invariants. We introduce a new real-valued invariant called the natural slope of a hyperbolic knot in the 3-sphere, which is defined in terms of its cusp geometry. Our main result is that twice the knot signature and the natural slope differ by at most a constant times the hyperbolic volume divided by the cube of the injectivity radius. This theorem has applications to Dehn surgery and to 4-ball genus. We will also present a refined version of the inequality where the upper bound is a linear function of the volume, and the slope is corrected by terms corresponding to short geodesics that have odd linking number with the knot. My talk will outline the proofs of these results, as well as describing the role that machine learning played in their discovery. </br> This is joint work with Alex Davies, Andras Juhasz, and Nenad Tomasev.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/qmk2a5VPw94"
    },
    "77": {
        "speaker_id": 77,
        "date": "October 21, 2022",
        "date2": "20221021",
        "title": "Tracking cycles in neural codes",
        "keywords": [
            "cycles",
            "neural codes",
            "semantics",
            "cross-similarity"
        ],
        "abstract": "Circular coordinate systems -- here, cycles -- are ubiquitous in data encoded by the brain. Classical ideas from topology tell us that the structure of the encoded data must be reflected in the activity of the encoding neural populations, and methods from topological data analysis have been highly successful at detecting signatures of such encodings. The next natural question we might ask is how we assign meaning or semantics to observed cycles  Here, we describe a new method for using a measure of cross-similarity to register, or falsify the registration of, cycles across populations. We demonstrate its use in simulated and experimental data, and discuss ongoing work using these tools to investigate how feed-forward networks propagate cycles. This is joint work with Iris Yoon, Niko Schonsheck, and several others.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/SSLlKwKXzDQ",
        "slides": "https://drive.google.com/file/d/1zc1MGpjI5UJz1I0rI7F3UOKcVMnLZ5XE/view?usp=share_link"
    },
    "76": {
        "speaker_id": 76,
        "date": "October 14, 2022",
        "date2": "20221014",
        "title": "Topological Data Analysis for Biological Images and Video",
        "keywords": [
            "TDA",
            "biological images",
            "TDAExplore",
            "synthetic periodic videos"
        ],
        "abstract": "I will present the results of two projects applying topological data analysis (TDA) and machine learning (ML) to biological data. In the first, we have developed a new tool, TDAExplore, that combines TDA and ML to both classify biological images and to provide a visualization that is biologically informative. In the second, we use TDA and ML to classify quasi-periodic biological videos and we apply TDA to such a video to produce synthetic periodic videos.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/B0dc9_ly7dM"
    },
    "75": {
        "speaker_id": 75,
        "date": "September 30, 2022",
        "date2": "20220930",
        "title": "Knowledge and topology: a simplicial approach",
        "keywords": [
            "epistemic logic",
            "simplicial complexes",
            "distributed computing"
        ],
        "abstract": "Multi-agent Epistemic Logic is a modal logic of knowledge. It allows to reason about a finite set of agents who may know facts about the world, and about each other. In this talk, I will present a new semantics for epistemic logic, based on simplicial complexes. In this approach, the knowledge of the agents is modeled by a higher-dimensional space called a simplicial model; and the truth of an epistemic logic formula can be evaluated by inspecting the various possible paths in this space. I will illustrate these ideas using examples from the theory of distributed computing, where the agents correspond to individual processes who can exchange information in order to solve a task. Both topological invariants and logical invariants can be leveraged to prove that some distributed computing tasks are impossible to solve.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/55LOHU6aS_4",
        "warning": "The speaker's image obscures the presentation slightly."
    },
    "74": {
        "speaker_id": 74,
        "date": "September 23, 2022",
        "date2": "20220923",
        "title": "The Topology of Knowing (Or How to Avoid Unexpected Exams)",
        "keywords": [
            "epistemic logic",
            "belief",
            "knowability",
            "simplicity",
            "learnability",
            "Surprise Exam Paradox",
            "Cantor derivative",
            "perfect core"
        ],
        "abstract": "In this talk I will present applications of General Topology to Epistemic Logic (=the logical aspects of knowledge, knowabiity and belief) and Formal Learning Theory. I show that topological methods can throw light on issues such as the value of simplicity as a learning strategy (cf. Ockham's Razor) and the analysis of epistemic paradoxes (e.g. the connection between the so-called Surprise Exam Paradox and the Cantor-Bendixson process of calculating the perfect core). Time-permitting, I may present some complete and decidable logical axiomatizations of these notions and maybe even give a hint concerning the completeness proofs.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/Hmae60iqHCA"
    },
    "73": {
        "speaker_id": 73,
        "date": "September 9, 2022",
        "date2": "20220909",
        "title": "Compositional Modeling with Decorated Cospans",
        "keywords": [
            "Compositionality",
            "double category",
            "decorated cospan",
            "epidemiology"
        ],
        "abstract": "One goal of applied category theory is to understand open systems: that is, systems with a boundary of some sort, through which matter, energy or information can flow in or out.   We can describe a large class of open systems using the mathematics of decorated cospans, which we explain here.  In various examples these ideas have been implemented in software.  An interesting example comes from stock-flow diagrams, which are widely used in epidemiology to model the dynamics of populations. Although tools already exist for building these diagrams and simulating the systems they describe, we have created a new package called StockFlow which uses decorated cospans to overcome limitations of the existing tools.  This is joint work with Xiaoyan Li, Sophie Libkind, Nathaniel Osgood and Evan Patterson.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/DYsDvpBwOnc",
        "slides": "https://drive.google.com/file/d/1W-V8tDsZ1vs9NbUuQmgqZ52N4VsQyYSL/view?usp=sharing"
    },
    "72": {
        "speaker_id": 72,
        "date": "September 2, 2022",
        "date2": "20220902",
        "title": "Stable and interpretable topological feature maps",
        "keywords": [
            "Persistent homology",
            "stability",
            "Wasserstein distance",
            "feature maps"
        ],
        "abstract": "Persistent homology, a popular method in TDA, can be used to define feature maps encoding geometrical properties of data. In this talk I will present a method, developed by the TDA group at KTH, which allows to construct feature maps with learnable parameters, stable with respect to distances on persistence modules. The feature maps are in fact defined starting from distances between persistence modules rather than on the barcode decomposition, making the method suitable for generalisations. Particular focus will be on understanding parametrised families of such feature maps, such as those stable with respect to p-Wasserstein distance. The use of Wasserstein stable features will be illustrated on real world and artificial datasets.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/rJafTmw8fQE"
    },
    "71": {
        "speaker_id": 71,
        "date": "August 19, 2022",
        "date2": "20220819",
        "title": "Collapsing in directed topology",
        "keywords": [
            "collapsing pair",
            "directed topology",
            "cubical complexes",
            "Euclidean Cubical Complex"
        ],
        "abstract": "In a simplicial complex, a pair of simplices  are a collapsing pair, if one is a unique maximal coface of the other which is then a free face. Such a pair can be collapsed by removal of the two simplices and all simplices between them – think about an edge in a solid tetrahedron; collapsing means removing the edge, the interior of the tetrahedron and the interior of the two faces containing that edge. This leads to a homotopy equivalence. There is a similar notion for cubical complexes. A sequence of collapses leads to a simpler (fewer simplices/cubes) space.\nFor a directed space, which is a topological space with a selected set of paths, the directed paths, directed homotopy equivalence is a very strong requirement, and not what should be the basis of collapsing.\nWe study the following setting: A Euclidean Cubical Complex, an ECC, is a subset of R^n which is a union of elementary cubes. An elementary cube is a product of n intervals [ai,ai+e], where e is either 0 or 1. A directed path in an ECC is continuous and non-decreasing in all coordinates.\nWe define a notion of collapse with the aim of preserving various properties of spaces of directed paths.\nThis is joint work with the WiT, Women in Topology, group R. Belton, R. Brooks, S.Ebli, L.F., B.T.Fasy, N.Sanderson, E. Vidaurre.",
        "season": "FALL 2022",
        "video": "https://www.youtube.com/embed/hhrQaF0hwJo"
    },
    "70": {
        "speaker_id": 70,
        "date": "June 3, 2022",
        "date2": "20220603",
        "title": "From topological order to origin of elementary particles (from algebra to geometry)",
        "keywords": [
            "topological order",
            "long range entanglement",
            "origin of light"
        ],
        "abstract": "I will discuss the world of many-body long range entanglement. It turns out that both topological quantum matter and elementary particles arise from many-body long range entanglement.",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/3HhX-W2KGjg",
        "slides": "https://drive.google.com/file/d/1vQqmIf9UytknaHYjG3myzcQyZh6-JQhV/view?usp=sharing"
    },
    "69": {
        "speaker_id": 69,
        "date": "May 20, 2022",
        "date2": "20220520",
        "title": "Multi-parameter persistence from the viewpoint of discrete Morse theory",
        "keywords": [
            "Multi-parameter persistence",
            "discrete Morse theory",
            "multivariate data",
            "persistence modules",
            "critical cells",
            "multi-filtered data"
        ],
        "abstract": "Although there is no doubt that multi-parameter persistent homology is a useful tool for the topological analysis of multivariate data, a complete understanding of these modules is still lacking. Issues such as computation, visualization, and interpretation of the output remain difficult to solve. In this talk, I will show how discrete Morse theory may enhance our understanding of multi-parameter persistence by connecting the combinatorial properties of the critical cells of multi-filtered data to the algebraic properties of their persistence modules.",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/BP9csWxzGIY"
    },
    "68": {
        "speaker_id": 68,
        "date": "May 6, 2022",
        "date2": "20220506",
        "title": "Is Trivial Knot Really So Trivial?",
        "keywords": [
            "linear threads of polymer",
            "biopolymers",
            "polymer unknots",
            "topological glass"
        ],
        "abstract": "While topological ideas are widely popular in physics, topology of classical linear threads of polymers presents steep mathematical and conceptual challenges, with applications in both biopolymers and materials.  I will concentrate on the simplest case of polymer unknots and review what is known about fluctuations and statistical mechanics of such objects based mostly on simulations, experiments, and hand-waving theoretical arguments.  Continuing with increasingly sophisticated models and phenomena, I will review several more recent theoretical and experimental achievements, and conclude with the discussion of a controversial concept of ''topological glass''.",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/Pr1-0IRy1us"
    },
    "67": {
        "speaker_id": 67,
        "date": "April 22, 2022",
        "date2": "20220422",
        "title": "Universes as Bigdata:  Physics, Geometry and Machine-Learning",
        "keywords": [
            "IA and mathematics",
            "big data",
            "machine learning",
            "physics",
            "geometry"
        ],
        "abstract": "The search for the Theory of Everything has led to superstring theory, which then led physics, first to algebraic/differential geometry/topology, and then to computational geometry, and now to data science. With a concrete playground of the geometric landscape, accumulated by the collaboration of physicists, mathematicians and computer scientists over the last 4 decades, we show how the latest techniques in machine-learning can help explore problems of interest to theoretical physics and to pure mathematics. At the core of our programme is the question: how can AI help us with mathematics?",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/1InNxNP81Es"
    },
    "66": {
        "speaker_id": 66,
        "date": "April 1, 2022",
        "date2": "20220401",
        "title": "Dynamically relevant motifs in inhibition-dominated networks",
        "keywords": [
            "Motifs",
            "inhibitory threshold-linear networks (TLNs)",
            "neural circuits",
            "dynamic attractor",
            "Hopfield model",
            "directed graphs"
        ],
        "abstract": "Many networks in the brain possess an abundance of inhibition, which serves to shape and stabilize neural dynamics. The neurons in such networks exhibit intricate patterns of connectivity whose structure controls the allowed patterns of neural activity. In this work, we examine inhibitory threshold-linear networks (TLNs) whose dynamics are constrained by an underlying directed graph. We develop a set of parameter-independent graph rules that enable us to predict features of the dynamics, such as emergent sequences and dynamic attractors, from properties of the graph. These rules provide a direct link between the structure and function of inhibition-dominated networks, yielding new insights into how connectivity shapes dynamics in real neural circuits. Recently, we have used these ideas to classify dynamic attractors in a two-parameter family of TLNs spanning all 9608 directed graphs of size n=5. Remarkably, we find a striking modularity in the dynamic attractors, with identical or near-identical attractors arising in networks that are otherwise dynamically inequivalent. This suggests that, just as one can store multiple static patterns as stable fixed points in a Hopfield model, a variety of dynamic attractors can also be embedded in TLNs in a modular fashion.",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/ldLxhoDl4QA"
    },
    "65": {
        "speaker_id": 65,
        "date": "March 18, 2022",
        "date2": "20220318",
        "title": "A New Classification of Topological Defects",
        "keywords": [
            "smectic liquid crystals",
            "topological defects",
            "layered systems"
        ],
        "abstract": "Smectic liquid crystals are layered systems that abound in nature. I will introduce these materials and show how the long-lived, topologically protected excitations defy simple classification. I will describe our attempts.",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/GMnUFbFk7jo"
    },
    "64": {
        "speaker_id": 64,
        "date": "March 11, 2022",
        "date2": "20220311",
        "title": "Discrete Stratified Morse Theory",
        "keywords": [
            "discrete Morse Theory",
            "stratified"
        ],
        "abstract": "In this talk I will describe a discrete version of stratified Morse theory and give several examples of the utility of theory. This is joint work with Bei Wang.",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/Jw7p7QXQF0w"
    },
    "63": {
        "speaker_id": 63,
        "date": "February 18, 2022",
        "date2": "20220218",
        "title": "Coexistence holes in ecological systems",
        "keywords": [
            "algebraic topology",
            "hypergraphs",
            "ecology"
        ],
        "abstract": "<p>A central challenge of Ecology is to explain the enormous biodiversity of species that we find on Earth, from the diversity of plant and animal species that stably coexist in tropical forests to the variety of microbial species that coexist in our gut. Ecologists have focused on characterizing the \"limits\" of species coexistence ---that is, the maximum number of different species that can coexist under given constraints. Yet, little is known about the structure of species coexistence below such limits. Namely, is it possible to assemble an ecological system by adding one species at a time until reaching the coexistence limits? Or is it possible to find obstructions where species coexistence abruptly breaks before reaching the limits? To address these questions, we built a novel formalism based on hypergraphs and Algebraic Topology to show that, below its limits, species coexistence in ecological systems has ubiquitous obstructions that we call \"coexistence holes\". A coexistence hole occurs during an assembly process when a species collection does not coexist, although we can assemble it from sub-collections that coexist. Using theoretical and experimental ecological systems, we provide direct evidence showing that coexistence holes obey regularities. Namely, their diversity is constrained by the internal structure of species interactions, while their frequency can be explained by external factors acting on these systems. Overall, our work provides one of the first applications of Algebraic Topology to Ecology, unveiling how biodiversity is a discontinuous process driven by internal design constraints. </p><p>This is joint work with Aaron Kelley (IM-UNAM), Luis Montejano (IM-UNAM), Chuliang Song (McGill/Toronto University) and Serguei Saavedra (MIT).</br><p>References: </br>[1] Angulo, Marco Tulio, et al. \"Coexistence holes characterize the assembly and disassembly of multispecies systems.\" Nature Ecology & Evolution (2021): 1-11.</br>[2] Letten, A. D. (2021). \"Coexistence holes fill a gap in community assembly theory.\" Nature Ecology & Evolution, 1-2.</p>",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/uXWS6p8TW6A"
    },
    "62": {
        "speaker_id": 62,
        "date": "February 4, 2022",
        "date2": "20220204",
        "title": "Topological Analysis from Latent Semantic Analysis",
        "keywords": [
            "Persistent Homology",
            "Latent Semantic Analysis",
            "Natural Language Processing"
        ],
        "abstract": "Latent Semantic Analysis is one of the most widely used and accepted techniques in natural language processing. A better understanding of the topology of Latent Spaces could lead to better applications. We applied different topological techniques such as Ballmapper and persistent homology to the Latent Semantic representation of hundreds of thousands of abstracts and titles from the ArXiv database. We will present a comprehensible synthesis of our computations, comparing results between different time frames and ArXiv categories",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/nmIxPrsv32k",
        "warning": "Sound is not very clear"
    },
    "61": {
        "speaker_id": 61,
        "date": "January 21, 2022",
        "date2": "20220121",
        "title": "The Geometry of Fluid Dynamics",
        "keywords": [
            "fluids",
            "motion",
            "Poisson",
            "flows",
            "crystals",
            "momentum",
            "Eringen",
            "Clebsch",
            "helicity"
        ],
        "abstract": "Fluid motion has a remarkable geometric structure generated by Poisson structures on the Hamiltonian and variational structures on the Lagrangian side. I will briefly review the standard results for ideal incompressible homogeneous flows and then show how this is extended to fluids with advected quantities. A much more elaborate extension happens for the Eringen model of liquid crystals because these fluids have internal structure. Then I will introduce a momentum map with values in differential characters that captures topological information, something the classical momentum map cannot do. This has consequences in hydrodynamics, specifically for Clebsch variables, since it permits to deal with solutions whose helicity is integer valued.",
        "season": "SPRING 2022",
        "video": "https://www.youtube.com/embed/f4NUPgTeBIk",
        "slides": "https://drive.google.com/file/d/1skVTCT1K1gGcfUhTjbFRyxZl6e2f6OdQ/view?usp=sharing"
    },
    "60": {
        "speaker_id": 60,
        "date": "December 10, 2021",
        "date2": "20211210",
        "title": "Configurations spaces of particles: homological solid, liquid, and gas.",
        "keywords": [
            "configuration spaces",
            "particles",
            "phase transitions",
            "homological solid, liquid, and gas"
        ],
        "abstract": "Configuration spaces of points in the plane are well studied and the topology of such spaces is well understood. But what if you replace points by particles with some positive thickness, and put them in a container with boundaries? It seems like not much is known. To mathematicians, this is a natural generalization of the configuration space of points, perhaps interesting for its own sake. But is also important from the point of view of physics––physicists might call such a space the \"phase space\" or \"energy landscape\" for a hard-spheres system. Since hard-spheres systems are observed experimentally to undergo phase transitions (analogous to water changing into ice), it would be quite interesting to understand topological underpinnings of such transitions. <br/> We have just started to understand the homology of these configuration spaces, and based on our results so far we suggest working definitions of \"homological solid, liquid, and gas\". This is joint work with a number of collaborators, including Hannah Alpert, Ulrich Bauer, Robert MacPherson, and Kelly Spendlove.",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/dfW6cgDovqM"
    },
    "59": {
        "speaker_id": 59,
        "date": "December 3, 2021",
        "date2": "20211203",
        "title": "Inverse Problems for Persistent Homology",
        "keywords": [
            "persistent homology",
            "inverse problems"
        ],
        "abstract": "Persistent Homology (PH) is a widely used topological descriptor for data. In order to get a systematic understanding of the data science scenarios where PH is successful, it is crucial to know about its discriminative power, i.e. the ability to identify and disambiguate patterns in the data, or in other words it is crucial to know about the information loss and the invariances of PH. Formally these interrogations translate into the following inverse problem: Given an element in the image of PH, a so-called barcode D, what is the fiber (pre-image) of PH over D? There are several ways of defining PH: for point clouds in a metric space, for filter functions on a simplicial complex and for continuous functions on an arbitrary space, to name a few. Hence there are as many inverse problems to address. In this talk I will review the simplicial situation as well as that of Morse functions on a smooth manifold, with the aim of showing some geometrically surprising fibers and transmitting my interest for these intricate inverse problems. ",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/imzHXmC6iIs"
    },
    "58": {
        "speaker_id": 58,
        "date": "November 19, 2021",
        "date2": "20211119",
        "title": "Applied topology from the classical point of view",
        "keywords": [
            "categories",
            "homotopy theory",
            "topological invariants",
            "functors",
            "coarse category",
            "Vietoris-Rips homology",
            "sheaf theory",
            "Cech closure spaces"
        ],
        "abstract": "We generalize several basic notions in algebraic topology to categories which contain both topological spaces classically treated by classical homotopy theory as well as more discrete and combinatorial spaces of interest in applications, such as graphs and point clouds. The advantage of doing so is that there are now non-trivial 'continuous' maps from paracompact Hausdorff spaces to finite spaces (given the appropriate structure), and one may then compare the resulting topological invariants on each side functorially. We find that there are a number of possible such categories, each with its own particular homotopy theory and associated homologies, and, additionally, that there is a generalization of the coarse category which allows finite sets to be non-trivial (i.e. not 'coarsely' equivalent to a point). We will give an overview of these theories and several applications, show how they are related to familiar objects in applied topology, such as the Vietoris-Rips homology, and discuss the advantages and disadvantages of each. We finish by describing a recent construction of sheaf theory in the category of Cech closure spaces, a strict generalization of the category of topological spaces.",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/msbvjWMoy7U"
    },
    "57": {
        "speaker_id": 57,
        "date": "November 12, 2021",
        "date2": "20211112",
        "title": "Data, their relations and shape - topology in action",
        "keywords": [
            "applied topology",
            "persistence",
            "mapper",
            "applications"
        ],
        "abstract": "Topological data analysis is a rapidly developing area of mathematics with applications in data science. In addition to revealing the shape of data we develop tools for visualizing high dimensional scalar and vector valued functions. As an example, we explore relations between various knot invariants, and extrapolate how presented tools may help to compare various, high-dimensional descriptors of fixed datasets. In particular, we show how these ideas can be used to compare different mapper-type graphs of the same dataset. This is a joint work with Davide Gurnari, Anna Jurek, Simon Rudkin and Radmila Sazdanovic.",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/JkMn_YDFU20"
    },
    "56": {
        "speaker_id": 56,
        "date": "October 29, 2021",
        "date2": "20211029",
        "title": "Dynamics of viscous vortex knots and links",
        "keywords": [
            "vortex reconnection",
            "turbulence cascade",
            "helicity dynamics",
            "vortex knot",
            "vortex link"
        ],
        "abstract": "Reconnection is the process by which two approaching vortices cut and connect to each other. As a topologically changing event, it has been a subject of considerable fundamental interest for decades – not only in (classical) viscous flows but also in quantum fluids, as well as in numerous other fields, such as plasmas, polymers, DNAs, and so on. For viscous fluid flows, reconnection is believed to play a significant role in various important phenomena, such as turbulence cascade, fine-scale mixing, and aerodynamic noise generation. We first delineate the underlying mechanism involved in vortex reconnection and its apparent role in turbulence cascade. Then we address the helicity dynamics involved in viscous reconnection occurring in evolutions of a trefoil knotted vortex and a Hopf-link. For both cases, we find that the global helicity <i>H</i> gradually decreases before reconnection but sharply increases during reconnection – this effect increases with increasing vortex Reynolds number (<i>Re≡circulation/viscousity</i>). This suggests that <i>H</i> for viscous flows is not conserved as <i>Re→∞</i>. Both positive and negative helical structures are simultaneously generated before and during reconnection, and their different decay rates due to asymmetric reconnection appears to cause such an increase of <i>H</i> during reconnection. By examining the topological aspects of the helicity dynamics, we find that different from <i>H</i>, the sum of linking and writhing numbers (i.e., <i>Lk+Wr</i>) continuously drop during reconnection. Our results suggest that the twist, which increases with <i>Re</i>, plays a more important role in helicity dynamics than recognized before, particularly at high <i>Re</i>. <br/><br/> <b>Note:</b>  the video of this web-seminar combines the contributions by <a href=\"https://seminargeotop-a.com/previous-talks/55\">Fazle Hussain</a> (I part) and Jie Yao (II part).",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/VWHeNwYFHwY"
    },
    "55": {
        "speaker_id": 55,
        "date": "October 29, 2021",
        "date2": "20211029",
        "title": "Vortex reconnection and turbulence cascade",
        "keywords": [
            "vortex reconnection",
            "turbulence cascade",
            "helicity dynamics",
            "vortex knot",
            "vortex link"
        ],
        "abstract": "Reconnection is the process by which two approaching vortices cut and connect to each other. As a topologically changing event, it has been a subject of considerable fundamental interest for decades – not only in (classical) viscous flows but also in quantum fluids, as well as in numerous other fields, such as plasmas, polymers, DNAs, and so on. For viscous fluid flows, reconnection is believed to play a significant role in various important phenomena, such as turbulence cascade, fine-scale mixing, and aerodynamic noise generation. We first delineate the underlying mechanism involved in vortex reconnection and its apparent role in turbulence cascade. Then we address the helicity dynamics involved in viscous reconnection occurring in evolutions of a trefoil knotted vortex and a Hopf-link. For both cases, we find that the global helicity <i>H</i> gradually decreases before reconnection but sharply increases during reconnection – this effect increases with increasing vortex Reynolds number (<i>Re≡circulation/viscousity</i>). This suggests that <i>H</i> for viscous flows is not conserved as <i>Re→∞</i>. Both positive and negative helical structures are simultaneously generated before and during reconnection, and their different decay rates due to asymmetric reconnection appears to cause such an increase of <i>H</i> during reconnection. By examining the topological aspects of the helicity dynamics, we find that different from <i>H</i>, the sum of linking and writhing numbers (i.e., <i>Lk+Wr</i>) continuously drop during reconnection. Our results suggest that the twist, which increases with <i>Re</i>, plays a more important role in helicity dynamics than recognized before, particularly at high <i>Re</i>. <br/><br/> <b>Note:</b>  the video of this web-seminar combines the contributions by Fazle Hussain (I part) and <a href=\"https://seminargeotop-a.com/previous-talks/56\">Jie Yao</a> (II part).",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/VWHeNwYFHwY"
    },
    "54": {
        "speaker_id": 54,
        "date": "October 15, 2021",
        "date2": "20211015",
        "title": "The Wonderful World of Protein Structures",
        "keywords": [
            "Protein Structures",
            "Chirality"
        ],
        "abstract": "This talk will aim to present an overview of the three dimensional structures of proteins. These large and intricate molecules perform the vast majority of the biological functions of life and the structures of over 170,000 proteins have been determined and are stored in the Protein Databank. A detailed understanding of their structures has gradually emerged over the last 50 years. Chirality within protein structures is observed at all 'levels' of structure, starting with the basic stereochemistry of the polypeptide chain, through local chain folding, to the 'tertiary' structure of the whole chain and even to chirality of large complexes.",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/IQNMuJzcSBw"
    },
    "53": {
        "speaker_id": 53,
        "date": "October 1, 2021",
        "date2": "20211001",
        "title": "Cooperativity of looping- and supercoiling-mediated base-pair disruption among distant sites modulates the 3-D structure of DNA to control its activity",
        "keywords": [
            "DNA topology",
            "DNA structure/function",
            "linking number",
            "supercoiling",
            "DNA looping",
            "nanotechnology",
            "nanoparticle",
            "DNA minicircle"
        ],
        "abstract": "<p>Jonathan M. Fogg and Lynn Zechiedrich - Baylor College of Medicine</p><p>DNA in cells is supercoiled and constrained into loops. Despite the ubiquity and importance of supercoiling in regulating nearly every aspect of DNA activity, relatively little is known about how. To determine how supercoiling influenced DNA shape, we determined the 3-D structures of individual 336 bp DNA minicircles over a wide range of supercoiling from s = -0.019 to +0.085 (Irobalieva et al. 2015). Supercoiled DNA forms far more bent and contorted shapes than predicted. We sought to understand how DNA formed these shapes using coarse-grained molecular dynamics simulations (Wang et al. 2017), which predicted that site-specific disruptions to base pairing may explain otherwise energetically unfavorable sharp DNA bends. Likewise, bending strain at the apices of highly writhed DNA circles leads to broken base pairs. Probing for and mapping where base-pair disruptions occur, we discovered that negative supercoiling transmits mechanical stress along the DNA backbone to disrupt base pairing at specific distant sites (Fogg et al. 2021). This unprecedented base-pair disruption cooperativity among distant sites localizes certain sequences to superhelical apices to facilitate DNA writhing and relieve torsional strain, likely preventing more extensive denaturation that can cause genomic instability. We also discovered how cells may exploit DNA looping to position DNA nicks to facilitate repair. Our data explain how DNA can form short loops through base-pair disruption and reveal a complex interplay between looping- and supercoiling-mediated site-specific disruptions to base pairing and the 3-D conformation of DNA, which influence how genomes are stored, replicated, transcribed, repaired, and likely other aspects of DNA activity. We hope to harness these looping- and supercoiling-mediated site-specific denaturation and mechanical correlations to design novel DNA shapes for nanotechnology.</p><p>Irobalieva, R.N.*, Fogg, J.M.*, Catanese, D.J., Sutthibutpong, T., Chen, M., Barker, A.K., Ludtke, S.J., Harris, S.A., Schmid, M.F., Chiu, W., and Zechiedrich, L. (2015) Structural diversity of supercoiled DNA. Nature Comm. Oct 12;6:8440 PMC4608029 (*equal contribution)</p><p>Wang, Q., Irobalieva, R. N., Chiu, W., Schmid, M. F., Fogg, J. M., Zechiedrich, L., and Pettitt, B.M. (2017) DNA sequence determines conformational distribution of minicircles under torsional stress. Nucleic Acids Res. 45, 7633–7642 PMC5737869</p> <p>Fogg, J.M., Judge, A.K., Stricker, E., Chan, H.L., and Zechiedrich, L. Supercoiling and looping promote DNA base accessibility and coordination among distant sites. Nature Comm. in press.</p>",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/-_QNMOnIf6c"
    },
    "52": {
        "speaker_id": 52,
        "date": "September 17, 2021",
        "date2": "20210917",
        "title": "Getting interlocked circular chains through the needle’s eye",
        "keywords": [
            "topological links",
            "translocation",
            "molecular dynamics"
        ],
        "abstract": "<p>The process of driven translocation of polymer chains through a narrow pore can be severely hindered by the presence of self and mutual entanglement. In circular chains this entanglement is trapped in the form of knots and links that may act as potential obstruction at the pore affecting the translocation dynamics. Here we present theoretical results mainly based on extensive Langevin simulations on the driven translocation dynamics of topologically linked rings. We highlight the role of link complexity, pore size and driving force field  on the translocation process and suggest how to extend nanopore sensing techniques to probe the topological properties of these systems and, for instance, to distinguish knotted from linked states and two component to multicomponent links.</p>",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/tJAW9ihBgIg"
    },
    "51": {
        "speaker_id": 51,
        "date": "September 3, 2021",
        "date2": "20210903",
        "title": "Persistent Laplacian: properties and algorithms",
        "keywords": [
            "persistence",
            "spectral graph theory",
            "effective resistence",
            "combinatorial Laplacian"
        ],
        "abstract": "<p>The combinatorial graph Laplacian, as an operator on functions defined on the vertex set of a graph, is a fundamental object in the analysis of and optimization on graphs. There is also an algebraic topology view of the graph Laplacian which arises through considering boundary operators and specific inner products defined on simplicial (co)chain groups. This permits extending the graph Laplacian to a more general operator, the q-th combinatorial Laplacian to a given simplicial complex. An extension of this combinatorial Laplacian to the setting of pairs (or more generally, a sequence of) simplicial complexes was recently introduced by (R.) Wang, Nguyen and Wei. In this talk, I will present serveral results (including a persistent version of the Cheeger inequality) from our recent study of the theoretical properties for the persistence Laplacian, as well as efficient algorithms to compute it. This is joint work with Facundo Memoli and Zhengchao Wan. </p>",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/8ypbCdnXhrI"
    },
    "50": {
        "speaker_id": 50,
        "date": "August 20, 2021",
        "date2": "20210820",
        "title": "Sheaf-Theoretic Stratification Learning From Geometric and Topological Perspectives",
        "keywords": [
            "topological data analysis (TDA)",
            "sheaf",
            "stratification learning"
        ],
        "abstract": "<p>We investigate a sheaf-theoretic interpretation of stratification learning from geometric and topological perspectives. Our main result is the construction of stratification learning algorithms framed in terms of a sheaf on a partially ordered set with the Alexandroff topology. We prove that the resulting decomposition is the unique minimal stratification for which the strata are homogeneous and the given sheaf is constructible. In particular, when we choose to work with the local homology sheaf, our algorithm gives an alternative to the local homology transfer algorithm given in Bendich et al. (2012), and the cohomology stratification algorithm given in Nanda (2020). Additionally, we give examples of stratifications based on the geometric techniques of Breiding et al. (2018), illustrating how the sheaf-theoretic approach can be used to study stratifications from both topological and geometric perspectives. This approach also points toward future applications of sheaf theory in the study of topological data analysis by illustrating the utility of the language of sheaf theory generalizing existing algorithms. This is joint work with Adam Brown (<a href=https://doi.org/10.1007/s00454-020-00206-y>click here</a>).</p>",
        "season": "FALL 2021",
        "video": "https://www.youtube.com/embed/kBb5oXE3CDQ"
    },
    "49": {
        "speaker_id": 49,
        "date": "May 21, 2021",
        "video": "https://www.youtube.com/embed/f7Z5KII-rkM",
        "title": "Mathematics of Genome Packing and Regulation",
        "keywords": [
            "3D genome organization",
            "Euclidean distance geometry",
            "autoencoders",
            "over-parameterization"
        ],
        "abstract": "Recent evidence suggests that the spatial organization of the genome represents an important epigenetic regulator of expression, and alterations thereof are associated with various diseases. In this talk, I will analyze the link between the 3D genome organization and gene expression using geometric packing models and autoencoders/deep learning. In particular, I will first discuss the Euclidean distance geometry problem arising when studying the 3D genome organization and show that higher-order contacts are needed for its reconstruction. I will then discuss how autoencoders can be used to translate between DNA packing images and gene expression at the single-cell level as well as between different cell types. Given the empirical benefits of over-parameterization in autoencoders for these applications, I will end with a theoretical analysis of autoencoders linking over-parameterization to attractor properties. Understanding the geometry of these basins of attraction remains an important open problem. ",
        "season": "SPRING 2021",
        "date2": "20210521"
    },
    "0": {
        "speaker_id": 0,
        "date": "August 17, 2018",
        "video": "https://www.youtube.com/embed/574upkq0wDE",
        "title": "DNA Topology",
        "keywords": [
            "DNA",
            "topoisomerase",
            "site-specific recombination",
            "knots",
            "links",
            "tangle model",
            "supercoiling",
            "viral capsids"
        ],
        "abstract": "<p><br>Cellular DNA is a long, thread-like molecule with remarkably complex topology. Enzymes that manipulate the geometry and topology of cellular DNA perform many vital cellular processes (including segregation of daughter chromosomes, gene regulation, DNA repair, and generation of antibody diversity). Some enzymes pass DNA through itself via enzyme-bridged transient breaks in the DNA; other enzymes break the DNA apart and reconnect it to different ends. In the topological approach to enzymology, circular DNA is incubated with an enzyme, producing an enzyme signature in the form of DNA knots and links. By observing the changes in DNA geometry (supercoiling) and topology (knotting and linking) due to enzyme action, the enzyme binding and mechanism can often be characterized. This talk will discuss topological models for DNA strand passage and exchange, including the analysis of site-specific recombination experiments on circular DNA and the analysis of packing geometry of DNA in viral capsids. </p>",
        "season": "FALL 2018",
        "date2": "20180817"
    },
    "1": {
        "speaker_id": 1,
        "date": "September 7, 2018",
        "video": "https://www.youtube.com/embed/Yd83jnhnCS4",
        "title": "A brief introduction to Discrete Exterior Calculus",
        "keywords": [
            "differential forms",
            "Hodge star operator",
            "simplicial complex",
            "boundary operator",
            "discrete exterior calculus"
        ],
        "abstract": "<p><br>Discrete Exterior Calculus (DEC) is a relatively new method for solving partial differential equations numerically. The central idea of the method is to develop a discrete version of Exterior Differential Calculus. In this talk, we will briefly review the various operators of Exterior Differential Calculus and their discrete versions. We will then focus our attention in 2D DEC, presenting a geometric interpretation of DEC as well as numerical comparisons with the Finite Element Method in order to show DEC’s competitive performance. </p>",
        "season": "FALL 2018",
        "date2": "20180907"
    },
    "2": {
        "speaker_id": 2,
        "date": "September 21, 2018",
        "video": "https://www.youtube.com/embed/uPDxjaNSMcw",
        "title": "Knotted DNA: conformational, dynamical and pore-translocation properties",
        "keywords": [
            "pore translocation",
            "DNA knots",
            "DNA supercoiling",
            "DNA"
        ],
        "abstract": "<p><br>Knots and supercoiling are both introduced in bacterial plasmids by catalytic processes involving DNA strand passages. I will report on a recent study where we used molecular dynamics simulations and a mesoscopic DNA model, to study the simultaneous presence of knots and supercoiling in DNA rings and the kinetic and metric implications which may be relevant for the simplyfing action of topoisomerases. Finally, I will discuss how the same modelling and simulation approach can be used shed light on the complex experimental phenomenology of knotted DNA translocating through solid state nanopores.</p>",
        "season": "FALL 2018",
        "date2": "20180921"
    },
    "3": {
        "speaker_id": 3,
        "date": "October 19, 2018",
        "video": "https://www.youtube.com/embed/QD4-qm2-vTA",
        "title": "Discrete Morse Theory",
        "keywords": [
            "discrete Morse theory",
            "persistent homology",
            "cellular sheaf theory",
            "flow category"
        ],
        "abstract": "<p><br>Large-scale homology computations are rendered tractable in practice by a combinatorial version of Morse theory. Assuming that my internet connection survives, in this talk I will introduce discrete Morse theory, describe how it helps with computing various types of homology, and outline a powerful new higher-categorical extension. The audience will not require prior knowledge of any of the technical terms mentioned above.</p>",
        "season": "FALL 2018",
        "date2": "20181019"
    },
    "4": {
        "speaker_id": 4,
        "date": "November 9, 2018",
        "video": "https://www.youtube.com/embed/JZUe54BwRGI",
        "title": "Simplicial complexity: piecewise linear motion planning in robotics.",
        "keywords": [
            "topological complexity",
            "simplicial topology",
            "simplicial aproximation",
            "contiguity of maps"
        ],
        "abstract": "<p><br> Using the notion of contiguity of simplicial maps, and its relation (via iterated subdivisions) to the notion of homotopy between continuous maps, we adapt Farber's topological complexity to the realm of simplicial complexes. We show that, for a finite simplicial complex K, our discretized concept recovers the topological complexity of the realization of K.</p>",
        "season": "FALL 2018",
        "date2": "20181109"
    },
    "5": {
        "speaker_id": 5,
        "date": "November 23, 2018",
        "video": "https://www.youtube.com/embed/IYmEPzD4YQg",
        "title": "Geometric devils in topological dynamics.",
        "keywords": [
            "inflexion",
            "singularity",
            "self-linking",
            "twist",
            "knots",
            "braids",
            "topological change",
            "Möbius band",
            "2-sided disk"
        ],
        "abstract": "<p>Geometric and topological features play an important role in many physical systems, especially in fluid dynamics where forces drive continuous deformation. The benign influence of geometry, which is the muscular actor in topological dynamics, has sometimes a more devilish nature. Here we show how two different types of singularities that may emerge during the evolution of magnetic fields and soap films are responsible for the spontaneous reorganization and energy change of these systems.</p> <p>A first example is given by the inflexional instability of magnetic knots that under conservation of self-linking number brings inflexional magnetic knots to inflexion-free braids through an integrable singularity of torsion. A second example is given by the continuous deformation of a soap film Möbius band to a 2-sided disk by a drastic change of the soap film topology through a twisted fold catastrophe. These are examples of generic behaviors that trigger energy relaxation in a wide variety of different physical contexts. </p> <p>[1] Moffatt, H.K. & Ricca, R.L. (1992) Helicity and the Călugăreanu invariant. <i>Proc. R. Soc. A</i> <b>439</b>, 411-429. <br> [2] Ricca, R.L. (2005) Inflexional disequilibrium of magnetic flux tubes. <i>FluidDyn. Res.</i> <b>36</b>, 319-332. <br> [3] Goldstein, R.E., Moffatt, H.K., Pesci, A.I. & Ricca, R.L. (2010) A soapfilm Möbius strip changes topology with a twist singularity. <i>Proc.Natnl. Acad. Sci. USA</i> <b>107</b>, 21979-21984.</p>",
        "season": "FALL 2018",
        "date2": "20181123"
    },
    "6": {
        "speaker_id": 6,
        "date": "November 30, 2018",
        "video": "https://www.youtube.com/embed/rHjsntnze9U",
        "title": "A very elementary introduction to the combinatorial topology approach to distributed computing.",
        "keywords": [
            "distributed computing",
            "combinatorial topology"
        ],
        "abstract": "<p>An introductory lecture following the approach of the book by Herlihy, Kozlov, Rajsbaum Distributed Computing through Combinatorial Topology, Elsevier-Morgan Kaufmann, based on the notions of indistinguishability and perspectives. Illustrating the use of simplicial complexes via simple examples. No preliminary knowledge either about topology or about distributed computing. </p>",
        "season": "FALL 2018",
        "date2": "20181130"
    },
    "7": {
        "speaker_id": 7,
        "date": "October 7, 2018",
        "video": "https://www.youtube.com/embed/wHyGoKGy_7A",
        "title": "Polarization geometry of crystals and the blue sky.",
        "keywords": [
            "polarization",
            "optical axis",
            "multiple scattering",
            "birefringence"
        ],
        "abstract": "<p>The world would look very different to us if, like many insects and other animals, our eyes could see the polarization of light. In particular, we would see a distinctive “fingerprint” pattern in the blue sky overhead, as well as many crystalline materials that surround us. In this talk I will describe the geometry of optical polarization patterns from Maxwell’s equations, and in doing so reveal the deep and surprising relationship between the polarization pattern of birefringent crystals and the blue sky, based on a geometric and topological understanding of the tensors involved in the propagation and scattering of light. </p>",
        "season": "FALL 2018",
        "date2": "20181007"
    },
    "8": {
        "speaker_id": 8,
        "date": "January 25, 2019",
        "video": "https://www.youtube.com/embed/zY6mTpkG9FQ",
        "title": "Unitary Braiding and Topological Quantum Computing.",
        "keywords": [
            "quantum computation",
            "Hilbert space",
            "complex space",
            "state vector",
            "unitary transformation",
            "measurement",
            "quantum Hall effect",
            "Fibonacci model",
            "Majorana Fermion",
            "Artin braid group",
            "unitary braiding",
            "Clifford algebra"
        ],
        "slides": "https://www.dropbox.com/sh/fhonhrtm62f1ge5/AAAVfhjvxnUinMlRekrAghTwa?dl=0",
        "abstract": "<p>Quantum computation can be regarded as a methodical study of the structure preparation, evolution, and measurement of quantum systems in a computational framework. In a quantum system, a physical state corresponds to a unit length vector in a complex space (Hilbert space or finite dimensional complex space depending on the problem). A physical process corresponds to the application of a unitary transformation to a state. A measurement of a state projects that state to one of a number of orthogonal possibilities represented by an orthonormal basis for the complex space. The probability of a measurement is the absolute square of its coefficient in the state vector. A quantum computer consists in a unitary transformation and the capability to prepare states, apply the unitary transformation and measure the results. The statistics of repeated measurement gives the information for the computation. Thus the key to quantum computing is the design of unitary transformations that can accomplish a particular task. There are a number of designs that are very interesting such as Shor’s method of factoring integers on a quantum computer. The design of actual quantum computers is very difficult because it is hard to control measurement and keep the system from decohering in its interaction with the environment. It is thought that topological physical situations, such as the behaviour of anyons in the quantum Hall effect or the behaviour of Majorana Fermions in nano wires, may hold the key to the desired fault tolerant computation. In both of these instances one can formulate the unitary transformations in terms of representations of the Artin Braid group that are related to the physics of the situation. It is thought that such topological phases of physical systems will be resistant to perturbation and will make scalable quantum computing possible. It is the purpose of this talk to describe braiding related to both the quantum Hall effect (the Fibonacci model) and unitary braiding related to Majorana Fermions (braiding from Clifford algebras). The talk will be self-contained and as pictorial as possible. </p>",
        "season": "SPRING 2019",
        "date2": "20190125"
    },
    "9": {
        "speaker_id": 9,
        "date": "February 8, 2019",
        "video": "https://www.youtube.com/embed/twSF7f5sDck",
        "title": "Learning Algebraic Varieties from Samples.",
        "keywords": [
            "persistent homology",
            "dimension estimates",
            "learning varieties",
            "varieties"
        ],
        "abstract": "<p>I will discuss how to determine vanishing polynomials on a fixed finite sample of points and what to do with that information. For example, from the equations defining a variety one can learn the degree and the dimension of the variety. One can also construct ellipsoid complexes which, based on the experiments, strengthen the topological signal for persistent homology. All the algorithms needed are made available in a Julia package. </p>",
        "season": "SPRING 2019",
        "date2": "20190208"
    },
    "10": {
        "speaker_id": 10,
        "date": "February 22, 2019",
        "video": "https://www.youtube.com/embed/Z9hEu2H5aUY",
        "title": "Discrete Morse theory in action.",
        "keywords": [
            "discrete Morse theory",
            "feature tracking",
            "topological complexity",
            "robot motion planners"
        ],
        "abstract": "<p> In this talk, the basics of discrete Morse theory will first be shortly summarized. We will then describe two generalizations which both have applications to mathematical models associated with motion. Parametric discrete Morse theory can be applied to tracking the motion of features in a sequence of images or scenes, and fiberwise discrete Morse theory to robot motion planning. </p>",
        "season": "SPRING 2019",
        "date2": "20190222"
    },
    "11": {
        "speaker_id": 11,
        "date": "March 8, 2019",
        "video": "https://www.youtube.com/embed/jdI4PZ_McY0",
        "title": "Why are there knots in proteins?",
        "keywords": [
            "protein structure",
            "protein stability",
            "knotted proteins",
            "methyltransferase",
            "ubiquitin c-terminal hydrolase",
            "knot-promoting loops",
            "UCH-L1",
            "YibK",
            "YbeA",
            "knots"
        ],
        "abstract": "<p> There are now more than 1700 protein chains that are known to contain some type of topological knot in their polypeptide chains in the protein structure databank. Although this number is small relative to the total number of protein structures solved, it is remarkably high given the fact that for decades it was thought impossible for a protein chain to fold and thread in such a way as to create a knotted structure. There are four different types of knotted protein structures that contain 31, 41, 52 and 61 knots and over the past 15 years there has been an increasing number of experimental and computational studies on these systems. The folding pathways of knotted proteins have been studied in some detail, however, the focus of this talk is to address the fundamental question “Why are there knots in proteins?” It is known that once formed, knotted protein structures tend to be conserved by nature. This, in addition to the fact that, at least for some deeply knotted proteins, their folding rates are slow compared with many unknotted proteins, has led to the hypothesis that there are some properties of knotted proteins that are different from unknotted ones, and that this had resulted in some evolutionary advantage over faster folding unknotted structures. In this talk, I will review the evidence for and against this theory. In particular, how a knot within a protein chain may affect the thermodynamic, kinetic, mechanical and cellular (resistance to degradation) stability of the protein will be discussed. </p>",
        "season": "SPRING 2019",
        "date2": "20190308"
    },
    "12": {
        "speaker_id": 12,
        "date": "March 29, 2019",
        "video": "https://www.youtube.com/embed/zs8zmeWzC4M",
        "title": "Local solutions for global problems in wireless networks",
        "keywords": [
            "routing",
            "algorithms",
            "network",
            "nodes",
            "wireless networks"
        ],
        "abstract": "<p> In this paper we study on-line local routing algorithms for plane geometric networks. Our algorithms take advantage of the geometric properties of planar to route messages using only local information available at the nodes of a network. We pay special attention to on-line local routing algorithms which guarantee that a message reaches its destination. A message consists of data that have to be sent to a destination node, i.e. the message itself plus a finite amount of space that keeps only a constant amount of data to aid a message to reach its destination, e.g. the address of the starting and destination nodes, a constant number of nodes visited, etc. Local means that at each site we have at our disposal only local information regarding a node and its neighbors, i.e. no global knowledge of the network is available at any time, other that the network is planar and connected. We then develop location aided local routing algorithms for wireless communication networks, in particularly cellular telephone networks. </p>",
        "warning": "Sound is not very clear.",
        "season": "SPRING 2019",
        "date2": "20190329"
    },
    "13": {
        "speaker_id": 13,
        "date": "April 12, 2019",
        "video": "https://www.youtube.com/embed/Etijnx5B3_U",
        "title": "Mysteries of entanglement – proteins, life and physics. Biological role of knotting.",
        "keywords": [
            "proteins",
            "knots",
            "lassos",
            "links",
            "theta curves",
            "entanglement",
            "biology"
        ],
        "abstract": "<p> Knotted proteins are believed to be functionally advantageous and to provide extra stability to protein chains [1]. Twenty years of their investigation suggests that they fold via a slipknot conformation, across the native twisted loop. During the talk I will show that diversity of identified folds of knotted proteins and their locations in cells is still growing and surprising us. <br> Moreover recently we went one step further and found that proteins can be even more entangled than knots – they also form lassos and links, which consist of several components. Based on the search through the entire Protein Data Bank we identified several sequentially nonhomologous chains that form a Hopf link, a Solomon link [2], and various types of lassos. I will show that topological properties of these proteins are related to their function and stability. Finally I will explain how the presence of links affects folding pathways of proteins and present new reaction coordinate to study entangled proteins. <br> During my talk I will also present knotted TrmD which is the leading antimicrobial drug target owing to its essen­tiality for bacterial growth, its broad conservation across bacterial species, and its substantial differences from the human and archaeal counterpart Trm5. I will also present our achievements in designing selective inhibitor for TrmD, based on combining theoretical and experimental methods [3]. <br> All entangled proteins – 7% of proteins deposited in the PDB – are collected in databases: KnotProt, LassoProt and LinkProt. </p> <p> [1] JI Sulkowska, E Rawdon, KC Millett, J Onuchic, A Stasiak, PNAS (2012) 109: E1715-23 <br> [2] P Dabrowski-Tumanski, JI Sulkowska, PNAS (2017) 114, 3415–3420 <br> [3] T Christian, et al., Nature S&MB (2016) 23, 941-948 </p>",
        "season": "SPRING 2019",
        "date2": "20190412"
    },
    "14": {
        "speaker_id": 14,
        "date": "May 10, 2019",
        "video": "https://www.youtube.com/embed/fdwtH7b6euI",
        "title": "Directed topological complexity.",
        "keywords": [
            "directed algebraic topology",
            "topological complexity",
            "directed invariants",
            "homotopy theory",
            "differential inclusions",
            "control theory"
        ],
        "abstract": "<p> I will introduce in this talk a variant of topological complexity, that can be applied to help classify directed spaces, and has applications to the study of dynamical systems in the large, such as differential inclusions. Directed topological complexity looks for specific partitions {F1,…,Fn,…} of the set of reachable states of some directed space X, such that there is a continuous section from each of the Fi to the space of directed paths which is right inverse to the end points map. As in the classical case, this sheds an interesting light on a number of directed invariants, and we discuss in particular dicontractibility. We will also show some examples of calculations on directed graphs, non-positively curved cubical complexes, and directed spheres.</p> <p> This ongoing work with Aurélien Sagnier and Michael Farber. </p>",
        "season": "SPRING 2019",
        "date2": "20190510"
    },
    "15": {
        "speaker_id": 15,
        "date": "May 24, 2019",
        "video": "https://www.youtube.com/embed/NKNkequdrVs",
        "title": "Geometric Topology of Liquid Crystal Textures.",
        "keywords": [
            "crystal",
            "textures",
            "cholesteric",
            "chirality",
            "distortions",
            "nematic"
        ],
        "abstract": "<p> The textures and phases of liquid crystals are replete with geometric motifs, and the geometric approach to elasticity underpins a large portion of nonlinear theories. Despite this, the basic characterisation of topology comes from the homotopy theory without particular attention to geometric features. I will describe our recent work developing geometric approaches to liquid crystal topology, describing cholesteric point defects and topological chirality, and the geometric features of bend distortions, illustrated by applications to the twist-bend nematic phase.</p>",
        "season": "SPRING 2019",
        "date2": "20190524"
    },
    "16": {
        "speaker_id": 16,
        "date": "August 23, 2019",
        "video": "https://www.youtube.com/embed/1QpL_26cL7I",
        "title": "Some New Geometric Methods to Distinguish Shapes and Applications in Biology",
        "keywords": [
            "shape",
            "metric",
            "space",
            "genus-zero",
            "surfaces",
            "biology"
        ],
        "abstract": "<p> Almost everything we encounter in our 3-dimensional world is a surface - the outside of a solid object. Comparing the shapes of surfaces is, not surprisingly, a fundamental problem in both theoretical and applied mathematics. Deep mathematical results are now being used to study objects such as bones, brain cortices, proteins and biomolecules. This talk will discuss joint work with Patrice Koehl that introduces a new metric on the space of genus-zero surfaces and applies it in this context.</p>",
        "season": "FALL 2019",
        "date2": "20190823"
    },
    "17": {
        "speaker_id": 17,
        "date": "September 6, 2019",
        "video": "https://www.youtube.com/embed/aJTR5l1EIwE",
        "title": "Topological Dimensionality Reduction.",
        "keywords": [
            "Dimensionality reduction",
            "topological data analysis (TDA)",
            "persistent homology",
            "Eilenberg-MacLane coordinates"
        ],
        "abstract": "<p> When dealing with complex high-dimensional data sets, several machine learning tasks rely on having appropriate low-dimensional representations. These reductions are often phrased in terms of preserving statistical or metric information and may fail to recover important topological features. We will describe in this talk several schemes to take advantage of the underlying topology of a data set, in order to produce informative low-dimensional coordinates. </p>",
        "season": "FALL 2019",
        "date2": "20190906"
    },
    "18": {
        "speaker_id": "18",
        "date": "October 4, 2019",
        "video": "https://www.youtube.com/embed/Npyw75dWY2Y",
        "title": "Random entanglements: Winding of planar Brownian motions",
        "keywords": [
            "planar Brownian motion",
            "entanglement",
            "winding number"
        ],
        "abstract": "<p> There exists a wide class of winding problems, where one or more planar Brownian motions get entangled around each other and obstacles in the plane. These can be seen as models of entanglement of long molecules, or as a general framework for understanding dynamical topological complexity. I will review some classical results, such as Spitzer's law, which gives the angular distribution for a planar Brownian motion around the origin. I will discuss a recent variation (with Huanyu Wen) where we add a drift that promotes entanglement. Finally, I will present ongoing work (with Gage Bonner and Benedek Valko) on the much more challenging problem of winding around several obstacles. In some limits, this can be reduced to computing the escape rate for a random walk on a so-called regular languages. </p>",
        "season": "FALL 2019",
        "date2": "20191004"
    },
    "19": {
        "speaker_id": 19,
        "date": "October 18, 2019",
        "video": "https://www.youtube.com/embed/OfTTZpaOq8M",
        "title": "Topological modeling of DNA recombination",
        "keywords": [
            "DNA knots",
            "reconnection",
            "link nomenclature",
            "DNA topology",
            "DNA"
        ],
        "abstract": "<p> DNA replication in bacteria yields two interlinked circular chromosomes. Returning the chromosomes to an unlinked monomeric state is essential to cell survival. Simplification of DNA topology is mediated by enzymes, such as recombinases and topoisomerases. We here focus on site-specific recombinases that recognize two short segments of DNA (the recombination sites), introduce two double stranded breaks and recombine the ends. The local action of site-specific recombinases is a reconnection event which is modeled mathematically as a band surgery. The banding is coherent or non-coherent, depending on the relative orientation of the recombination sites. We use tools from low dimensional topology to investigate the mechanism of action of these enzymes, and we complement the analytical work with computer simulations. The numerical work provides a quantitative measure to distinguish among pathways of topology simplification by recombination, and also informs the search for bandings between specific pairs of link types. </p>",
        "season": "FALL 2019",
        "date2": "20191018"
    },
    "20": {
        "speaker_id": 20,
        "date": "November 8, 2019",
        "video": "https://www.youtube.com/embed/_kDIFc2Y94U",
        "title": "Modeling topological polymers with Gaussian random graph embeddings.",
        "keywords": [
            "topological polymers",
            "network polymers",
            "random polygons",
            "random graph embeddings",
            "Kirchhoff index",
            "biopolymers"
        ],
        "abstract": "<p> Very recently, chemists have succeeding in synthesizing purified samples of polymers which are more topologically complicated than the linear or ring polymers which have previously been created. The new polymers have different graph types, including theta-curves, multithetas, K_{3,3}, and K_4, with new types arriving at a rapid rate. In this talk, we develop a theory of Gaussian random graph embeddings in order to model the shapes of these polymers in solution. The theory allows us to connect the expected radius of gyration of the polymers with the Kirchhoff index of the graph. We will prove a theorem that describes the asymptotic behavior of the expected radius of gyration for large graphs of fixed topology in terms of the degree-Kirchhoff index of the graph. Last, we show that our theory provides a good fit to data from the Tezuka lab's experimental measurements of the relative sizes of topological polymers with different graph types. </p> <p> This talk is joint work with Tetsuo Deguchi and Erica Uehara (Ochanomizu University) and Clayton Shokwiler (Colorado State University), with support from the Simons Foundation (#354225 and #52412) and the Japan Science and Technology Agency (CREST Grant Number JPMJCR19T4, Deguchi Lab) and JSPS KAKENHI Grant Number JP17H06463. </p>",
        "season": "FALL 2019",
        "date2": "20191108"
    },
    "21": {
        "speaker_id": 21,
        "date": "November 15, 2019",
        "video": "https://www.youtube.com/embed/StoaNWadOwE",
        "title": "Aspects of High Dimensional Expansion.",
        "keywords": [
            "High dimensional expansion",
            "simplicial cohomology",
            "random complexes"
        ],
        "abstract": "<p> The Cheeger constant is a measure of the edge expansion of a graph, and as such plays a key role in diverse mathematical areas, in particular in combinatorics and theoretical computer science. In recent years there is an interest in higher dimensional notions of expansion that likewise provide a quantitative measure of cohomological acyclicity of a complex in dimension <em>k</em>. In this talk we will focus on a <em>k</em>-dimensional version of the graphical Cheeger constant called <em>coboundary expansion</em>, and on a related parameter called <em>cosystolic expansion</em>. After introducing these notions and outlining their relevance to random complexes and to topological overlap theorems, we will discuss two results. The first concerns an application of cosystolic expansion to a stability version of the cohomological classification of <em>G</em>-covering spaces (joint work with Irit Dinur). The second is a lower bound on coboundary expansion under certain symmetry assumptions (joint work with Dmitry Kozlov). </p>",
        "season": "FALL 2019",
        "date2": "20191115"
    },
    "22": {
        "speaker_id": 22,
        "date": "November 22, 2019",
        "video": "https://www.youtube.com/embed/n-vVAeLBbJg",
        "title": "Non-topological persistence.",
        "keywords": [
            "topological persistence",
            "concrete category",
            "weighted graph",
            "coherent sampling",
            "ranging feature",
            "steady feature"
        ],
        "slides": "https://drive.google.com/file/d/0B_dw9G-4cPi3MTNGUFdmcXlUWlFQZzdGa0NPQmJpXzB1QjlN/view",
        "abstract": "<p> After recalling classical topological persistence, I introduce the generalization of the persistent Betti number functions to what we call persistence functions. These are defined axiomatically on a wide class of concrete categories. Then, three types of processes generating persistence functions are shown: coherent samplings and ranging or steady features. Examples of all of them are given on weighted graphs coming from real situations. This is based on a joint work with Mattia G. Bergomi, Pietro Vertechi and Lorenzo Zuffi. </p>",
        "season": "FALL 2019",
        "date2": "20191122"
    },
    "23": {
        "speaker_id": 23,
        "date": "December 6, 2019",
        "video": "https://www.youtube.com/embed/CzhG0SzcgXY",
        "title": "Topological exploration of neuronal network dynamics.",
        "keywords": [
            "network dynamics",
            "persistent homology"
        ],
        "abstract": "<p> One of the paramount challenges in neuroscience is to understand the dynamics of networks of interconnected neurons. In this talk I will describe a novel approach to classifying network dynamics that employs tools from topological data analysis. The efficacy of our method was established by studying simulated activity in three small artificial neural networks in which we varied certain “biological” parameters, giving rise to dynamics that could be classified into four regimes, and showing that a machine learning classifier trained on features extracted from persistent homology could accurately predict the regime of the network it was trained on and also generalize to other networks not presented during training. I will also discuss the application of these methods to networks of actual neurons in mice. This is joint work with Jean-Baptiste Bardin and Gard Spreemann.</p>",
        "season": "FALL 2019",
        "date2": "20191206"
    },
    "24": {
        "speaker_id": 24,
        "date": "January 24, 2020",
        "video": "https://www.youtube.com/embed/EGOvOcaQvqw",
        "title": "Delaunay triangulation of manifolds.",
        "keywords": [
            "computational geometry",
            "computational topology",
            "Delaunay triangulation",
            "manifold"
        ],
        "abstract": "<p> The Delaunay complex is a natural structure to consider when seeking to triangulate a space equipped with a metric. It plays a central role in the development of algorithms for meshing Euclidean domains. In applications where an anisotropic mesh is desired, a standard approach is to consider a Riemannian metric defined over the domain and to construct an approximate Delaunay triangulation with respect to this metric.</p> <p>In the case of surfaces, it has been shown that a Delaunay triangulation exists if the set of sample points is sufficiently dense but this is no longer true in higher dimensional manifolds: sample density alone is not sufficient to ensure that the Delaunay complex is a triangulation. To walk around this difficulty, we first introduce perturbation algorithms in Euclidean space that make the Delaunay triangulation of well-distributed point sets quantifiably stable with respect to perturbations of the metric or of the point positions. We then adapt this Euclidean perturbation algorithm to the context of compact manifolds equipped with a metric that can be locally approximated by a Euclidean metric. In particular, this includes Riemannian metrics, as well as the extrinsic metric on submanifolds variations of which have been exploited in algorithms for reconstructing submanifolds of Euclidean space from a finite set of sample points. The simplicial complex produced by our algorithm is naturally equipped with a piecewise flat metric that is a quantifiably good approximation to the metric on the original manifold. </p>",
        "season": "SPRING 2020",
        "date2": "20200124"
    },
    "25": {
        "speaker_id": 25,
        "date": "February 7, 2020",
        "video": "https://www.youtube.com/embed/IbTGmxAvAlM",
        "title": "Algebraic Systems Biology",
        "keywords": [
            "algebraic systems",
            "biology",
            "models",
            "topological data analysis (TDA)"
        ],
        "abstract": "<p> Signalling pathways can be modelled as a biochemical reaction network. When the kinetics follow mass-action kinetics, the resulting mathematical model is a polynomial dynamical system. I will overview approaches to analyse these models with steady-state data using computational algebraic geometry and statistics. Then I will present how to analyse such models with time-course data using differential algebra and geometry for model identifiability. Finally, I will present how topological data analysis can provide additional information to distinguish these models and experimental data from wild-type and mutant molecules. These case studies showcase how computational geometry, topology and dynamics can provide new insights in the biological systems, specifically how changes at the molecular scale (e.g. MEK WT and mutants) result in phenotypic changes (e.g. fruit fly mutations). </p>",
        "season": "SPRING 2020",
        "date2": "20200207"
    },
    "26": {
        "speaker_id": 26,
        "date": "February 21, 2020",
        "video": "https://www.youtube.com/embed/5aeWC1PwUNE",
        "title": "On the Geometric Hypothesis of Banach.",
        "keywords": [
            "geometric hypothesis",
            "Banach",
            "Hilbert space",
            "conjecture"
        ],
        "abstract": "<p> The following is known as the geometric hypothesis of Banach: let <em>V</em> be an <em>m</em>-dimensional Banach space and suppose all <em>n</em>-dimensional subspaces of <em>V</em> are isometric, <em>n > 1</em>. In 1932, Banach conjectured that under this hypothesis <em>V</em> is a Hilbert space. Gromov proved in 1967 that the conjecture is true for <em>n=</em>even and Dvoretzky derived the same conclusion under the hypothesis <em>m=infinity</em> and <em>V</em> a real Banach space, V. Millman proved the analogous when <em>V</em> is a complex Banach space . We prove this conjecture for <em>V</em> a real Banach space of dimension <em>n=4k+1</em>, with the possible exemption of 133.</p> <p>The ingredients of the proof are classical homotopy theory, irreducible representations of the orthogonal group and convex geometry (ellipsoids). At the end of the lecture, will discuss the case in which <em>V</em> is a complex Banach space of dimension <em>n=4k+1</em>. </p>",
        "season": "SPRING 2020",
        "date2": "20200221"
    },
    "27": {
        "speaker_id": 27,
        "date": "March 6, 2020",
        "video": "https://www.youtube.com/embed/E4bhPpZxtIg",
        "title": "On the interplay between DNA topology, elasticity, and its biological role.",
        "keywords": [
            "Elastic rod theory",
            "Immersed boundary method",
            "DNA supercoiling",
            "gene regulation",
            "DNA",
            "biology"
        ],
        "abstract": "<p>Topological properties of DNA molecules play important role in biology. The ability of cells to control DNA topology is essential for their survival, and topology also controls the geometrical properties of the molecule which influence its function. Advances in the theory of DNA elasticity clarified our understanding of this role and other phenomena associated with biological function and storage of DNA. Classical elastic rod models have been applied to DNA supercoiling, knotting, and cyclization, while base-pair level models of DNA made it possible to incorporate the effects of nucleotide sequence and the negative charge of DNA in new mesoscale models of complex DNA-protein assemblies, which yielded insights into the role of DNA deformability in gene regulation. More recently, simulations of the dynamics of elastic rods submerged in a viscous incompressible fluid has been conducted in order to gain understanding of the behavior of topologically constrained DNA molecules. This lecture will give an overview of recent research on the above topics. </p>",
        "season": "SPRING 2020",
        "date2": "20200306"
    },
    "28": {
        "speaker_id": 28,
        "date": "March 20, 2020",
        "video": "https://www.youtube.com/embed/Qw8O8BdNADo",
        "title": "Some Topological Aspects of Fluid Dynamics.",
        "keywords": [
            "vortex dynamics",
            "singularities",
            "Lagrangian chaos",
            "dynamo mechanisms",
            "magnetic relaxation",
            "knotted vortices",
            "stability",
            "finite-time singularity problem"
        ],
        "slides": "https://drive.google.com/file/d/1EY3QIy2W37j-7PxEQEr9QQbJm279n1Ex/view",
        "abstract": "<p>In this this lecture, I will provide an informal introduction to a range of topics in fluid dynamics that have a topological character. These topics include flows with boundary singularities, Lagrangian chaos, frozen-in fields, magnetohydrodynamic analogies, fast and slow dynamo mechanisms, magnetic relaxation, minimum energy states, knotted flux tubes, vortex reconnection and the finite-time singularity problem. I will conclude with a number of open questions concerning these topics. </p>",
        "season": "SPRING 2020",
        "date2": "20200320"
    },
    "29": {
        "speaker_id": 29,
        "date": "April 3, 2020",
        "video": "https://www.youtube.com/embed/yll-4kUoboI",
        "title": "Hamiltonian time crystals - why do they exist and how do they move",
        "keywords": [
            "Hamiltonian dynamics",
            "molecular dynamics",
            "knotted molecules",
            "crystals"
        ],
        "abstract": "<p>I explain what is an energy conserving, Hamiltonian time crystal. I show how it arises and how it moves, in terms concrete examples. But according to no-go theorems Hamiltonian time crystals are not supposed to exist, thus I start and show a way around these no-go theorems: I explain why a timecrystalline dynamics needs to take place on a pre-symplectic rather than a symplectic phase space. For this the Hamiltonian needs to support conserved charges, and the occurrence of a time crystal becomes relates to the wider concept of spontaneously broken symmetries. Except that in the case of a time crystal, the symmetry breaking takes place in a dynamical context. I then analyze in detail a general family of time crystalline Hamiltonians It describes the dynamics of string-like objects, such as a molecular chain. I show how the topology of the chain, its knottiness, has a strong effect to its timecrystalline character. </p>",
        "season": "SPRING 2020",
        "date2": "20200403"
    },
    "30": {
        "speaker_id": 30,
        "date": "April 24, 2020",
        "video": "https://www.youtube.com/embed/JSVE-ukefPg",
        "title": "Entanglement of Polymers",
        "keywords": [
            "polymer",
            "gel",
            "entanglement",
            "Gauss linking integral",
            "periodic boundary systems",
            "excluded volume",
            "reptation",
            "linking matrix",
            "entanglement length",
            "viscoelasticity",
            "oscillatory shear"
        ],
        "abstract": "<p> Entanglement in polymeric systems has been central theme since, at least, the work of Sir Sam Edwards, Pierre-Gilles de Gennes, and Jacques des Cloizeaux in the 60’s. Beginning with a somewhat historical discussion tracing these early developments, I will sketch some key elements that have catalyzed my own polymer physics research before focusing polymer gels and the seminal theory of Eleni Panagiotou on polymer entanglement in periodic boundary system models of polymer gels. I will then trace how her dissertation lead to a fruitful collaboration with me and others some whose results will be described next. These concern, time permitting, ideal systems, polyethylene gels, one-dimensional systems, the determination of entanglement length, linking matrices associated to gels, and the relationship between entanglement and viscoelasticity. </p>",
        "warning": "Unexpectedly, the chirping of birds is heard during the final questions.",
        "season": "SPRING 2020",
        "date2": "20200424"
    },
    "31": {
        "speaker_id": 31,
        "date": "May 19, 2020",
        "video": "https://www.youtube.com/embed/91e2kQA5GW4",
        "title": "Computational homology in statistical genetics: applications to cancer genomic data.",
        "keywords": [
            "breast cancer genomics",
            "statistical genetics",
            "topological data analysis (TDA)",
            "copy number changes",
            "computational homology"
        ],
        "abstract": "<p>Genomic technologies have revolutionized the field of genetics. In particular, the identification of genetic elements has greatly benefited from statistical genetics tools that, through association studies, test thousands of genetic elements for a given phenotype. </p> <p> In this talk I will present a methodology that combines topological data analysis with statistical genetics to identify genetic signatures (in the form of copy number aberrations) in breast cancer. The proposed topological encoding of these chromosome aberrations allows to: (1) map chromosome aberrations across the cancer genome using the zero homology group (2) build predictive models using machine learning techniques (3) identify some co-amplifications of the genome using the first homology group (4) identify cancer driving genes when incorporating a fiber bundle-like structure to the data. </p>",
        "season": "SPRING 2020",
        "date2": "20200519"
    },
    "32": {
        "speaker_id": 32,
        "date": "June 25, 2020",
        "video": "https://www.youtube.com/embed/WWwMf8Nd494",
        "title": "Backbone Free Energy Estimator, a New Geometric Tool in Structural Biology.",
        "keywords": [
            "proteins",
            "free energy",
            "geometry",
            "viral glycoproteins",
            "capsids",
            "biology"
        ],
        "abstract": "<p>Hydrogen bonds stabilize the crystal structures of most proteins. In the aqueous environment, they lie at the edge of stability and hence are easily formed and broken, especially those with high free energy. </p> <p> Using a Boltzmann-like formalism, empirical sampling of their geometry leads to free energy estimates, thus allowing a priori predictions of protein regions primed for structural rearrangement. One among diverse applications involves viral glycoproteins and capsids, namely those proteins employed by viruses to fuse with or penetrate the host cell. Here the methods are used to identify sites of interest for vaccine/drug/testing development, in particular for the SARS CoV-2 virus that causes COVID-19. </p>",
        "season": "SPRING 2020",
        "date2": "20200625"
    },
    "33": {
        "speaker_id": 33,
        "date": "August 21, 2020",
        "video": "https://www.youtube.com/embed/UBts4ZuU2yU",
        "title": "A CW-complex of Monotone Polyhedral Paths: Geometric/topological meditations about the performance of the Simplex Method.",
        "keywords": [
            "polyhedral graphs",
            "convex geometry",
            "convex polytopes",
            "CW- complexes",
            "Simplex Method",
            "monotone paths on polytopes",
            "directed graphs",
            "analysis of algorithms"
        ],
        "abstract": "<p>George Dantzig’s Simplex method is a work horse of modern computational mathematics. Because linear programs (LPs) appear in all areas of application the Simplex methods was elected as one of the top 10 algorithms in the 20th century. Surprisingly, despite its popularity and almost 80 years of research we still do not fully understand its complexity and behavior. </p>  <p>To bound the number of iterations of the Simplex method we take a geometric point of view and investigate the possible lengths of monotone paths inside the oriented graphs of polyhedra (oriented by the objective function). We are interested in both the shortest and the longest monotone paths possible and estimate the (monotone) diameter and the height of some famous combinatorial polyhedra (such as TSP, fractional matching polytopes, and others). But how far apart are two monotone paths of an LP? E.g., if I use two pivot rules the Simplex method traces two paths, is there a notion of distance between them?. As we look at all monotone paths together we see a metric space structure which can be used to count how many are there or to generate them randomly. This comes from a very natural graph (the flip-path graph) and CW complex structures (cellular-strings complex) on the set of monotone paths These objects are important in topological combinatorics (Baues complexes and polyhedral subdivisions studied by Billera, Sturmfels, Gelfand, Kapranov, Zelevinsky and others in the early 1990’s) and in discrete optimization (In particular the complexity of the simplex method with work going back to Klee). In my talk I will discuss some natural counting problems associated with the discrete geometric situation. Our main enumerative results include bounds on the number of monotone paths, and on the the diameter of the space of monotone paths (how far are two monotone paths from each other?). The picture is fairly complete in dimension three, but plenty of open problems remain for high dimensional polytopes. </p> <p>The new theorems presented in my talk come from three recent papers (in Arxiv), the first joint work with Moise Blanchard (MIT) and Quentin Louveaux (U. Liege) the second joint work with Christos Athanasiadis (U. Athens) and Zhenyang Zhang (UC Davis), the third with Sean Kafer (U. Waterloo) and Laura Sanita (Eidhoven U).</p>",
        "season": "FALL 2020",
        "date2": "20200821"
    },
    "34": {
        "speaker_id": 34,
        "date": "September 4, 2020",
        "video": "https://www.youtube.com/embed/o4CK1MZ8984",
        "title": "Homological Percolation and Persistence.",
        "keywords": [
            "percolation",
            "persistent homology",
            "stability",
            "topological data analysis (TDA)"
        ],
        "abstract": "<p>One of the key goals in topological data analysis is find or infer the global structure of a sampled space by correctly determining the homology groups. Given a sample (data) embedded in Euclidean space (or some more general space), the general pipeline is to build a distance based filtration and compute the corresponding persistence diagram. The standard way of proving results about the result is via the bottleneck stability of persistence diagrams. However, it turns out that in many cases this provides a highly pessimistic approximation result. In this talk, I will present recent results which show that the structure of an underlying space appears much earlier than expected and is remarkably stable. I will describe how these results fit into our understanding of the stability of persistence and show how the persistent approach can be useful in new ways. The talk will assume some passing familiarity with persistent homology and TDA but will not assume any previous knowledge about percolation. </p>",
        "season": "FALL 2020",
        "date2": "20200904"
    },
    "35": {
        "speaker_id": 35,
        "date": "September 18, 2020",
        "video": "https://www.youtube.com/embed/nyO4KQTmwzU",
        "title": "The Truncated Interleaving Distance for Reeb Graphs",
        "keywords": [
            "reeb graph",
            "interleaving"
        ],
        "abstract": "<p>Reeb graphs and main other related graphical signatures have extensive use in applications, but only recently has there been intense interest in finding metrics for these objects. In this talk, we introduce an extension of smoothing on Reeb graphs, which we call truncated smoothing; this in turn allows us to define a new family of metrics which generalize the interleaving distance for Reeb graphs. Intuitively, we ``chop off'' parts near local minima and maxima during the course of smoothing. After formalizing truncation as a functor, we show that when applied after the smoothing functor, this prevents extensive expansion of the range of the function, and yields particularly nice properties (such as maintaining connectivity) when combined with smoothing. Further, for certain choices of the truncation parameter, we have additional structure which we can take advantage of to construct a categorical flow for any choice of slope <i>m</i> in <i>[0,1]</i>. Using the infrastructure built for a category with a flow, this then gives an interleaving distance for every <i>m</i> in <i>[0,1]</i>, which is a generalization of the original interleaving distance, which is the case <i>m=0</i>. While the resulting metrics are not stable, we show that any pair of these for <i>m,m'</i> in <i>[0,1)</i> are strongly equivalent metrics, which in turn gives stability of each metric up to a multiplicative constant. This talk is on joint work with Erin Chambers and Tim Ophelders. </p>",
        "season": "FALL 2020",
        "date2": "20200918"
    },
    "36": {
        "speaker_id": 36,
        "date": "October 2, 2020",
        "video": "https://www.youtube.com/embed/fZkMwgKswEg",
        "title": "Magnetic helicity: decompositions and methods of localization.",
        "keywords": [
            "helicity",
            "wavelets",
            "poloidal-toroidal decomposition"
        ],
        "abstract": "<p> Magnetic helicity is an ideal MHD invariant; it measures geometric and topological properties of a magnetic field. The talk will begin by reviewing helicity and its mathematical properties. It can be decomposed in several ways (for example, self and mutual helicity, Fourier spectra, field line helicity, linking, twist, and writhe). The talk will also review methods of measuring helicity flux, as well as applications in solar and stellar astrophysics. </p> <p>The poloidal-toroidal decomposition of a vector field will be discussed, with a generalization to arbitrary simply connected compact surfaces. I will then discuss some new developments in measuring localized concentrations of helicity in a well-defined, gauge invariant manner, using wavelets. </p>",
        "season": "FALL 2020",
        "date2": "20201002"
    },
    "37": {
        "speaker_id": 37,
        "date": "October 16, 2020",
        "video": "https://www.youtube.com/embed/mLUozD6-Db4",
        "title": "COVID-19, Viruses, Recombination and Topology",
        "keywords": [
            "COVID-19",
            "viruses",
            "recombination",
            "topological data analysis (TDA)"
        ],
        "abstract": "<p> COVID-19 is a disease caused by a coronavirus named SARS-CoV-2. As the virus has been spreading around the world, hundred of thousands of viral genomes have been sequenced. Genomes provide an accurate record of variation and evolution and can inform how these viruses emerge and evolve. In this talk I will discuss how mutations and recombinations shape SARS-CoV-2 evolution, and how topological data analysis techniques can help to understand the role of these processes in the emergence of this and other potential future viruses. </p>",
        "season": "FALL 2020",
        "date2": "20201016"
    },
    "38": {
        "speaker_id": 38,
        "date": "November 6, 2020",
        "video": "https://www.youtube.com/embed/qaU4P5AJkH0",
        "title": "Detecting geodesic circles with selective Rips complexes.",
        "keywords": [
            "persistent homology",
            "selective Rips complex",
            "geodesic space",
            "closed geodesic"
        ],
        "abstract": "<p> Persistent homology is a well known invariant encoding geometric properties of an underlying metric space. While the nature of this encoding and precise geometric information it contains are not well understood, it is known that geodesic circles (a special class of closed geodesics in a geodesic space) can sometimes be detected with one- or higher-dimensional persistent homology. </p> <p>In this talk we will consider a converse task: we want to use persistent homology to detect as many geodesic circles in a space as possible. To that end we introduce a new construction of complexes called selective Rips complexes. They can be thought of as custom made complexes designed to detect geodesic circles. It turns out that employing selective Rips complexes we can detect and locate a fairly large class of geodesic circles using one- and two-dimensional persistent homology.</p>",
        "season": "FALL 2020",
        "date2": "20201106"
    },
    "39": {
        "speaker_id": 39,
        "date": "November 20, 2020",
        "video": "https://www.youtube.com/embed/lpgcG4ZdmNc",
        "title": "A landscape of knots: TDA and dimension reduction techniques in theoretical mathematics.",
        "keywords": [
            "knot theory",
            "knot invariants",
            "manifold learning",
            "dimension reduction",
            "topological data analysis (TDA)"
        ],
        "abstract": "<p> A multitude of knot invariants, including quantum invariants and their categorifications, have been introduced to aid with characterizing and classifying knots and their topological properties. Relations between knot invariants and their relative strengths at distinguishing knots are still mostly elusive. In addition to Ball Mapper, and machine learning techniques, we develop a new approach using filtrations to analyze infinite data sets where representative sampling is impossible or impractical, an essential requirement for working with knots and the data from knot invariants. Although of different origins, these methods confirm and illuminate similar substructures in knot data created for 10 million knots up to 17 crossings.</p>",
        "season": "FALL 2020",
        "date2": "20201120"
    },
    "40": {
        "speaker_id": 40,
        "date": "December 4, 2020",
        "video": "https://www.youtube.com/embed/7cGPeMBWEwc",
        "title": "Characterizing rare events in persistent homology.",
        "keywords": [
            "persistent homology",
            "random topology",
            "large deviation",
            "representation theory"
        ],
        "abstract": "<p> Indecomposables obtained through decompositions of persistent homology are regarded as topological summary of real data. However, as is well known, there exist pathologically complicated indecomposables in multi-parameter persistent homology in purely algebraic setting, and this fact makes it difficult to build mathematical theory on that setting. Our fundamental question is, how much should we care about such complicated indecomposables in the real data, and what is a suitable framework to study this question? To this aim, we will show several ongoing results, especially, (1) large deviation principle on 1 parameter persistent homology, and (2) law of large numbers on multi-parameter persistent homology. Then we will discuss how these two results (partially) answer to the original question.</p>",
        "season": "FALL 2020",
        "date2": "20201204"
    },
    "41": {
        "speaker_id": 41,
        "date": "January 22, 2021",
        "video": "https://www.youtube.com/embed/E7J9IWqhwN4",
        "title": "Low-dimensional topology and non-Euclidean geometry in nature.",
        "keywords": [
            "statistical topology",
            "low-dimensional topology",
            "unknotted long polymer chain",
            "DNA folding",
            "non-Euclidean geometry"
        ],
        "slides": "https://drive.google.com/file/d/1hBawfHTZBp8uuP1GIFn9naj7MowuFKzV/view",
        "abstract": "<p>In the talk I demonstrate on specific examples the emergence of a new actively developing field, the statistical topology, which unifies topology, noncommutative geometry, probability theory and random walks. In particular, I plan to discuss the following interlinked questions: (i) statistics of random walks on hyperbolic manifolds and graphs in connection with the topology and fractal structure of unknotted long polymer chain confined in a bounding box and hierarchical DNA folding, and (ii) optimal embedding in the three-dimensional space of exponentially growing tissues, like, for example, the salad leaf, and how the hierarchical ultrametric geometry emerges in that case.</p>",
        "season": "SPRING 2021",
        "date2": "20210122"
    },
    "42": {
        "speaker_id": 42,
        "date": "February 5, 2021",
        "video": "https://www.youtube.com/embed/ntwjBdEC_B4",
        "title": "Predicting emergent sequences of neural networks via directional graphs",
        "keywords": [
            "Neuroscience",
            "topological data analysis (TDA)",
            "graph signal processing"
        ],
        "abstract": "<p>Sequences of neural activity arise in many brain areas, including cortex, hippocampus,and central pattern generator circuits that underlie rhythmic behaviors like locomotion. A fundamental question is to understand how the network’s connectivity shapes neuronal activity. Surprisingly, there is a correspondence between unstable fixed points and dynamic attractors. In this talk we will look into different network architectures and the fixed points they produce by decomposing the networks into “directional” components. This is joint work with C.Curto, F.Burtscher , S. Ebli, D.Egas, K.Morrison, N.Sanderson and Y.Zhou.</p>",
        "warning": "Some noises in the video.",
        "season": "SPRING 2021",
        "date2": "20210205"
    },
    "43": {
        "speaker_id": 43,
        "date": "February 19, 2021",
        "video": "https://www.youtube.com/embed/mlQRgR7V898",
        "title": "The magnitude of point-cloud data",
        "keywords": [
            "magnitude",
            "point-cloud data",
            "stability",
            "persistent homology"
        ],
        "abstract": "<p>Magnitude is an isometric invariant of metric spaces that was introduced by Tom Leinster in 2010, and is currently the object of intense research, since it has been shown to encode many invariants of a metric space such as volume, dimension, and capacity.</p> <p>Magnitude homology is a homology theory for metric spaces that has been introduced by Hepworth-Willerton and Leinster-Shulman, and categorifies magnitude in a similar way as the singular homology of a topological space categorifies its Euler characteristic. </p> <p>In this talk I will first introduce magnitude and magnitude homology. I will then give an overview of existing results and current research in this area, explain how magnitude homology is related to persistent homology, and finally discuss new stability results for magnitude and how it can be used to study point-cloud data. </p> <p>This talk is based on joint work in progress with Miguel O'Malley and Sara Kalisnik, as well as the <a href = https://arxiv.org/abs/1807.01540>preprint</a>.</p>",
        "season": "SPRING 2021",
        "date2": "20210219"
    },
    "44": {
        "speaker_id": 44,
        "date": "March 5, 2021",
        "video": "https://www.youtube.com/embed/rDNUX9QGTyc",
        "title": "Topologically Active Polymers and DNA",
        "keywords": [
            "DNA topology",
            "Microrheology",
            "Soft Matter",
            "Living Polymers"
        ],
        "abstract": "<p>Polymer physics principles heavily rely on the assumption that polymers do not change topology (or architecture) in time. This is not the case for DNA, which is constantly topologically re-arranged within the cell nucleus. Inspired by this, I propose to study entangled systems of polymers which can selectively alter their topology and architecture in time and may expend energy to do so. I argue that solutions of these 'topologically active (living) polymers' can display unconventional viscoelastic behaviours and can be conveniently realised using solutions of DNA functionalised by certain families of proteins. </p> <p>In this talk I will present my first excursion into this field and present some recent results on the microrheology of entangled Lambda DNA undergoing digestion by restriction enzymes. Finally, I will discuss some wild conjectures and speculations about possible future directions.</p>",
        "season": "SPRING 2021",
        "date2": "20210305"
    },
    "45": {
        "speaker_id": 45,
        "date": "March 19, 2021",
        "video": "https://www.youtube.com/embed/RpQ2uW98tjo",
        "title": "Pseudo-Seifert surfaces and vortex reconnections in quantum fluids",
        "keywords": [
            "quantum vortices",
            "nodal lines",
            "Schrödinger equation",
            "Gross-Pitaievskii equation",
            "approximation theorems"
        ],
        "abstract": "<p>The quantum vortices of a superfluid are described as nodal lines of a solution to the time-dependent Gross-Pitaevskii equation. Experiments in Lab and extensive numerical computations show that quantum vortices cross, each of them breaking into two parts and exchanging part of itself for part of the other. This phenomenon, known as quantum vortex reconnection, occurs even though the superfluid does not lose its smoothness. This usually leads to a change of topology of the quantum vortices. In this talk I will show that, given any initial and final congurations of quantum vortices (i.e. closed curves, possibly knotted and linked), and any way of transforming one into the other through a generic pseudo-Seifert surface embedded in spacetime, there is an initial condition whose associatedsolution realizes this specific vortex reconnection scenario. This allows us to track the vortex reconnection process at all times, both locally and globally. Key to prove this result is a new Runge-type approximation theorem for the linear Schrodinger equation.</p> <p>This is based on joint work with Alberto Enciso.</p>",
        "warning": "In some moments of the talk, the sound is not clear.",
        "season": "SPRING 2021",
        "date2": "20210319"
    },
    "46": {
        "speaker_id": 46,
        "date": "April 9, 2021",
        "video": "https://www.youtube.com/embed/1epuaERO-os",
        "title": "A toy model of the inertial range",
        "keywords": [
            "turbulence",
            "inertial range",
            "turbulent cascade"
        ],
        "abstract": "<p>In this talk we develop a simple toy model of the inertial range of turbulent flow, based upon a cascade of vortical filaments. The filaments are taken to be helical, one turn of the helix playing the role of a turbulent eddy. A binary branching structure is proposed, involving the splitting of filaments at each step into pairs of daughter filaments with differing properties, in effect two distinct simultaneous cascades. Neither of the cascades of this bimodal structure, in isolation, has the Richardson exponent of 1/3. If cascades are assumed to be initiated continuously and throughout space we obtain a model of the inertial range of stationary turbulence. We impose the constraint associated with Kolmogorov's four-fifths law and then adjust the splitting to achieve good agreement with the observed structure exponents <i>zeta<sub>p</sub></i>. The presence of two simultaneous cascades is responsible for the nonlinear dependence of <i>zeta<sub>p</sub></i> upon <i>p</i>. We also consider the initial value problem and study the flow of energy to small scales.</p><p>This is joint work with Andrew Gilbert.</p>",
        "season": "SPRING 2021",
        "date2": "20210409"
    },
    "47": {
        "speaker_id": 47,
        "date": "April 23, 2021",
        "video": "https://www.youtube.com/embed/GtSeDYRgdlE",
        "title": "Knotoids and protein structure",
        "keywords": [
            "knotoids",
            "proteins",
            "topology",
            "folding",
            "knots"
        ],
        "abstract": "<p>Approximately 6% of proteins deposited in the Protein Data Bank are known to fold into conformations that are non-trivially entangled. The vast majority of knotted proteins form simple knot-like structures with up to three crossings. However, there are a few examples of proteins having up to six crossings. Interestingly, even though they are not ubiquitous, knots in proteins have been conserved within species that are separated by millions of years of evolution. This might imply that knottiness provides some advantages to proteins but this theory is still being contested. Besides the role of knotting in proteins, the pathway that the backbone of a knotted protein follows to reach its native folded state is still an open question. To this date, researchers have suggested several mechanisms for protein self-tying that are based on wet lab experiments, numerical simulations, mathematical theory or a combination of all the above.</p><p>In this talk, I will discuss how the theory of knotoids can be applied to characterize the topology of linear proteins. I will present the basics of the theory, some knotoids invariants, the computational pipeline that we developed for this, as well as our tabulation of knotoids. I will also present a statistical distance that we define on distributions of projections of a protein backbone seen as knotoids and I will show how this distance allows us to infer possible folding pathways of trefoil knotted proteins. I will close this talk by briefly discussing applications of knot theory to genomics. </p>",
        "season": "SPRING 2021",
        "date2": "20210423"
    },
    "48": {
        "speaker_id": 48,
        "date": "May 7, 2021",
        "video": "https://www.youtube.com/embed/Q8x8cJNYzjc",
        "title": "Applying TDA on genomic and metagenomic data",
        "keywords": [
            "topological data analysis (TDA)",
            "persistent homology",
            "genomics",
            "metagenomics"
        ],
        "abstract": "The field of computational biology aims to gain insights from biological data. In particular, from genomic and metagenomic data through tools that for some time now include geometric and topological methods. In this talk we will mention two applications of these tools in this setting: Using persistent homology to aid machine learning classifiers in a phenotype prediction task for Parkinson's disease, and to help identify organisms present in a metagenomic sample.",
        "season": "SPRING 2021",
        "date2": "20210507"
    }
}